{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Dont buy it, just slide to unlock, it will be with you tonight!!\n\nThe best ever tablet made and available on earth."}
{"rating": 1.0, "product_id": "B00GNKRFEA", "review": "I was weary of purchasing a refurbished product and this item proved my theory. The screen has a mind of its own, I cant even type in it. It said it was in very good condition. That was a complete lie. Very disappointed."}
{"rating": 3.0, "product_id": "B00GNKRFEA", "review": "Well we have had this iPad for a year now and it will not charge anymore. I'm changing my rating from 5 stars to 3. Did not come with a warranty. I should have known better."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Use it every day"}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "Its too bad that they did not include more information on how to operate this pad. I am new to this type of thing so am having lots of trouble with it. I guess it is a learning thing and it will take time to figure out how it works.\nThere is no one around to help me at all so I just try this and try that and hope it works."}
{"rating": 3.0, "product_id": "B00GNKRFEA", "review": "Broke day after  warranty company"}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "I love me iPad.  User friendly, quick, sleek and portable.  Whats not to love."}
{"rating": 1.0, "product_id": "B00GNKRFEA", "review": "Product was advertised as new and was not."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Very good I pad  thank you"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Excelente producto."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Excellent and parents love it!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Very nice product."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Ive been very happy with the mini iPad had to replace my other one because the screen cracked while replacing the battery.  Decided to replace it with the newer version."}
{"rating": 1.0, "product_id": "B00GNKRFEA", "review": "Charger that came with it never worked"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Yeah, of course good it is. You know more about this product than what I have to say."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Ipad works great for what i needed it for. Its perfect as a remote control also"}
{"rating": 3.0, "product_id": "B00GNKRFEA", "review": "They mailed it out promptly, it is working great so far! The only thing is that there must be a short in the charging cord. Because it is hard work to charge if not in the right position."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "T love this ipad mini!"}
{"rating": 3.0, "product_id": "B00GNKRFEA", "review": "This thing says used but man i was not expecting the damage it had done to it. Theres dents and chips in the housing and it had chucks of its corners taken out. It looked like someone had destroyed this thing and put a screen on it.. it works just not exactly \"ecstatic\" about its condition.."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Purchased as a gift for niece. She loved it."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Size"}
{"rating": 1.0, "product_id": "B00GNKRFEA", "review": "I purchased this for my special needs daughter for Christmas, unfortunately there is something jammed in the headphone outlet and there is no sound. Frustrated"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "My grandkids love it"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "It's perfect! Daughter is very happy with it!"}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "Item arrived as described, good function. Would purchase again from seller."}
{"rating": 1.0, "product_id": "B00GNKRFEA", "review": "<div id=\"video-block-RB7N1YNZ03DZY\" class=\"a-section a-spacing-small a-spacing-top-mini video-block\"></div><input type=\"hidden\" name=\"\" value=\"https://images-na.ssl-images-amazon.com/images/I/B1G3ftPZRMS.mp4\" class=\"video-url\"><input type=\"hidden\" name=\"\" value=\"https://images-na.ssl-images-amazon.com/images/I/61MmUKPoaLS.png\" class=\"video-slate-img-url\">&nbsp;Didnt ship the right model  the screen didn't work in the middle and battery went down 20 percent in half hr"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great ipad. i love it. wished i had got the 4 instead"}
{"rating": 1.0, "product_id": "B00GNKRFEA", "review": "My iPad mini 2 is so slow I decided to upgrade. It operates in two speeds, slow and stop. .  I went to apples website to order the iPad mini 4. I received a message saying  The Apple Store app now requires IOS 10.0 or later.  When I tried to upgrade I received a message your iPad is up to date. I cannot even buy an Apple product on their website using an Apple iPad mini 2.  Good job Apple. Fail"}
{"rating": 1.0, "product_id": "B00GNKRFEA", "review": "I cant get it to work its asking me for a passcode as soon a I turn it on. For what I paid if theres a passcode on a NEW iPad it should be where it can be found. To this day Im still trying to get it setup."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Perfect highly recommend"}
{"rating": 1.0, "product_id": "B00GNKRFEA", "review": "Two went belly-up in two years. Both times, issues with the screen going flickers. Well cared for, so no excuse there."}
{"rating": 2.0, "product_id": "B00GNKRFEA", "review": "Huge deep scratch righr in the middle of the screen. Disappointed."}
{"rating": 1.0, "product_id": "B00GNKRFEA", "review": "I purchased this ipad mini more than 2 weeks .i just got today .it was missing the charger and more than that .it doesn t work.very disappointed"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I bought this iPad for my daughter as a birthday present. Her brother has one and they were always fighting over whose turn it was to play games. It's nice that she has her own and we can use it for fun educational games. The iPad was in the exact condition I expected and works wonderfully."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Love it. Live on it. Great price"}
{"rating": 3.0, "product_id": "B00GNKRFEA", "review": "prize"}
{"rating": 2.0, "product_id": "B00GNKRFEA", "review": "I'm not extremely happy with my purchase. The charging cord is loose so it doesn't always charge unless you put something under the plug to keep it in place.  I've already downloaded all of my favorite apps so I am reluctant to return it. I'm not sure what to do about it."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "arrived quickly. no complaints"}
{"rating": 1.0, "product_id": "B00GNKRFEA", "review": "Got this as a birthday present for my son and straight out of the box the charger isn't working, so now both my son and I are extremely disappointed. Going to contact the seller to see what kind of response I get. Will update accordingly."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Very pleased!  Fast delivery and IPad is fine as far as we can tell.  Thank you!!"}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "Awesome Product!\nApple iPad Mini 2\n\nI purchased this iPad a few months ago. I bought it with the intention of using it daily for my college classes. This is a quality product that was received in great condition. Any person who is familiar with the Apple software will find this product very easy to use. I would recommend this iPad mini to college students of any year. It will help students to stay organized, and is also much easier to carry to class than a laptop. Below, I will evaluate this product based on its battery life, storage capacity and daily usefulness.\n\n- Battery Life: I was very impressed by the battery life of this iPad. In a normal class week, I will use my iPad for three days, and charge it that third night. It will be fully charged by the next morning, and ready to use for class that day. Most technological products do not even compare to this battery life. If you are not using the iPad for long periods of time, the battery life could last up to a week.\n\n- Storage Capacity: This Apple iPad has the storage capacity of 16 GB. I have found that if I could purchase a product like this again I would buy one with more storage availability. If you are interested in only putting apps that you will use for school, this would be enough storage. If you are interested in having both school and personal apps on your iPad, I would suggest getting a model with more storage.\n\n- Daily Usefulness: You will be able to use this product each day. If you are a college student, you can use this product to take notes in class, write papers, study, research and many other things. There are apps that make it easy to upload professor's notes onto your iPad so you can follow along in class. To make things easier, I suggest purchasing a keyboard for your iPad. I use my keyboard to quickly takes notes in class and write papers. If you are not a college student you can use the iPad to take photos, stay organized and keep up to date on news or social media. There are endless possibilities with this project.\n\nThe quality and versatility of this product are definitely worth the price you pay. I have used this iPad in all of my classes this semester, and it has made my semester much easier. I wish I had this iPad for my past semesters. I am confident that you will benefit greatly from this using this iPad in your college career. The iPad will help you become more organized and make your life easier. I definitely recommend this product!"}
{"rating": 1.0, "product_id": "B00GNKRFEA", "review": "activated devices . faked lightning cable"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Received the product quickly. Also received personal note from seller for contacts for any issues. IPad worked perfectly. Set it up in minutes and was using it shortly. Works great and even came with a charger. Very pleased"}
{"rating": 3.0, "product_id": "B00GNKRFEA", "review": "home button doesn't work everytime u hit it and microphone seems to go out on and off but not bad for 130 w 50$ off w visa card approval"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great condition jus as said"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Everything but a telephone. Great for traveling, read, connect via email etc., take photos... compact"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "It is the best one we bought from Amazon because I have 4 iPads and they all never lasted and this one is still working"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Works well"}
{"rating": 3.0, "product_id": "B00GNKRFEA", "review": "The product does me Meet my expectations. One thing is that the home button isn't always responsive. It take more then one time to go to home screen and has to be press harder then usual. As This goes on it's feel like it's becoming harder to use the home button on the device and some point might not work at all."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Works very good."}
{"rating": 2.0, "product_id": "B00GNKRFEA", "review": "It had a defect"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great iPad mini new. In box"}
{"rating": 2.0, "product_id": "B00GNKRFEA", "review": "I have had this device for a matter of months and it was working great.  However,  today  it decided to completely die on me.  It won't turn on.  I am highly disappointed in the quality of this product."}
{"rating": 1.0, "product_id": "B00GNKRFEA", "review": "Bought the iPad mini last October and with very minimal use have had nothing but trouble. It will not charge and we have went through several chargers thinking it was that, but even with a new apple mini iPad charger still inst charging what a waste..  Would have been nice to get a full year out a product!!!!!!!!!!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Bought it for my 2 years old didn't wanna buy a new and expensive one but it work better than my 450$ one"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "There's really no comparison to an iPad. Period. Sure they're kinda pricey, but you'll never regret it."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Very happy with what I got :)"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "It's so cute and works well. I love it."}
{"rating": 1.0, "product_id": "B00GNKRFEA", "review": "Received faulty unit, the screen loses contrast after being on for about 30 minutes, contacted seller but got no response."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "Wife loves it. Kept crashing droid tablet but this one only infrequently. She uses apps I don't so we have different results."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I got a great deal! It didn't even look touched. Of course, it had different packaging but not a dent scratch or fingerprint to be seen."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Apple rules. Microsoft has no taste. Skip the surface and buy an iPad Mini 2. Spend the money and stop the annoying crashes."}
{"rating": 3.0, "product_id": "B00GNKRFEA", "review": "I received the I pad that was suppose to be brand new. However I got no charger and the screen didn't have the screen cover which makes me think it wasn't new. One plus side was that I received the I pad super fast within a week."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "This was purchased as a gift. At first the registration and passwords had not been removed and that proved to be quite frustrating, however the seller did all he could to make it right, and we are very satisfied with the purchase and results."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Thank you."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I got this about 3 weeks after I ordered and the product works a year later "}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Thanks mom"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Received in a timely manner and was just as expected! Brand new in package!"}
{"rating": 2.0, "product_id": "B00GNKRFEA", "review": "Button sticks"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "My daughter loves it!!"}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "Excellent in every way, except that the 3rd and 4th generation have much more accurate color. This screen trends cyan and green - it is severely lacking in reds and magentas. So don't plan on using it for displaying a photography portfolio if you care about color. The 3rd gen is MUCH better in that regard."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "The iPad works great as I expected being new. The 2s are hard to find now so I was excited that I was able to find a new packaged iPad mini 2. The only reason I gave it 4 instead of 5 star is because the charge doesn't always work. I'm not sure why but I'll plug in the iPad over night and in the morning there is no charge on it.  I have to resort to using my iPhone charge at times. Other then that I'm happy"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Love it love it love it!!!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Bought as gift it was well recieved"}
{"rating": 1.0, "product_id": "B00GNKRFEA", "review": "Unable to turn on or charge. Returned with out any trouble, like that part of this purchase."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Pefect"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I got this as a gift for my mother, and she loves it! It's big enough for her to work with and she loves the games and features that she can use on it."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Exactly as described and quicker than expected"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Look like new, not scratch, working so far"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "It's a great iPad.......I had no problems with shipping or receiving my item"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Excellent price value product."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Bought this for my husband for Christmas and he loves it. He had a regular iPad before but loves this as he only uses it to cruise the net."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Excellent product"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "such an awesome device! as expected Apple quality. worth the money"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Gave as a gift for Christmas, it is absoutlely amazing, new as described in new ipad box and shrink wrapped  - it is an IPad mini so all is great bought a cover off Amazon for about $15 and it works nicely - the only thing is the iPad always has \"sprint\" next to wifi signal so not sure what this is about.  I have a iPad mini 1 and am strongly considering buying another for myself."}
{"rating": 1.0, "product_id": "B00GNKRFEA", "review": "I've had it for less than a week and it won't cut on anymore. I'm pretty pissed. I don't even know who to contact. I've tried holding down the home and lock buttons. Nothing works."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Wont put it down, easy breezy to use and always dependable"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Looks good!!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Extremely happy with purchaseThis was my fourth purchase, this is by far the best choice in the iPad mini line between the first model through the last..."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Love it!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Excellent"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "For the Phantom 4 it rocks!"}
{"rating": 3.0, "product_id": "B00GNKRFEA", "review": "Slow"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I was please with product and service."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Like new works great"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great product. Arrived on time"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "gift for my mom, she loves it to use at the house"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "awesome."}
{"rating": 1.0, "product_id": "B00GNKRFEA", "review": "Do not buy damaged item"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "So glad we have new technology in our classroom!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "The ipad mini 2 came as expected.  Shipping was fast and efficient.  Overall, I couldn't be more pleased with this purchase!  I will order from seller again."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "It was a gift to my son. .He loves it."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Excellent deal on this, got for the kids (2 of them) and they love this.  Use it for educational apps and music lessons."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "Other the typical problems with using Apple products it functions advertised."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "works fine"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Arrived in perfect condition!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Good Product , Fast service"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Bought for 5 year old granddaughter loves it."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "nice"}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "iPad works great, condition is very good. The price was fair. I would order from this seller again!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I bought an IPad Mini 2 refurbished but you would have never known! Fabulous product."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Gift for college granddaughter.  It was a hit.  She has it up & going!  Arrived right on time for Christmas.  A++++"}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "good"}
{"rating": 3.0, "product_id": "B00GNKRFEA", "review": "I bought this iPad for my 4year old grandson and he loves playing games. I give this iPad a 5 rating. It keeps him busy."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "This is my every day iPad and go-to mobile device. The size is perfect and the screen size allows me to do and see things that are impractical on my iPhone 6."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Im very very happy with the ipad, arrived on time and it is on very very good conditions!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Product was value priced and very thoroughly wrapped. Although it might be premature to comment on product quality, it seems outstanding---so far, anyway!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "gave as a present my granddaughter loves it"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great product"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Arrived promptly, exactly as advertised. No issues at all."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Got this for my husband, his first dip into apple products! He is very happy with it."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "Very good"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Perfect!!! Thank you!"}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "Love this tablet since it meets my needs resting on the sofa--watching videos, surfing wwb, reading e books with one hand at the right distance. We own several of these tablets and my grandkids are kept entertained when they visit."}
{"rating": 1.0, "product_id": "B00GNKRFEA", "review": "This iPad was my son's Christmas present. He opened it this morning and it looked like a brand new iPad. The box was wrapped just like a new one. When we turned the iPad on for the first time, there is a blue line going through part of the screen. There is also a small mark on the back of the iPad (see pictures). This all leads me to believe the iPad is not in fact new, but refurbished. We requested a return, and are sending it back. :("}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "EXCELENT!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Just as perfect as my old iPad!"}
{"rating": 2.0, "product_id": "B00GNKRFEA", "review": "blue ribbon runs thru the screen.  Not in good shape."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great price!  Fast shipping!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Perfect!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "My son loves it!!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "The best purchase"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Arrived very quickly.  Love it."}
{"rating": 1.0, "product_id": "B00GNKRFEA", "review": "Zippers are awful. Containers that it comes with are nice.  Leather feels great. But it's collecting dust because without properly working zippers it's all kind of pointless. Should have returned it but didn't get there in time. I would NOT recommend this item. Sorry."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Love it! It look as new and it works really well so far. Just got it in the mail a few days ago and have had no issues no scratches on it so I'm happy. Bought it for my son cuz he is an apple fanatic."}
{"rating": 3.0, "product_id": "B00GNKRFEA", "review": "It has no sound and battery has problem. I'll either send it back or see if someone can fix it."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "It's an Apple product ... excellent!"}
{"rating": 2.0, "product_id": "B00GNKRFEA", "review": "It did not come in its original packaging and it was meant to be a gift.  Just a little disappointed"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "The Apple I Pad mini 2 is really a very nice machine to have around. It's perfect size allow you to gain quick acess to the net by just opening the case cover and you're right where you left off when last it used instead of booting up a desk top with Windows 10. Even though they are not hard to find, I wish Apple would supply a pen stylus to use on the screen rather than using your finger. I would certainly recommend the mini 2 to everyone..."}
{"rating": 1.0, "product_id": "B00GNKRFEA", "review": "After 1 year, normal use, then the battery died. -Endy Kaiser"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "So far so good. Thank you for the great deal"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "is as described"}
{"rating": 3.0, "product_id": "B00GNKRFEA", "review": "Speaker on the iPad doesn't always work. It sounds like it is blown at times"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "My daughter LOVES her iPad mini"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I used an apple iPad for years, but walked away because of the greater flexibility, app selection and aggressive pricing of Android tablets and the power and compatability/portability of the Surface product line. My wife got an Ipad mini tablet which I borrowed on a trip a few weeks ago. I was astounded by the reading clarity of the mini and tried to edit some documents on the unit. After a long weekend end of marking up drafts and docs, I bought a mini JUST for those functions. It now comes with Mr on every business trip."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I love this tablet. Better than the mini3 and much cheaper!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Brand new! Wonderful device"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "perfect gift for our grandaughter"}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "I need to learn more about using product"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Excelente..."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Very nice"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Ordered two. No issues with either."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I'm not sure what else could be said about the iPad that hasn't already been said.  This is a dependable tablet that will last a long time if treated well.  I am able to consistently update apps and the iOS, so it is always current and never has a problem running anything.  I use it in a classroom setting, so it is important that it works every day, which it does.  I have been an Apple guy for a number of years and will continue to be one with quality products such as this."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "My husband loves his new tablet."}
{"rating": 3.0, "product_id": "B00GNKRFEA", "review": "It ok for wat I use"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Awesome!"}
{"rating": 1.0, "product_id": "B00GNKRFEA", "review": "IPad froze within a week of usage!!!!!!! Now is completely unusable..!!!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "A much needed review.\n\nWith 2017 closing in, is the Apple iPad Mini 2 still worth it?\n\nIt is still definitely worth it! If you really want something reliable without breaking the bank and still have the amazing and beautiful build quality of an iPad mini, this is your best bet.\n\nVisuals:\nLooking at the iPad mini, it truly is a masterpiece. The screen is glossy and crispy due to the retina screen. The button lay out in my opinion, is PERFECT. I like the fact that the power button is on a different side apart from the mute/autorotate switch and the volume rockers making it impossible to accidentally turn off your iPad when trying to raise/lower the volume. The back side is mesmerizing, especially in space gray. The Apple logo stands out to the eye along with the space gray surrounding it and makes it easy to the eye.\n\nPerformance:\nThe battery lasts a good amount of hours when used at a high load. For example, playing some of the graphic demanding games with the brightness raised all the way up. Even though this is an old model of the iPad mini, it still performs decently. The performance sometimes throttled when doing something really demanding but it is bearable.\n\nConclusion:\nEven though this iPad mini is three years old, almost 4, it still is a perfect device to have when having a tight budget. Especially if only used for basic tasks such as:\n- checking emails\n- taking notes\n- alarm clock\n- reading\n- instant messaging\n- FaceTime\n- Social Media\n- YouTube\n- games\n- etc\n\nIf you really want an iPad mini but very tight on budget, then this is perfect for you.\n\n- Nick Salvador"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great deal."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great product"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Enjoy going back to Apple.\nHad a Samsung tablet for a while. They're cheaper, but come with all kinds of stuff pre-installed that takes up your memory and you can't get rid of. The mini has a clearer picture and is more responsive. Still have the Samsung (writing this review on it, lol) but prefer the mini. Great camera too."}
{"rating": 1.0, "product_id": "B00GNKRFEA", "review": "The worst Ipad experience ever.  First they delivered it to my doorstep while I was at work and someone stole it.  When I finally did get the ipad it is terrible.  The buttons are sticky and its frustrating trying to type when they don't work properly.  At first, the pad was overheating when it charged, and now it barely charges at all, or it says is is not charging when it does. Seems like this was a reject model."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I bought this for my mother. She's 85 and had never touch a computer. She LOVES her iPad "}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Worked perfect and still is."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "My boyfriend loved it I bought it for his  birthday  it was  jus as  described no problems shipping  on time. Best gift ever!!!"}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "As described"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I'm very satisfied to used it."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "This was a gift for my son and it is wonderful! I'm very pleased! Thank you!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I love this iPad it works great"}
{"rating": 3.0, "product_id": "B00GNKRFEA", "review": "Apple has issues with its products.  When they update they take your memory more and more.  They try to get you to buy more memory and add more bloatware on their updates.  So I am going to say this ipad is okay.  I like it but have two major complaints.  It had problems with the wifi and the audio from the get go.  On and off phone with apple care. They replaced it with another one the same model.  Did not have time to sit and complain with them again but the wifi connection is not that good and if you want to listen to anything without headphones the volume does not go that high.  Essentially, for the price you would think it would be better made. Imagine trying to watch prime videos on there with the connection going in and out or watching utube. Not only that if you want hear anything on those speakers more than a foot away you have a problem.\n\nI have laptops that connect to the same wifi and hold signal better than this.  One was a windows lenovo laptop  and it connected and held signal better than both the replacement and the original ipad mini.  Considering the ipad mini is something you are using on the go to be lighter and easier to handle than a laptop it should be working better than it does.  Apple care is just a pain in the neck run around.  The replacement was not much better than the original.  I just expected more from Apple.  I am not happy so I am not planning on buying another one even when this gets outdated.  Another problem is their icloud buy more memory and the doubling of the itunes when  you sync your music."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Fast delivery and brand-new.  So far everything works as advertised."}
{"rating": 1.0, "product_id": "B00GNKRFEA", "review": "It wasn't what was advertised and I pd good money for a bad product."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "We bought this to FaceTime and message with our kids and grandbabies. It works great and has been such a blessing to have! I am excited to also use this for reading books and much more. The mini size is so amazing and it fits perfectly in my purse. I also like that it is not too big and heavy. This makes it so much easier for me to carry around when I am showing people things on FaceTime. I am extremely happy with and love my new mini iPad!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Perfect condition!"}
{"rating": 1.0, "product_id": "B00GNKRFEA", "review": "This iPad was purchased to replace a broken iPad at our school.  We purchased a refurbished one to save money and neglected to purchase a warranty.  Now, after only one month of use it is no longer working.  Basically, we lost all our money on this device and it will not be refunded.  Word to the wise....purchase the warranty or buy it new from Apple."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "So far so good. For it being used and refurbished you'd never know it. It looks like brand new. Plus the lightening cables, wall plug,screen protector and case. I'm my opinion this is a great deal!!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Ipad mini 2 is great. Lots of useful apps available through App Store. I like the form factor of the mini more than the regular iPad because you can hold it in one hand. Works great as an e-reader. Bought three in total: one for me, and one for each of my parents."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Everything was great!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Love it highly recommend"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "So far we have three IPad mini 2, one for myself and two for the kids. The wife is more of a Nook person, but she said she wants an iPad for work. It's sleek, stylish, compact, and user friendly. The standby and run time are great, we've never had the battery die on us.  I even convinced my mom and brother to get one. Great product, no complaints."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great product. Fast delivery. Item arrived in great condition. My daughter loves it. My mom loves it. I bought one for each of them since they live in different states. They love using FaceTime (which is free) to keep in touch with one another. It is simple to setup and use. Great for all ages."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Awesome product and delivery experience!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "This was used but you would've hardly know that.  A good value"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Arrived on schedule.  Works great!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great deal buying it used!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "After a 2 years I bought this IPad, it's still working fast, the battery last the right time. My IPad worth it."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Love my Ipad Mini!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Product was exactly as described. Thank you"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Bought for my 8 year old grand daughter who uses it in elementary school.  She loves it and it perfect for the lessons her teacher gives."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Love the IPad was in great shape like new. But was disappointed that the ad included cord and plug and was not with it and the case I included smelled strongly of cigarettes.. Had to buy a cord to use it."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Exactly what I wanted! Just like new. Thank you!"}
{"rating": 2.0, "product_id": "B00GNKRFEA", "review": "My first apple after androids. Many non-intuitive functions and illogical features. Returned it and bought a Galaxy. So much better."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I bought this for an awesome price! I was skeptical about what condition it would arrive in, but holy crap! It's PERFECT!! No cosmetic damage whatsoever, brand new charger still in the wrapper. It's just perfect."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "just like new, works and looks perfect"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Received very quickly, works great, very good battery life"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Yay!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "It's an iPad, nothing more I can say that hasn't been said about this item"}
{"rating": 3.0, "product_id": "B00GNKRFEA", "review": "I like the product but it said I was low on storage too fast like two weeks after I got it.  so I think there maybe a minor problem. Its a good ipad overall."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "Good construction but disappointed there is no flash for the camera, come on Apple."}
{"rating": 3.0, "product_id": "B00GNKRFEA", "review": "I had a Samsung Galaxy 7 and I did not Like it because it did not do too well in dark place. so I decide to give it to my wife and get the Apple iPod Mini I was very happy when I receive it but soon find out that it too did not do well in bad lighting. but I do like the photo that it takes on the outside there are mush shaper than the Galaxy"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "good product , fast shipping"}
{"rating": 3.0, "product_id": "B00GNKRFEA", "review": "i purchased the used version of this item with the understanding there would be the possibility for minor scratches and other issues. however when recieved the product had red dots all over screen. 80 dollars to replace screen which would total up to 5 more than a new ipad. great product only issue i had was amazon could not help replace the item. wish i could get a better used item but seems im stuck with this one."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great Ipad at a great price..."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Works great and the mini is much more functional than the air or standard size. Syncs everything effortlessly and you can pick and choose what you want to sync. I ordered refurbished and it looks and feels new."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Ipad  Super recommend"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "It's almost brand new, I really like it!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Everything that was promised"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "This product came today and my wife is using it. It's fast and its new, does not look touched by anyone else at all. Exactly as described. We absolutely love it and getting used to it.  quick shipping"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I really like how easy it is to use. I take it  with me on vacation and other places."}
{"rating": 1.0, "product_id": "B00GNKRFEA", "review": "Ipad didn't charge or work.  Took it to apple store and they replaced it.  100% apple.  0% this seller."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Good"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I'll preface this by saying that if anyone can completely destroy and demolish a toy it would be my 5 year old son.  While he is a precious blond haired, blue eyed angel, he is 100% all boy!!  Full throttle all day every day!!!  With that said and as I knock on wood, his iPad mini has stayed in one piece for coming up on one year and I know I have this case to thank for that.  He has given this case every reason to be defeated, but it's holding strong.  The only thing I don't like about it is that the stand is hard to pull out, but that is a minor detail to him since he doesn't use that feature often enough to care.  Don't waste your money on an expensive case.  This one will do the trick!!!\n\nOh...it doesn't have a screen protector so I used pone of the adhesive kind and it has worked perfectly!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Love it. Do not know why I waited so long. I have a macbook pro but this is faster and easier for many things."}
{"rating": 3.0, "product_id": "B00GNKRFEA", "review": "Except no ear phones  but it is a good iPad"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Bought as a gift for my spouse, works perfectly and he loves it! Great battery life too!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great product and delivered on time."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "This is a solid performer, like most Apple products. I wish this version had a thumbprint reader. My kids still each other's passwords, which wouldn't be an issue if it had a thumbprint reader."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Love it"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I use this primarily to run DJI Go to control the camera and get first-person view from my Phantom 3, but it's a great tablet all-around. The size is right, retina display is crystal clear and battery life is phenomenal. I use it every other day on average and the battery still lasts almost 2 weeks."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I already had an i-Pad mini, this was a gift.  Usually, I don't like refurbished electronics, but this was Apple certified, so I took a chance.  It's been great!"}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "It is a good tablet"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "yess i finally got the chance to open my ipad like the people in the online unboxing videos and i must say that a was a sweet feeling everything was brand new and shout to the amazing  company that send the product to me"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Perfect. My daughter has been using this for 6 months now. She loves watching videos on it! Glad i went with an iPad."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Bought it as a gift for my daughter. She loves it. Nice features and a good buy."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Works exactly as expected and shipping was extremely fast."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great price when it was on sale, and it has exceptional quality"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great Product, Fast Shipping"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Bought it for my son.. He loves it.."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Very pleased with the mini. Like the light weight and size. Easy to stick in a purse. Easy to use."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "I couldn't beat the price for an older ipad mini for my kids."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Love it!"}
{"rating": 2.0, "product_id": "B00GNKRFEA", "review": "The IPad did not work at all, We had to take it to a Apple Store in Canada, They replaced it for another iPad."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "Ok"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great iPad just remember this is a wifi ONLY iPad so it did not connect to my wireless company AT&T"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Excellent product. New in package. Super fast shipping."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "It is in perfect conditions"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Very happy with this purchase. My son saved for months to buy this and it is perfect. We mostly use it for games, and it has worked great. I love the affordable price for this older version, but also appreciate the quality that Apple provides."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Love the iPad"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "This product exceeds my expectation.  I purchased my mini2 because I travel a lot and need something larger than my Iphone.  I've been so happy with my ipad mini. It fits perfectly in my purse and is so lightweight."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Purchased this iPad for my Grandson. He loved it. Thanks so much great service."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "My daughter loves it no problems at all."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I love the iPad mini. It's just big enough and has a great colorful screen. I want a second one for around the house."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "fgfg"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Excellent. 5 stars."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great tablet fits well in hands. Light weight."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Just as expected.  Great screen resolution, quick response.  Very happy with it."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Perfect in every way."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "There's probably no point in my saying anything about the iPad mini.  I've been using one for a while now, and it's a fantastic product.  It's light, portable, and sturdy (I keep it in a case with a cover), so I can take it anywhere and have the latest \"New Yorker\" or access to \"Slate,\" eBay, Amazon, and every other site I use regularly.  I can get into my bank account, but for some reason, there's no PayPal app, so I have to use the website.  That's not Apple's fault.\n\nWhat is their fault is the clunky keyboard.  I have a&nbsp;<a data-hook=\"product-link-linked\" class=\"a-link-normal\" href=\"/Samsung-Galaxy-Note-4/dp/B00N532FRU/ref=cm_cr_arp_d_rvw_txt?ie=UTF8\">Samsung Galaxy Note 4</a>, and I appreciate the Android keyboard that allows me to type the alternate keys just by holding them down a moment longer.  The Apple requires me to shuttle back and forth between separate keyboards, which isn't as convenient.  For this reason alone, I will probably get an Android tablet when this one is no longer usable.  The Samsung also has a dedicated \"back\" button; which seems to work better than the iPad's soft link on the upper left of the touchscreen.  When I follow a link in an application, for example, then return to the original app, on the iPad it has to completely reload; on the Samsung, the button returns it to the previous screen instantly.\n\nAnother problem is the built-in obsolescence.  I have a first-generation full-size iPad that's virtually useless; every app I want to use requires a higher OS version than I can install.  I can go directly to the apps' websites with Safari, but it's slow and defeats the purpose of using a tablet.  So far, the mini seems to be OK, but any day now I'm going to be prompted to upgrade \"Accuweather\" and it won't be able to handle it.  I'll probably be able to use my phone as long as I want.\n\nOtherwise, the mini is a fine product, well-made as all Apple products are, easy to use, and convenient.  I wouldn't use it to write this review, but for its intended purpose it's outstanding."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "Never failed me yet and I have used this item flying aircraft for more then two years."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "While I don't like iPads and don't use iPad, I needed one for work, and this works well for me. The screen quality is fine, the battery life is great."}
{"rating": 2.0, "product_id": "B00GNKRFEA", "review": "It started to fall apart within 90 days. The edge of the seam where the exterior and interior covers meet (screen cover) started to separate. Apparently some type of adhesive issue. I missed my return window opportunity so I glued the seams Hopefully it will hold!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "It works fine and has a lot of features to keep one occupied"}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "My wife uses it several hours a day."}
{"rating": 3.0, "product_id": "B00GNKRFEA", "review": "little disappointed. I had a 1st gen ipad that i finally upgraded. The design is OK, but it's still a bit heavier than I'd prefer, especially for reading. I also don't like the fact that they moved the on screen controls (bookmarks, etc)  to the top of the device... it just doesn't make any ergonomic sense whatsoever. This device also has issues scrolling... it \"skips\" as you try to scroll faster, which is really annoying. Maybe it's just me, I probably need to call Apple and see if there is a defect."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "No problems,  seems fine"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Loved it. Would buy from this company again. Came very quickly and brand new as advertised."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great value. Good product."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "I really like my iPad mini. I was hesitant at first to but the mini or I-pad. There is no question now. I have had this for a little over a year now and it is perfect.\n\nI am able to do photoshop work, watch Netflix, buy stuff off amazon just about anything I need."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Exactly as expected and. Great price."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I bought this for my wife for christmas and she is loving it.  Highly recommend seller."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Excellent"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "The iPad mini 2 is a great value if you don't need the latest tech toys and don't mind the lack of a fingerprint scanner."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "No problems, works well."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I love my IPad Mini."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Came in quickly and everything Was as exactly what it said it would be my son is going to love it"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Perfect."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great"}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "Works well"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Was just like new. Would highly recommend this product."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Like new, came in apple original box, im very satisfied, would buy again."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I was looking to upgrade my iPad mini 1 and I originally wanted the 4, but the price made me decide the 2 is okay. I thought that this iPad would start being slow after a few months like my mini 1, but it is still performing as fast as it did right out of the box. It would be nice to have the finger ID on it, but I don't use my iPad as much as my phone so I've dealt with it. The retina display is very clear and I'm still impressed with the design of it and how light it is to carry around. Definitely something good to have for classes or meetings to take notes on, or to play games when you're bored."}
{"rating": 2.0, "product_id": "B00GNKRFEA", "review": "It seems to be real slow I had bought the same one from T-Mobile and it just seems to work better seri doesn't work I don't no if it was just the one I got or its all of them."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Big Android and Windows fan here, but I have to say this product is absolutely superb. The OS is a bit bland and unexciting in all honesty, but otherwise this is great for media consumption. The battery life is absolutely incredible, lasts for a couple days without issue. The screen is nice, quality apps are aplenty, and overall this product is simply the best small tablet available."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "its good no problems at all"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Like New one. I Loved it."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Good"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "love this ipad! I have had a couple of cheap tablets before this and I certainly understand why ipad gets the big bucks. the keypad is very responsive and fun to use. well worth what I paid."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Brand new in box . On time delivery. Would buy again."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Its fast and it works well"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "WOW !!!.  Quick, Fast & Easy. Great product and quality. Awesome buy. Seller #1. Five stars. High recommended. Thanks.!!!!"}
{"rating": 1.0, "product_id": "B00GNKRFEA", "review": "This was my first, and I hope, last mobile Apple product.\nThe device failed in two months up to black non-responsive screen.\n\nAfter spending on-line several hours with technical support, numerous resets, re-activations and restorations they offered me in person to visit a nearest service center that is 80+ miles from my residence.\nThat's not a service I expect to receive.\n\nIf you are not an Apple-maniac and need a good tablet, buy Android device for the same money or even cheaper."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "perfect size for my 5 year old! He loves it"}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "works as expected, excellent."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Delivered on time and as promised. Works great"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Authentic !"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Works well, as described"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great value for a good brand"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Thanks"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "It is a very comfortable size.  Excellent speed."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "It was great, better deal than any others I found"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "She loves it."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "Met my expectations."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Works great !"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Fantastic!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Excellent size and performance. Great value for money option."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "MY WIFE LOVES IT , IT JUST WHAT SHE EXPECTED,"}
{"rating": 1.0, "product_id": "B00GNKRFEA", "review": "Worst time I ever had. This was a gift for my Mom. I wanted a brand new one and got took! Upon turning it on we were prompted to enter a four digit numerical password....excuse me?.....I never put a numerical pass code into this thing. We tried several things but to no avail. Finally, a friend was able to wipe it clean and start over again. However, it came back! We discovered when we were trying to fix it, that it had an I-tunes account with a name attached to it that we do not know. It obviously was a refurbished unit switched on me and hidden to look like it was brand new. What a terrible trick! Shame on Amazon! I will try tech support and hope that will help. I would try buying an Ipad from Amazon....go to the store somewhere so you can be sure no one pulls a fast one on you."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Couldn't be more pleased.  Outstanding product.  Upgraded to 9.3. For free."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great Item!!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I love my iPad Mini 2. So excited when it finally arrived. A lot of power in such a small size. Easy to download apps."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great iPad. I am impressed by the retine display! Handyness is great due to size!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "very good item thanks."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Perfect little device."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I bought this for my daughter and she loves it"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "awesome product"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Is brand new although it did not come in original box, so far the iPad works great"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great price and shipped on time."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I love it and bought two"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "what you expect"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Best tablet below 250$\nLove it so much!"}
{"rating": 2.0, "product_id": "B00GNKRFEA", "review": "I was excited to get my ipad mini 2, but soon the rise waned. Whilst reading news or  articles you may need to go\nforward or backward. Guess what, unlike Samsung's once touch reverse page option, Apple really doesn't want you\ndoing this. They want you to squirm while you are online. So they make you look around the interface for the reverse\npage arrow to click on, or you can swipe with your hand. Is this at the top, or bottom of screen. Well it depends on what\nbrowser your in. Sometimes though none of the above will move the page. Then you are stuck starting and stopping the\nnews article, and trying to find the article again. Oh yeah you can't do internet searches directly, but must look up in dictionary\nmode first, then go to the internet, unlike Samsung's one touch internet lookup option. Pluses are Apples long 10 hr battery\nlength, responsive keyboard and good video rendering. All three of those are superior to Samsung."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I am using this iPad mini as a remote for my home automation system (control 4).  It has great screen and is the perfect size for my application.  I have a regular size iPad and I must say this mini is pretty slick.  It is a great size!"}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "The IPad Mini 2 is an amazing product, it comes exactly as advertised and is in perfect working condition it even comes with a full-year warranty.  I recommend this product for anyone who wants a fast inexpensive product."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I love it, its small and compact and I can throw it in my purse."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Simply Love it! Apple & iOS rocks"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Love the ipad mini 2!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Just right price fits my budget way to Amazon"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Awesome!  Clearly head and shoulders above the rest!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Nice..."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "It's great"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "We got this as a suprise for my grandmother. She absolutely LOVES it! It's very nice. Would defiantly recommend it."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "received as expected. the product was as described. will do business with this seller everytime I get the opportunity."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "This is an amazing purchase. The iPad mini 2 is really cool. Let's break this down, the battery life is amazing, it's an apple product so of course it's great with it's touch response, as well as those really cool multi-touch gestures. The App Store has much more applications available, which is why I leaned more towards the iPad versus an android tablet."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Perfect gift"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Nice seller  , not complain Apple arrived perfectly"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Love It. A lot better than the Dell Venue that I had."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I purchased this iPad Mini because I wanted to bring something smaller and lighter than a laptop to school. Since I am in college, it is much easier to have something that you can use during class to go on the internet, have access to your emails, and more instead of being on your phone, going to the library to use the computers, and breaking your back from carrying your laptop the whole day. This was very helpful."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Works well."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Exactly what I expected. Good buy."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Gave it as a gift, she loved it."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "It was a gift. They seem to like it a lot."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Very nice product..."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "easy to set up and start - easy to navigate"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Just what I wanted!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Excellent!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Love it, love it. I have a larger IPad but this mini is so portable, I use it more."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Working great"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Love it"}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "Just purchased, so far so good. Beware the setup - if you require a MAC address for WiFi, disable this in order to get the Mac address from\nthe Ipad. Then you can re-enable this requirement.  Also, Apple requires an apple-id, then demands a credit card for purchasing apps.\nSince this Ipad was for our daughter, and we didn't want her purchasing any apps, finally realized there was an option for credit card =\nNone, but it still required a billing address! Sigh. Okay, after spending hours frantically setting up the Ipad, it works well and she\nis very happy so far."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Just what I imagined it to be. This is perfect."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great. Just as expected."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Arrived on time. As advertised."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Works perfectly and is exactly as described, no problems at all. I went with the most basic shipping and unfortunately it arrived the very last day but that's is no ones fault but mine. Would buy from them again! Thanks !"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Perfect for my 8 year old to do her homework, use as an alarm, watch YouTube, and FaceTime/text me when she's at her dad's house.  I thought an iPad might be too much for such a young child, but it's turned out to be invaluable.  She's actually gotten more independent with this product since she doesn't need my help logging into her school website for quizzes or dreambox.  I do have to make her \"earn\" screen time however.  Otherwise, she'd never leave it alone."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Good price, love this ipad mini 2. I investigated at the Apple store whether to spend the money on the ipad mini 4, but the new features didn't move the needle. This ipad mini 2 has a nice sharp screen and works great.  I also own the larger ipad and we have two iphones. I liked this model so much I purchased a second one for my son."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "It is an iPad. Nothing to complaint."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "My older son loves it."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Perfect repalcement for my recently dropped IPad mini 2.  Functions perfectly and identical to my prior one which I had for 2 years."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Good"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "great"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Arrived prompt and perfect! Made for one happy little nephew thank you!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "This has been everything I could have asked for in a tablet.  This has given me the luxury of mobility, reliability and battery life that surpasses anything else I have used."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "it is well worth it"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Love my iPad"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Love it.. Need to learn how to fully use it as it is my first apple product."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Perfect as expected"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great purchase at a fair price."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Love it"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "It's awesome. I like it so much."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "We had a mini DVD player for our toddler that kept scratching DVDs, because they get dropped of course. How much easier to upload videos that never wear out? Plus we have Netflix and HBO now. This is an Apple product so it fits right in with the rest of our Apple products. Our daughter loves it (and so do we). It me be double the price of a portable DVD, but it's well worth it!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great iPad.  Perfect size.  Great deal."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "Much better than original."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Good price for brand new iPad mini 2's.  Its got the higher resolution than the first iPad mini and faster SoC (future proofing a bit).\n\nI got four of them, two in black (space grey), and two in white (silver) for some family members."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "The iPad arrived in perfect condition in its original packaging as promised. It was the best birthday gift for my daughter."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great experience with a light weight easy to use tablet."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "A+"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Everything we expected."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great iPad Great Price"}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "Device is awesome. The only bad thing was it took too long to ship. But otherwise got what I wanted how I wanted."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "This is a great little electronic! It's sleek, slim and fits great in your hands!\nThe high resolution Retina display is amazing and the speakers have a warm, crisp, clean sound!\nIt's everything you could ask for in a tablet. Although it's at the top of its price range for similar tablets, it well worth the price!\n\nThe only knock I have on this product is the Wi-fi.....it's VERY WEAK...you won't be able to watch HD videos unless you are in the same room as your router and even then MAYBE.\n\nNote: For all Android users and lovers...stick to a Android Tablet... alot of your my favorite apps like Kodi and Google Extentions (Ad Blocker Plus) don't work for Apple products. Advertising pop - ups pop up often and there is no way to combat them completely like Ad Blocker Plus on the Android platform"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "great second ipad"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Love it"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Very easy to use, would recommend to anyone."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "I was nervous about getting the iPad Mini 2 instead of a more recent version, but the price difference was too much to resist. I'm glad I got the Mini 2.\n\nUpdating to iOS 9 was very easy. In fact, I think the iPad asked to update in the initial setup. The iPad Mini 2 is missing some functionality but I don't even remember what that functionality was. It has done EVERYTHING I have asked it to. So do some research before you buy, but definitely consider the iPad Mini 2.\n\nI use it almost exclusively for \"creative\" pursuits - digital painting and such so a stylus was absolutely necessary. It handles apps like Adobe Draw very well.\n\nI only have two issues. The camera is only 5MP, but file transfer from other devices (including Android) is super-easy. The other is an issue for all iOS devices that I know of. My model has 16gb storage; I'd love to increase that with an SD card, but you can't do that with any iOS product. What you buy is what you have."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Does what it is supposed to do."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "I like this tablet more than my old Android tablet, but I'm glad I bought it when it was on sale!  I don't think it's enough better than my Android tablet to justify its original cost."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great!"}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "I bought it for my son and daughter in law\nThey really like and i get to face time with grandkids The 32 bit will give them lots of space for pictures The shipping was quick and easy"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great mini! Great price!! Way cheaper than Apple Store!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great product even refurbished"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "The Ipad Mini 2 is a must buy since, it comes in a small portable package and still packs the power of the ipad air with same specs  and also has the Retina display, it was pricey when it came out but now, at this price its a steal! Check out our full review of it!\n\nWanna Know More? Have a look: [...]"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Ecp Hefner had great customer service and the IPad is excellent!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Very fast shipping. Brand new mini, factory sealed. I was very glad that a signature was required for delivery. Would order again."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Just as advertised.  Setup and running great after software update.\nNo complaints."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "love it"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great Tablet.  Wish I could have connected it to a wifi/telephone service"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I was worried about getting a refurb but it is pristine and works perfectly.  Thanks."}
{"rating": 2.0, "product_id": "B00GNKRFEA", "review": "Don't buy it from A&E Deals. The iPad was super gitchy.\nIt was a christmas gift for my mom. After two weeks of use, the screen started to freeze. I reset it and it seemed to fix the problem. Two weeks later, it got stuck on her Facebook screen and this time, it wouldn't turn off. So, we drained the battery (let it die), returned it, and got an exchange from a different seller... hopefully the new one won't be glitchy at all."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "quality is great ease of operation excellent"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "It works nice"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Good deal and brand spankin new very happy with purchase"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Hard to beat an apple product for quality and performance.."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "The iPad mini 2 is a superb device and I love mine. It is a great size, the screen is the best I've ever seen, and the apps are mostly wonderful (except for the appallingly bad Apple backup software). But am I the only one that is having durability problems? Although I've given mine the best care possible (it has never had a scratch or drop), it has failed 5 times in 2 years. To Apple's credit, they replaced it for free 4 times and this last time cost me only $200. But still, isn't that a lot of failures? My other 4 iOS devices have never failed or had any problems at all."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "thank you"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Excellent"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "This is a great iPad for every day use. I use it for shopping on Amazon, watching Netflix and other TV, web browsing, and reading books. I put mine in a strong case so I can't comment on durability."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "You just can't beat an iPad. Very easy to operate. I bought it to use when I'm out and about and don't want to carry larger iPad Air."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Excellent Product. Thanks."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great as expected from apple"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Bought these for work and use them every day.  Great tool to accomplish what I needed to be done."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Apple still one of the best!"}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "I purchased the ipad  mini and I fell in love with it but I had to return it because 16GB is not enough for me.  I installed an update and I realized the update was 1GB!.  I have the same update on my 32GB iPad Air and it was half the size and it used up less space."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Is what it says it is. Great tablet, great price."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great Quality! Better than expected. I highly advise this purchase!"}
{"rating": 1.0, "product_id": "B00GNKRFEA", "review": "Does not fit the iPad very good and iPad fell out of it and broke.  Does not protect iPad."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "What else is there to say about the Apple Mini-iPad except to say it's awesome."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "This item was worth every penny. Received in expected amount of time. Sealed item as expected."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I LOVE IT - that is all I can say"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "As described"}
{"rating": 1.0, "product_id": "B00GNKRFEA", "review": "All I can say is I'm just shocked. I thought I purchased a like new iPad mini 2. When it came in the mail ... It turned on & immediately noticed the screen was messed up & Siri would go on by herself. When I messaged stating I wanted a refund because it wasn't worth the money. Their reply at first was to refund me $25.00 & to keep the iPad. I spend $210. I was not happy about their reply. But after a few messages they decided to give me back a full refund I'm not saying all their products are bad. But this one specific was horrible & whoever was messaging me at first was extremely rude."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "GREAT"}
{"rating": 1.0, "product_id": "B00GNKRFEA", "review": "Ordered Black with Space grey. And received a White and space grey iPad, details also showed it ran iOS 7 which is the only reason I wanted it because I did not want iOS 9. And it came with 9.1. Completely defeated both purposes I had for this. Terrible"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Happy 13 year old received this for Christmas"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Would purchase from with again  A++++"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "FAbulous gift!  Hasn't been off of it since Christmas!"}
{"rating": 2.0, "product_id": "B00GNKRFEA", "review": "When I recieved this, I noticed that there is a ton of image ghosting on my unit, and I cant replace it now. Buying from refurbished is a gamble and for the future you should buy new Apple tablets, as if they don't work you have the warranty."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "PERFECT FOR MY NEEDS  AND A GREAT PRICE"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great product---great VALUE=Happy Daughter and Happier Parents!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "As always Apple is the best! This is a genuine apple product. Was sent very fast and in perfect condition! Extremely happy!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "very nice. not bad at all for a small screen - the wife loves it."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Kid loves it.  Apple #1"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Awesome device."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I am not an Apple addicted person but this is with no DOUBTS the BEST TABLET OUT THERE.\n\nbefore buying an Ipad Mini 2 I tried a Fire Tablet HD 8. I returned the Fire HD after half a day of using it. I have to admit that there are no equivalent tablets to the iPAD. The battery life is great, reading from it is a wonderful experience, the retina display is stunning.\n\nSometimes It is important to think a bit more about purchases. When I bought a fire HD tablet I spend $140, with $100 more you can buy an Ipad Mini 2 and have 10 more functions and perfect experience.\n\nEnd of review."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I love this thing! I was worried that it would be to small to really do anything with, but no; I do all my invoicing on it and a majority of my web surfing, along with gaming (FF7 just came out for the iPad!!!). Like I said, I love this freakin thing!"}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "I like the IPad, but was disappointed with the device description."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great product. Worked great out of the box. Easy set up. Faster than iPad mini 1."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great product!!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "WE LOVE IT!!! AXTUALLY MY HUSBAND HAS TAKEN OVER ITS USE.  GREAT MINI!!!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "All work"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Excellent. Works and came shipped in perfect condition."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Love it. Easy to use, nice screen resolution. I'm a windows person, but the Ipad Mini 2 is a great tablet."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "good"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "this is the nice product"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "The best Ipad I ever had."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Good buy"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "This iPad still rocks! Performs well enough to refrain buying an iPad Mini 4"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "TKS"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Just what I expected from an Apple product.  Was delivered very quickly"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Awesome product, great price"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "A great gift!!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Loved it"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "despite being a couple of years old this tablet is a huge improvement over the 1st gen. I love this tablet size and I've owned multiple tablets. can't totally replace my kindle paperwhite but awesome."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "very good"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "DOOOO NOT BUYY THIS I BOUGHT IT WITH MY OWN MONEY ND IT DONT EVEN CHARGE CAME TURN ON ? Nd dosnt charge with 3 diffent chargers nd when i try too charge it starts acting up on nd offf doo not waste 200$ for this goo too your closes store. Nd pick it up there !!!!!!  Better off trusting them i trusted these random people."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Item for Raffle in August 2016 (Have not opened actual product box)."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "i use this everyday and provides a of fun. I'm using the retina mini right now as I write this review. I loved the original mini because of the amazing build quality and comfortable size. Now it's essentially all the good things we had before but with crystal sharp display and faster processor.\n\nThis device reeks of quality and craftsmanship. I sold my Nexus 7 and Nexus 10 to buy the retina mini and I've made an excellent choice. While the Nexus tablets are great they feel like budget tablets. I prefer the smaller size tablets like the mini and Nexus 7, but I found the Nexus 7 to be a tad too small. It's even smaller than 7\" because of the onscreen buttons. I'm much happier with the size of the mini for writing emails, surfing web pages, and most of all reading books and comics. Sharp as real paper right up close.\n\nIf money is not an issue the retina mini is totally worth the $399 price tag. I thought the original mini was worth more than the $329 they charged for it. I'd have paid $349. It's that good. So I'm okay with the retina mini price. I would say Apple is the Acura of tablets. Classy, elegant, and high quality."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Just Great!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I shattered the screen of my iPod Touch 4G, probably a year ago.  I dropped it on a tile surface.  Aw, snap.  I kept using it, though, for my podcasts & music. I'm happy to have found a fair deal on Amazon for this Mini 2.  The processor chip is much more current, and the screen resolution is the same.  I do everything I used to do (with my iPod Touch 4G) on this Mini 2, but the screen size and capabilities are so much better.  RIP iPod Touch.\n\nI bought this because I had a bunch of apps that I didn't want to lose.  With that aside, I was surprised at how well this 2-year-old device surpassed my expectations.  The battery life is excellent (10 hours while running, new) and it is a much better value than the iPad Mini 4 currently.  The newest iPad's battery life is much shorter than this one's is.  The newer one has the fingerprint security feature, and a newer processor, but if you want to save money and have something that is comparable, pick this one (until they release the iPad Mini 5 next year)."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I got this yesterday and I loved it so much!!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Beautiful, i like the iPad and the delivery is rapid."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "just like it said brand new looks and works great thnx"}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "We had to restore factory settings because it was in another language and wouldn't let us proceed, but once we got that taken care of it worked like a charm."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Fast, awesome graphics, reasonable price....I love it"}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "I am pleased with this purchase."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I like like this iPad mini! big screen to watch videos and movies and look at photos and tons of space to store music, my photos, and install apps! amazing retina display screen, high quality video recording, I like it and its very handy, big but not so big and small but not so small, not bulky at all!\n\nI even made a detailed VIDEO review of this in YouTube. Check it out. Just copy and paste this link to YouTube:\nhttps://www.youtube.com/watch?v=sdjHhkEI6rI"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Best Pad Ever; Compared to a Widows or Android Based Pads that we have!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Neat!  Product is as expected."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "For some reason this iPad doesn't hold a charge for very long... I'm finding we have to connect it to the charger more often than our Samsung tablets. #TeamApple though."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I bought this for my 7 year old, he loves it."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Love it just wish it had more gigs at this price point ...when it comes to tablets nobody is more reliable than Apple I have many tablets about 4 androids and 2 Apple iPads my android tablets only last me a few months for the most part 2 years for my best one but my iPads last me about 5 years and counting so I decided to spend a little more money to get my kids a descent tablet this time around because I actually save money in the long run buying iPads rather than a new android tablet every year I like this iPad mini so much I just ordered another one today the problem I'm having is with finding a well made case for it the one I bought is bs smh"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Fantastic tablet"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Love it!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "very nice"}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "Solid Unit , could not expect more"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "awesome"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Works great and just as advertised. A+"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Was in great condition! Purchases this for my Grandson who is 7 years old. I loaded it up with learning apps. Especially for reading."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "As advertised.  Another terrific apple design."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Terrific product and great value. Apple hit it out of the park with this one."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Stop reading rewiews and just get one."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great device I am still using it every day on my daily life"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Very Good product so far."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "All is fine"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I actually won this iPad, but at the current ~$280 price point, I would buy it. The Retina display is more than hype; the screen resolution is higher on this than my phone, TV, and computer monitor, so even being a 'small' screen (compared to iPad Air) I watch lots of movies in beautiful 1080p or higher. This is my first tablet, and I adore the experience. iOS 9 is great. Apple's money comes from their software, and as such it fits seamlessly with my iPhone and aging 2009 MacBook Pro. Also, go buy yourself a nice protective case and screen protector (I recommend Otterbox Defender and tempered glass)."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I have had this for a year now and it's still working great. There's not much to say about, cause it's an apple product and they are always great.\nAnyways, you should buy it!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great deal! Works great! The new retina display is really crisp & vibrant, way better than the original display. My only advice, buy one with more storage space, 16GB is not enough!!!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "We bought this for my three-year-old, and it has been a great learning tool, as well as entertainment. The item came exactly as described and I highly recommend this seller."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "Versatile, exceptionally portable, outstanding display and cameras.  Like all apple pads, it sits on its speakers and charge cord."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Product was exactly as described. Brand new, never opened. Boxing was in perfect condition. Fast shipping! I couldn't ask for a better transaction."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Just perfect"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "All perfect"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Very pleased with the iPad Mini 2 purchased from Fox Electronics through Amazon."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Perfect!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "yes it is as good as the fanboys want you to think it is.  Yes it is fast, Yes, a 2 year old could master it in a mere10 mins (yes it's that easy to use)\nAs far as the screen, I don't see the big deal. It's good, not slap yo mammy good, just good, not really different from others..  I swing both ways S5 android phone ,apple Ipad mini,  Both good in there own way.  If you want very very VEEEERY ease of use, yes this is for you"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I'm happy with this device"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Excellent!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "excellent tablet"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Good choice"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Nice"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "the product was in perfect shape, just as described.  worked perfectly.  Thanks for being honest."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I bought this because I wasn't sure I'd use an iPad. I actually really love the size of the mini. Maybe I wish it was a full sized one but maybe not. Great little starter iPad to figure out if you like the apple ecosystem. Beautiful screen for watching movies and playing games which is primarily what I use it for. I also use the kindle app on it for my studies and it's a lovely little e-book reader."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "As advertised"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Best price! Good tablet"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "It works perfectly as expected. If you don't have the cash to spend on the newer models this one will suffice and do pretty much everything you need it to. I love it and the retina display is very impressive"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Accurate description, fast delivery and fair pricing"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "fantastic"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Beautiful. Works great."}
{"rating": 1.0, "product_id": "B00GNKRFEA", "review": "Returned found much cheaper"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Love it! Resolution is amazing and the price point can't be beat! Would definitely recommend"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Excellent item in original box, felt like I went to Apple Store and bought it fast shipping. Good experience."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Love it - love it...love it....and will be getting another one soon !!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "good"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "my first ipad its exellent"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Best tablet"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Fantastic!!!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Good price"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Pretty good. Complete new and works perfect"}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "Only problem, screen went totally black on me, took days to figure out how to get it started again. Still under warranty, will be contacting Apple"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "awesome"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Perfect"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "as advertised"}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "Got here 2-3 days early. Brand new. Works. Only had it a short while will update. Everything is great so far THANX"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "great product"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Love it!!! Use it daily"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Love my iPad Mini!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I have been using since last few months and there is no issue it is giving good service. i liked product."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Love it"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Hello, this review is for anyone thinking about purchasing an iPad mini 2...\n\nI picked up my brand-new iPad mini 2 just three days ago. Before this purchase I already owned an iPhone 5c, and a MacBook Air 13-inch. I wanted a high-performance tablet that would be fully compatible with my other devices. Within a few hours of setting up my new iPad mini 2, I could tell that I was going to be more productive and have the freedom of taking my work to more places.\n\nI'm incredibly pleased with how I can start working on one device, and pick up exactly where I left off on another. Documents are synchronized instantly between my phone, my laptop, and my tablet. Using the free iCloud drive that Apple offers to each of its users, I never have to worry about not having the current version of the document in front of me, it's always right there at my fingertips.\n\nThe iPad is an incredibly cost-effective computer due to all the available FREE applications offered in the online Apple Store. Apple also includes free fully functional Word-processing, Spreadsheet, and Presentation creator applications. All three programs are fully compatible with Microsoft Office formats. You can create documents and save them as native Apple formats, or you can save them as MS Word, PDF, Excel, PowerPoint, and other popular formats.\n\nI love the fully functional built-in Safari browser. You can browse a website on one device, and pick up where you left off on any of the other devices without having to do a thing, it's automatic  I find this feature to be extremely handy and allows me to be more productive. For those that don't prefer to use Safari as your browser, Google offers a tablet version\nof Chrome. There are many other free browsers which you can also install; including Opera, Mercury, Dolphin and others.\n\nAfter working on, and playing with my new tablet practically nonstop all weekend, I'm very delighted with performance. The A7 processor chip and the 1-gigabyte of RAM, makes this tablet incredibly responsive. There is no lag time when opening or moving between apps.\n\nWith this all being said, please don't confuse the iPad mini 2, with the original iPad mini (Version1). There is a night and day difference between the two models. From the ram, to the processor chip, the screen clarity, and the overall speed, the iPad mini 2 is far superior when compared to the original iPad mini.\n\nThanks for reading. I hope that this product review was helpful."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "Excellent battery and good performance."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "It is.... bar none the best tablet I have owned.  Gave it to my wife when her tablet went south.  I got an Amazon 6 tablet free from a earned points credit card redeem.  I like it also, but Apple is where it's at for me..."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Thanks"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "It's an iPad...come on. 5 Stars automatically."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "very good"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "my son loves his new i-pad mini"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Works as expected.  Device was in good shape and seller did a good job with description."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I traveled by plane  recently with my regular iPad and found it rather bulky even with a large purse so the solution was to buy a mini Ipad.  I feel it will serve the purpose, especially for an overseas trip."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I was very fortunate to win one of these from my job-we are made to take quizzes periodically that enter our names into drawings and my name was drawn-and it is awesome! I had an iPad 2 (which I gave to my mom) and while I really liked it, it doesn't even compare with this newer iPad mini 2. The display is so much better and I am amazed by how fast the iPad mini 2 is. Everything is so smooth with no lagging at all. The size is perfect. It is big enough that I can see everything I am doing but not so big that it is cumbersome. If I were buying one, I would buy this over the iPad Air all day. It has the same specs, and is cheaper and I like the smaller size better. I also love the physical aspects of it. It looks and feels amazing in the hand and the metal buttons are very nice. I also like the dual speakers that Apple has gone with in favor of the single speaker design of the older iPads. The dual speaker design definitely sounds better than the old single speaker design. I absolutely love my new iPad mini 2 and feel so blessed to have won it for free."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Some reviewers here have complained about this being a used product...it is not, mine came in factory packaging and works great."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "Was a gif"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "It's great exactly what I ordered"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "It's a apple.  It is small.  It is great for reading.  Love it."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Little disappointed in the color. Space gray? Last time I was in space there was no gray in that shade."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I love this mini iPad. I bought it because I travel a great deal and  always take my iPad with me. The regular-sized iPad gets heavy and cumbersome. I wanted something that I could put in my handbag that would add very little weight. This is it! It's perfect and actually feels like a book in my hand with the cover that I bought for it. I am very happy with this purchase. It arrived on time with no problems!"}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "Looks great and works fine. Only complaints are it was listed as black but the one I received was white and the earphone jack is noisy."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Well first off it's an iPad. It's been proven to work well and does what you want. I like the smaller size. easier for me to carry around especially in meetings. A little small for my fat fingers but it gets the job done that I need done so I tolerate the inconvenience. Vendor is great. quick ship. packaged as it should be. Very responsive and followed through to make sure all was in order when received."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Use it every day"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Excellent product. Have had no issues with it. Was used, but there wasn't even a scratch on it."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Can't live without"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Love my iPad!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Love my apple products, this one was a gift. I wish they would support the older iOS versions for longer though, a couple of years and these guys are rendered useless."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "It's a great tablet. But It could have a version with more memory..."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "I absolutely love my iPad mini 2! I am a non-tech grannie who received this as a gift, but use it to the full extent of my capabilities for web surfing, videos, games, and as my only camera. While I use it for hours daily, lately I'm finding it difficult to recharge. I have found through a little research this is sort of a common problem with IPad mini 2. I'm not sure if I can solve the problem with a new cord and/or charger or if there may be more serious problems; it has not been dropped or abused, just used a lot.  I would appreciate some feedback for similar problems before I spend lots of  $$$ for a repair inspection to be told the problem is lol simple or that it really is beyond fixing.  Thanks for sharing."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Everything is perfect. I've got the parcel even earlier than the date stated by Amazon."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Really happy with the ipad.  It came in original packaging and was charged and ready for use."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Very fast shipping, came faster than told. Very happy with it. Came as described"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "This item was perfect it had no flaws and came with a box and charger all original I am very happy with this purchase"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "The iPad is in perfect condition. It arrived on time and the price was very good. I'm happy with my purchase and the service I received."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "it is a little beat up, but the device came on time and it works perfectly. I love it."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Solid system.  Used many products before with no issues.  Only wish I could have afforded one with more memory."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "It's small enough to fit in my purse which is a nice convenience! No really issues besides crashing when you have too many things open since the memory is so small. Next time I'd probably get one with a lot more memory."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "It's kinda cool. Quality + good design. I hope continue as well as today."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Works great, no complaints!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Amazing product from an amazing person, the prpricy wasn't even open, it was brand new and flawless"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Good quality of product and amazon services as well. thank you"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "He loves it!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "It was just as expected.  I had to return it as my wife gave me a mini 3 for fathers day."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "I am a huge apple fan but I also use android devices. Honestly I pick up my samsung tab 4 before I pick up my mini for 2 reasons. 1 the size, 2 the multiscreen view feature.\nThe mini lacks that but will be available in the fall for ipad air which sucks.\nBut jailbreaks can have it on ios 8 , I have it and I love it.\nI think this tablet is great for school use. If you need to read school ebooks, do presentation, hw and etc its great because of the screen size. I wouldn't recommend the tab 4 7.0 for those uses. But if you wanna slip this in ur pocket u really cant.\nI have the air as well and that stays at home its big & nice when you want a large screen but it carry around, it feels big but if you carry it in a purse or backpack great.\nBut the tab 4 7.0 you can really fit in your pocket. ultra portability.\nThe retina is nice but having your screen on fullest screen resol will drain your battery.\nI mainly use this to read with my kindle app, I feel like the tab 4 is too small for reading but is def do able.\nIf your a student or a buis person this great. You can utilize it for all its worth. Also if your a gamer the graphics looks amazing. But anything else get an android. Theres more flexibility and less restrictions."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Awesome!!!!!! Came in box just like it was brand new. Great product excellent service!!!"}
{"rating": 1.0, "product_id": "B00GNKRFEA", "review": "Buy Samsung and get an extended warranty, do NOT buy Apple!!! We've had Samsung products in the past but I found this on sale so I got it. 6 months later it broke. I sent it in to be repaired because there is a one year warranty on it. They sent me back a different iPad, a refurbished one that was broken right out of the box, it had a glitchy screen. I sent it back and the woman working on my case accused me of doing something to ruin it. They refused to fix it and she flat out lied to me saying that it wasn't a refurbished one they sent me. It was! It came with a freaking screen protector already on it. I won't ever buy Apple again, I have never encountered someone so rude!"}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "Very solid."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "good"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Another good product from Apple."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Love the product. I am an avid Bible student. The iPad fills the need with lots of extras.i'm still learning about the other things I can  do with it. Thanks"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great product."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "This was a gift and it is great!  It arrived in a timely fashion."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "I did not have any problems, and received this item on time with a nice personal note. Which i thought was very thoughtful."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "OK"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "My husband has the first Mini and I liked it so much I wanted one for myself.  I have an old Nook that I love and this was a great replacement.  Rarely use my laptop anymore."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "My son could not be happier!  It has proved to be everything he was hoping for."}
{"rating": 1.0, "product_id": "B00GNKRFEA", "review": "Horrible"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "If I could I would give it more stars I would, the formula of this tablet listed above with calculations it is a beyond excellent product. Let me give a detailed review of this tablet.\n1. Usability: I can create my blogs and manage them with ease and also print any document and print photos with my printer, and there is Microsoft office available to download from the App Store. Also it keeps updating to the latest versions and I can't wait to try apples new music app with iOS 8.4 coming very soon, and then iOS 9 coming to most iPads multitasking is going to get twice as better. Summary: all in all it just keeps getting better after every update.\n\n2. Display: nice full of natural colors, it's crystal clear, very responsive touch screen no need to press once or twice or tap with pressure, screen is also sensitive to touch pressure, all of this makes the screen look cute. Summary: if you're planning to buy a new iPad be prepared with its stunning display.\n\n3. Processor speed: never lags, it's fast and responsive, and can handle graphic intense games really well. Summary: it will run smoother than a smoothie.\n\n4. Build and feel: it is built from high quality aluminum, at first glance it will impress, and touching it even more impressive, also it is thin and light weight, ultra portable. Summary: it looks like they've put every little thought into every little detail.\n\n5. Connectivity: it has Bluetooth 4.0 so it should support most of the speakers, dual band wifi, LTE cellular connection(optional $130 extra cost plus monthly data fees.), NFC on newer iPads not mine. Summary: connectivity is an essential part of every tablet.\n\nThe number of points equals the amount of stars that it deserves:\nUsability: 2.0\nDisplay: 1.8\nProcessor: 2.0\nConnectivity: 1.5\nBuild and feel: 2.5\nTotal: 9.8 points = 9.8/5 stars"}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "GOOD"}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "If you are forced to use Apple products then its great. If not buy an Android!"}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "overall im happy with it. one of the corners was pretty chewed up from when they replaced the screen (why they didn't use a plastic tool i beyond me) but they sent me a LTE+WiFi model so i guess that makes up for it. works great, i love the retina screen on these."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Ok"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Excellent. I purchased this ipad for my wife. Arrived well packaged and in original box."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Outstanding value for a new iPad 2 Mini . I almost splurged for the iPad 3 mini, but just couldn't justify an extra $50 to $100 for only a finger print reader. Retina display is a fantastic feature. I was a devout Android user, but not any more. Sure there is no micro use port, but with the cloud who needs it? 16GB was enough for me, and the battery life was longer out of the box than either our Galaxy or Kindle Fire HD ( sorry Amazon) but the iPad 2 mini is great for school, work,or play. It gets better wifi reception than my Viao and Samsung phone. Can't wait for my contract window because I plan on swapping my droid for a new iPhone this fall."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Amazing"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Perfect for reading and taking notes on."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Very nice tablet! hardly use my laptop anymore!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "No complaints whatsoever. I'm a private pilot and often land at small limited facility airports. It links easily to my iphone when wi-fi is not available."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I actually got this iPad three month ago, I'm here to write this review because my instructor gave us an assignment of evaluation. I am very satisfied with this iPad, even three month after purchasing this product. Here are some pros and cons.\n\nPROS:\n-Lightly weighted\n-Small and easy to carry around( you can fit it in some of your pockets)\n-Runs fast(faster than most android tablets)\n-Looks simple and cool\n-Long life battery(it lasts about 7 hours when using it to browse websites and watch videos)\n\nCON:\n-It gets hot when using it too long\n-Quiet expensive\n\nBefore purchasing this iPad, I actually own a first generation iPad mini, absolutely loved it, I carried it everywhere with me, but I accidentally dropped it on the ground and broke it.( be sure to get protection for your iPad so this tragedy doesn't happen to you.) So i decided to buy a new iPad mini. By that time there was two new iPad mini out: iPad mini 2 and iPad mini 3, So I went to the Apple official website and carefully compared these two models, The iPad mini 2 and iPad mini 3 are basically the same except that iPad mini 3 added a fingerprint button(which I never use on my iPhone, ever) and a gold color option, but its 100 dollars more than iPad mini 2. I decided to buy this iPad without a second thought.\n\nConclusion: If you are looking for a convenient tablet, this is it, buy this iPad mini and you won't be disappointed."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Love it"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Exactly as described, have had a couple of years now and works perfectly, no issues of any kind!  Great buy!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great buy and great seller!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I love it because its apple ;)"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I love the iPad mini.  I carry it where ever I go.  Great purchase"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "great display. easy to use.  it's Apple, what can you say."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "Fast, easy to view and user friendly.  I bought it for a technical dinasoar who has pick it up and I haven't seen it since. I would give a 5 star but not allowed."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "It was a gift for my niece and she loves it"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Thanks!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Apple quality love the mini"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I got what I asked for. Although, if you're like me and you use a lot of apps, buy the ones with more memory. I've been an android user for too long. Now I have to be selective with my apps."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "I like it."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Superb"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great purchase!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Best deal for your buck by far. Brand new with box and accessories."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Received iPad 2 days after ordering, in perfect condition!  I am pleased with it."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Gave as gift. Recipient considers it one of the very best gifts that she received."}
{"rating": 1.0, "product_id": "B00GNKRFEA", "review": "Item came with crack screen never again"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I got it mainly for reading scientific papers. The size is just perfect to display a whole page and still hold in one hand. The iPad or iPad Air are too large and heavy to hold in one hand!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Love it!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I love my mini 2. The seller was awesome. Nothing much to say. I got what I wanted. My dorkness and nerd ness fulfilled."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I bought this for my son, he absolutely loves it.  It works great."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Love my iPad mini!!! Brand new, works wonderfully!!!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great Item."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "excellent product"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I just love my mini iPad it's fast and easy to carry around."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Awesome mini tablet!!!!!!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "The iPad mini 2 is very nice!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "good"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great product, great service, fast delivery!\nEnjoying my IPad mini 2!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "It is amazing product. I love its sharp retina screen and silky smooth touch as well as the fast and sleet operation. Besides, it is very thin and lightweighted and with low power consumption I can hardly feel warm even it has run for a long time. Now I use it to read and surf the internet everyday. BTW this is the second time I have bought a ipad, last time is three years ago when I bought an ipad 3 and it still works perfectly."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Everything is OK."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Excellent product"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I love my I pad I am using it right now! I use it everyday! It came in the mail quickly!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "muy bueno"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Real deal ipad mini2 as advetised"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "just rt size for me"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Bought this to replace my iPad Air (first generation) since I dropped that one and the screen has way too many cracks in it now. Although it's smaller, I don't mind it still. But besides the color and fingerprint reader, I figured this would be a better alternative to buying the Mini 3, and it costs $100 more! But I have an iPhone and I've always been a supporter of Apple's user-friendliness in its products."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "excelent product"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Its compact and awesome. The specs are as per description."}
{"rating": 2.0, "product_id": "B00GNKRFEA", "review": "Great battery life but that's all. No multi tasking, no widgets, no live backgrounds, no usb or sd card, cannot plug into laptop to charge, generic outdated layout ..Not worth the money."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I love the iPad mini, it is easy to understand and use."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "I love the iPad.  It's a great size.  It's only drawback is that the camera quality could be better.  Apart from that I think it's very handy because it's not too small or too big."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I like this better than my full sized iPad air. Priced right, came quickly- no issues"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "love this product. Same thing as the mini 3, minus the thumb print scanner and 100$ price tag. Great for games and watching movies and tv. The game i would recommend would be monster hunter freedom unite. Its 15$ but you get to experience a lot of things this ipad has to offer."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great device."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Awesome :))"}
{"rating": 3.0, "product_id": "B00GNKRFEA", "review": "Vary nice  just to small"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Exactly what we wanted!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I used a Samsung Galaxy Tab for years, this tablet runs circles around it and the battery lasts much longer as well."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great device. Although both models are excellent, the improvement in processing terms is significant when compared to the previous model. I'd recommend this for most tasks (browsing the web, text processing, note taking, even working online with others on Google Drive) except if you work professionally with illustrations. In that case you might miss those extra inches on the screen.\nI chose this model since I knew I would carry it quite a bit, and I always travel light - the iPad mini stands out for its portability and weight. In my opinion, this should be the standard size for tablet screens."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Using it now. Still works great. And still works great. Still does. Still working great. No problems as of yet. Still good. Still good. Still good."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I've always wanted an ipad, I'm glad I waited to get this iPad.  It's fast and heck,  its an iPad."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "great"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I used to not think tablets were not for me as I had only owned android tablets; however, if you're already entrenched in the Apple ecosystem, you might find tablet computing appealing with an iPad.\n\nThe iPad mini is the perfect size and weight, even with a case. The battery lasts long enough (i.e., for a few days at a time with moderate usage).\n\nMy only complaint is that 16 GB is really not ideal in today's digital era, where iOS and apps alone will use a several GB. 32 GB should be the base storage option."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "Love it"}
{"rating": 1.0, "product_id": "B00GNKRFEA", "review": "Help! I purchased this product and it has a user profile already! I can't delete this profile without a password!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I don't know why I waited so long to purchase this. LOVE ALL THE FEATURES."}
{"rating": 1.0, "product_id": "B00GNKRFEA", "review": "Got a stolen ipad"}
{"rating": 1.0, "product_id": "B00GNKRFEA", "review": "iPad was broken when I received it."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great product and fast shipping."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Perfect size and display to take with you"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Ipad mini is great."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "This is great. Perfect size and everything I expected in an iPad."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "We got this for my daughter's 16th birthday and she loves it!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "My iPad mini 2 blows away my Google Nexus 7. The battery lasts forever and the resolution is incredible."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Excellent buy, Fast shipping, would buy again !!!!!!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "The Apple iPad mini arrived sooner than the expected delivery. That was fantastic! It is simply a beautiful device. I was sold on the size. Easy to handle and love the color."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "This is my third iPad, sold the original model, gave the next one to my daughter who needed it for college. Went iPad-less for a while but I like having something to browse the bed while in bed and my MacBook Air is awkward to handle single handed. Thought I'd try the iPad Mini and it works as expected, but while it's a handy size as a book reader I prefer the full size iPad for web surfing."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Love it."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great Product"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Bought for my Daughter and she loves it."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Gave this to my wife for Christmas after her Google tab started acting up after an update. She loves this tablet. Period."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "4.6 / 5\nCons: Youtube app is annoying\n  sometimes cant unlock ipad (you cant slide)\n  buttons are not good (i mean lock and volume +-)\nPros: Excellent battery life even gaming\n  good facebook import\n  Very powerfull for everyday tasks (browsing, social networks)"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great product Apple makes great product!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great product at a great price. Couldn't find this anywhere else for less. The shipping was fast and the item was exactly as described. Will be looking to purchase another in the future."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Never had an Apple product before this one and I was able to learn it easily. If I can learn how to use it then do can you. Get a good and screen protector immediately. Do not wait on those items. Protect your investment. I love my iPad. Use it a but too much...lol!"}
{"rating": 2.0, "product_id": "B00GNKRFEA", "review": "APPLE IS OVER- RATED- this ipad was shipped with no cushion or padding in box. Also, ipad started being less responsive on touch screen right away.  Worked ok after that until 6 months of gentle in house only use. At 6 months video capture stopped working. Same thing with new ipod last year. 8 months and then hardware problems. I will not buy anymore Apple products. They make high profits, charge high prices for products that only last under a year. I am tired of all the repairs and trouble with Apple. Next time will just get a cheap one. Hope Sony or someone can bring more competition for Apple which is becoming too big for their britches."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I am VERY pleased with this iPad.  I use it all the time.  Takes good photos too."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Will never buy another tablet from another company. LOVE apple."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Returned the mini iPad"}
{"rating": 1.0, "product_id": "B00GNKRFEA", "review": "Ordered what was supposed to be a new iPad Mini 2, but when we got it, clearly it was an open-box return. No plastic on anything, outside of box was worn and dirty, and it was missing the charging cable and documentation."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Size and function are just what I was looking for.  Audio is not as full as I expected, so I use a Bluetooth remote to enhance the sound.  Haven't used the photo function much yet."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "i love it,just like new!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "This is a great device for the type of person who doesn't need to have the newest iPad Mini. Right now, the only differences in the iPad Mini 2 and 3 are the fact that the iPad Mini 3 comes with Touch ID and that you can get it in gold. Still the same processor and internals. For $300, I think this is the better buy. As for the retina display, yes, it's that fantastic."}
{"rating": 2.0, "product_id": "B00GNKRFEA", "review": "i was under the impression that this iPad worked well. I became suspicious when I noticed that it charged slowly but everything else worked. It's now dead and won't turn on after being on the charger for nearly an hour!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Awesome. Great service"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "perfect"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great deal. Came in the mail in the exact condition it was listed with. Works perfectly so far. No complaints! I love it."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great size and screen quality."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "It works fantastic. I use it for everything"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Purchased as a Christmas gift for my wife to replace her old Kindle tablet.  Since I have an iPad mini and we both have iPhones it was an easy transition.  She loves the retinal display and ease of use."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "excelent"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great tablet. Works perfectly."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Meets the needs of all that I need it for. Very happy with the iPad. Quality product."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "Fits the iPad mini perfectly. Fits snug, doesn't get in the way of the camera, the magnet works 70% of the time for sleep mode."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "perfect machine"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I love the Ipad mini 2. I can talk by Facetime with my family all the time! Thanks!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great. Just what I expected."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Love it!"}
{"rating": 3.0, "product_id": "B00GNKRFEA", "review": "Sorry, Apple, but I just don't use it very much. The Internet experience is clunky, as is the email. I use gmail, which has very nice features in terms of slotting incoming mail - most of which I don't want to see. The iPad (true of the iPhone as well) doesn't distinguish. I'm using a Chromebook instead. It's small, light and gives the full Internet experience."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "good"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "SIMPLY EXCELENT."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "This was a gift for my 10 year old son and he absolutely loves it!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "i love it.."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "This is my families 4th iPad, and 8th iOS device. This device replaces my sons iPad one, he has had since he was 3 years old. It was run over by a car, stepped on, jumped on, and thrown. (he has grown out of that) This was purchased as a christmas gift when he was 5 years old. Combined with a Trident Kraken series case, this product seems indestructible."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Functions as it should..."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "This tablet is great but it lacks some important functions of iPhone. Some important missing applications are Stocks, Voice recording, and Weather. Functions very smooth and very reliable.  I like it!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Very good produc and faster delivered"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "As expected!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "good very nice tablet"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "As advertised"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "For an apple product I'm surprised at the minimum issues I have using it. Completely replaced my laptop use. Now if only Apple would install USB ports on these they would be perfect."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Better than iPad Air 2"}
{"rating": 2.0, "product_id": "B00GNKRFEA", "review": "I bought this for my kid, now she informed me that from the begining the mini ipod used to turn off\nwhen she is using it or watching videos"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Love it"}
{"rating": 2.0, "product_id": "B00GNKRFEA", "review": "Facetime feature is not easy to work."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "Product was as expected."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I love it"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Product was perfect as described  and in original package and delivered on time. I would buy from the seller again and  highly recommend..."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Love it."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Exactly what I wanted and shipped on time!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "love it!"}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "Granddaughter likes the ipad.  What esle is there to say.  Arrived on time."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "First ipad and I'm glad I started with the mini 2. Works great and the retina display is awesome."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "love Ipads."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Excelente Producto !!!! A+++"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I love it. I heard good things about the air but this one does everything I need it to. Great purchase."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Really good tablet! Thanks to Amazon"}
{"rating": 1.0, "product_id": "B00GNKRFEA", "review": "This product was sold as an IPad Mini 2; however, what was sold was an original IPad Mini. Returning it immediately."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I have only owned Apple I pods. this is even better!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Bought this as a gift for our 5th grade daughter. She loves it - great size. Great shopping experience and fast shipping."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Love it"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Most user-friendly and fun device I've ever used or owned."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Beautiful. Perfect size. Exactly what I wanted."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "love it"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Perfect Christmas present!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Item was delivered before the scheduled date, so I had a very happy 9 year old on my hands. Everything works great. Thanks for making her birthday even better!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "My wife lived her Christmas present! It was way cooler than her iPad (original)!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Arrived quickly and works great!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Gave this as a present to my daughter and she loves it."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "It is great - I also have the ipad and I wanted a smaller version to take to India as a camera.  It is great."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "My grandkids can't put it down when they are here at the house. I may have to purchase 4 more."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Purchased for kids as a gift and they can't put it down.  Very good investment and seller."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I love it. The product has come in crear conditions. Perfect."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Who is not happy with their iPad Mini 2???"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Love it"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I have an older Ipad 2 and wanted to upgrade.  After researching I realized not much was different between Mini 2 and Mini 3 so I saved some cash and went for the 2.  What can I say but I love it.  The screen is beautiful and it is so light.  Use it every day!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I was very hesitant about buying a used product from a seller, so I read the descriptions very carefully. This particular one seemed like it would be a good deal, so I took the plunge. Our iPad mini was perfect and didn't have s scratch on it. It was brand new! We were so pleased, and our kids love to play games and watch cartoons on it on long car rides. The screen delivers a beautiful screen, and we are very happy with out purchase."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "good and fast shipping"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Simply handy and more convenient to use. Glad to have one."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "It was in great shape and my son loved it! Good price,too!!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "It's wonderful as expected, I'm very happy as my son is extremely happy. Thanks. Jon."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Excellent product, i recommend this seller!"}
{"rating": 1.0, "product_id": "B00GNKRFEA", "review": "Not sure who's fault it is, but right out of the box it had discoloration in the corner once it lit up, and with the charger it came with or any other in any working outlet it does not charge and I can't set it up, for 5 hours it has just been lighting up with the apple icon and goes off again.  If I can't get it to charge at all I will be expecting a full refund or replacement, this is ridiculous.  Does absolutely nothing when I plug it into my computer, won't turn on to even tell me it has no battery."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "as expected no issues thus far"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Love it! Just what I wanted!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Price on par (and at this moment a little cheaper) than Apple's retail price, which I came to appreciate even more when I was given an Amazon card and saw that the iPad mini 2 WiFi 32GB was being sold for $88 more than Apple's price. You have to really watch some of the independent sellers on Amazon, some of them will rip you off. Luckily, the shop who is selling the 16GB version sells it at a great price. I was pleased with the shipping, product arrived perfectly new and unspoiled.\n\nAs most have realized by now, the iPad mini 2 has the same exact hardware as the iPad mini 3 (just minus the fingerprint scanner, which I think is less useful on an iPad for most people) so this is a great buy. Personally I find the screen size more than adequate; I'm not sure I would like handling the standard-sized iPad for too long. Beautiful retina screen (makes me want to upgrade my iPhone 4S), snappy interface. I'm probably a little *too* pleased with my purchase, I haven't been getting any work done with this thing around - and that's even after having owned iPhones for years and telling myself \"it's the same OS, just a bigger screen, no big deal\" :P My brother got an LG 7 Pad and is a bit jealous about the screen size and display of my mini 2. I was on the fence a bit before, but now I'd buy it again in a heartbeat."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "light weight and handy"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Bought this for my husband as he was always using my ipad 4. He is not too fond of the smallness of it as he only will use it at home."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "This was a gift for my girlfriend, so I really have not had much of an opportunity to look at it. What I can say is that she carries it with her everywhere and it is already a part of her daily life. That must say something."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Grandsons love there new IPADs. Best Christmas gift ever. Ages 5, 6 and 11 yrs old.  This is a perfect gift for any age.  My son wants one now for the road."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Brand new high quality"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Apple definitely has the market beat when it comes to tablets and this one is no exception. The display is beautiful. I'm not much a fan of IOS8 but on the tablet it is nowhere near as bad as the phone. Coming from an iPad 2, I could never go back to a larger-sized tablet. It is the perfect size for hands and even with a case it is still perfect. Do not waste your money for the iPad mini 3, the added features are not worth the cost. This model is very fast."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "A gift for my med student son fits in his white coat pocket he likes it!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I own an iPad Air as well as an Kindle Fire HDX 8.9 and I really enjoy both of them. So I decided to purchase the iPad Mini with Retina because I want something that I can place inside of my purse and take with me when i'm out or in the car. I didn't really care for taking the iPad Air and Kindle Fire HDX with me because I prefer to leave them at home because I feel that they're safer there. Let me tell you....I really like this thing! The portability is excellent and sometimes when i'm laying in bed instead of grabbing the iPad Air/Kindle Fire HDX which are both laying right next to me I grab the iPad Mini 2. I'm sitting here looking at the iPad mini with Retina and iPad Air side by side and they are identically the same except one is bigger and one is a little smaller. It's just a matter of what's right for you. I would highly recommend purchasing the iPad mini with Retina display! Plus I have no problem with grabbing it and placing it inside of my purse when I leave the house along with my Kindle Voyage E-Reader which is a must."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Got this for my husband who is not a techie, but wanted to give him something to keep him occupied on plane rides because he doesn't like to fly. This keeps him busy!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great product at a great price!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "IS WONDERFL\\UL"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "good."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "iPad, what else to say, works as great as any other Apple product."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Gift for husband...everything he expected"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Yes!! Brand new .i love it I do everything on it!!! I can't complain!"}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "Great price and came in on time."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Nice tablet!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "My grandson thought it was the best gift ever"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Jugvbghknfc"}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "It's like an iPad, only smaller."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Love it!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I've had an iPad and hated taking it everywhere with me. The iPad mini is perfect fit in my bag without dragging it down."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Love my new ipad mini 2. This is my first tablet. I like that it's a little smaller than the full size Ipad. Easy to pull out to check email, play my games and check things out on internet. Now I don't have to take out my lap top every time to do these things. Honestly, not sure if I would notice the difference between having the Retina Display (mini 2) vs. no retina display (mini) but my sons told me I should get the retina display."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Perfect"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "LOVE it"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "It does everything I need"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "They are perfect! Exactly what we wanted."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Just as advertised, fast shipping, great price"}
{"rating": 1.0, "product_id": "B00GNKRFEA", "review": "Can't believe book didn't come with it and I have to download it.  For a computer non-literate it is not user friendly."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Everything was excellet, premium customer service."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Very good. Came with case in package, which was convenient to have until I could get a different one."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I love my ipad"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Works as expected. I like this a lot."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I am satisfied"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "What is their to say, it's an Ipad Mini.  Great deal!!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "excelent"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I'm a newcomer when it comes to Apple products. This is my first IPad and it has impressed me. The education apps available are top-notch. I honestly don't know how I've lived this long without trying out an IPad. Goodbye Android Hello sweet Apple!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Brand new and works as expected."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I keep my iPad mini with Retina display in the living room.  (I'm a bit lazy and have a iPad Air 2 in the bedroom.)  I picked my iPad mini off Apple's refurb website.\n\nI use my iPad mini as an additional remote with my Harmony Hub to control my basic home theater set up that consists of a Sony 52 inch LCD TV, Comcast DVR cable box, Roku3, and Sony Bluray player and couldn't be happier!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "very nice.. bought used but in fairly good condition.  came with screen protector already on.  would recommend to friends."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I cannot say enough about my iPad.  When first getting it I did not think it was the thing for me, now after learning how to use it I would not be caught without it, I take it and my Kindle wherever I go.  Into my purse they both go.  Especially face book I can copy pictures that my kin post, into my iPad they go to either send to be made into photos or just to look at over and over.  There is so much to do on this little machine.  Where have I been since it first came out?"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Awesome tablet."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "as expected from an Apple product. A+"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Took a little long to ship, but definitely worth the wait. This iPad is awesome and the retina display makes it even more."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "ty~"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great deal on the iPad mini. My son loves it."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "everything is perfect, except usps is sooooo slow. I'm a big Apple fan, I love it!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I bought used on here but I couldn't be happier with it"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great price and great device - daugher loves it so much so she sleeps with it!"}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "always a apple fan simplicity at its best,\nnot like the other brand confusing"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I come from China, due to various reasons month to receive the goods, only now to evaluate, I am sorry, received something very pleasantly surprised, very good stuff, the seller is very honest, the first time with the iPad, feeling very much! My English is not good, these are google translator translation, thank you!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Awesome Ipad Mini 2 or Retina display. Lots of space and clear display. RECOMEND IT TO OTHER PEOPLE"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "The iPad is great, but be warned, THESE ARE NOT NEW!\n\nThey were bought a while ago, and then re packaged, and then re sold. They do not have the full 365 day warranty. I called Apple, and they said it was bought 2 months ago!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I love Apple Products and this is no exception. Great screen color and resolution. Wi-Fi works great also. The small size and light weight makes this ideal for reading books even in fairly bright light, as I did on vacation recently. I bought a protective cover for it and it works great."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I couldn't be more happy with this tablet. It plays Hearthstone, has a great battery life, has a beautiful screen and always does everything I need in a flash."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Delivered as promised."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I love my iPad mini, best tech investment I've made to date."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Well...it's the iPad, so it's already the best tablet out there you can buy. I was a little skeptical about the retina display at first, but upon glancing at the screen...I LOVE IT. The idea behind the retina display, is that Apple make the resolution the best your eyes can possibly see. So even if you make the resolution better than the retina display, the human eye won't notice it. Even before comparing it to an iPad without the retina display, I could tell the difference. I think it's necessary, and worth the extra $40 or so to get it.\n\nYou can view all the specs on Apple's website: http://store.apple.com/us/ipad\n\nI like the size of the mini the best. It's easy to carry around, but big enough to serve as a nice \"computer\" screen. You aren't as mobile with the regular-sized iPads as you are with the iPad mini. If you carry a purse around, ladies, you'll find this size to your liking.\n\nI only went for the 16GB because of all the cloud storage options available if I need more space. I usually keep everything on some cloud based platform, so the main thing you would need space for on the iPad are apps. If you are a big music person and like to use apps like GarageBand a lot, you might want to spring for more gigs. Same if you like a lot of gaming apps. For more practical, every day use though, the 16GB is more than sufficient.\n\nIf you're looking for a case for this iPad, I would recommend the Fintie cases located here: http://www.amazon.com/gp/product/B00G93TCMO/ref=oh_aui_detailpage_o00_s00?ie=UTF8&psc=1\n\nThere are a lot of flimsy cases made for the iPad, but the Fintie ones are very well made, inexpensive, and have magnetic screen covers - which is something you definitely want.\n\nThere's not really much difference between this and the iPad mini 3, so for almost the same product, get the iPad mini 2 retina. Even if you don't think you need a tablet...this one will change your mind.\n\n***Pros :)\n-Great mobile size - fits in small bags, purses, etc.\n-Retina display is gorgeous\n-High-functioning tablet that squashes the competition\n\n***Cons :(\n-No headphones, so use the ones that came with your cell-phone or buy new ones if you plan to use them"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "new and sealed."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "Really good device just as the seller described it. It also got here a few days early to boot. Otherwise I love the iPad mini and use ir for everything. LOVE the speed of it and the CPU and GPU are very powerful for a device this small. It really allows me to be able to do video editing. So glad I went for this then the mini with the a5 chip."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I did this once. Perfect condition! Tis!"}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "Wonderful product...I use this device for work related design while on my feet. Its light-weight, sleek, functional and powerful."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "It was for my Grandson and he loves it."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "This is a wonderful tablet. I use it daily for work as well as entertainment. The only issue I have is screen brightness. More variability would definitely benefit this product. If you plan to use this outdoors a lot, you may want to reconsider."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Works great. Received current product as expected and model that was advertised - Ipad mini with retina display."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "got this a little cheaper than what is sold at local electronic stores. Love the product."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I love the mini iPad. Easy to handle, so I enjoy using it."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Arrived on time, came in packaging just like if I were to buy from Apple. And the fact that I saved $50 by buying it from here is also another great reason to buy from here than somewhere else.\nThe corners of the packaging were slightly bent, but had no affect on the product itself.\nI've had mine for a month or so, got some movies, games and GarageBand on it and zero problems!\nBefore buying I didn't know if I should get with or without retina display, but after using it for a while, the retina display is totally worth the extra money! It also has a faster processing chip so it runs more smoothly and faster, even if the memory is mostly filled!\nGreat product!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "well integrated with mac laptop"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I bought an iPad Mini shortly after they came out.  I had been looking into getting a regular iPad, but felt that the size was just a bit more than what I wanted.  When the Mini came out, I went to look at them and was instantly hooked by the size of the device...it was exactly what I had been looking for.\n\nOver the year that I had it, I really enjoyed using it.  However, I found myself every once in a while wishing that it was a bit more snappy.  I thought that maybe I would just need to upgrade to the full sized iPad if I wanted the quicker responses and such that I was kind of hoping for.\n\nI had resisted upgrading to the Mini with Retina because I didn't think that it would really be much of an upgrade.  Sure, it had higher pixel density, and a faster processor...but it couldn't be THAT much of an upgrade, could it??\n\nWell, I ended up getting to a point where I was a bit tired of dragging my big heavy laptop around with me, and was planning on using my iPad as a bit of a replacement for the computer.  I started looking at articles and reviews about the Mini with Retina, and found out that I couldn't have been more wrong on the idea that it wasn't much of an upgrade.  Benchmark tests showed the Mini with Retina to be a MUCH faster and more powerful device than the original Mini.\n\nI didn't hesitate to make the purchase after finding out the information about the upgrades in performance.\n\nWhen the device arrived, I was pleasantly impressed by how much it felt the same. Form factor and weight were nearly identical, and it was a very natural transition going from the original Mini to the Mini with Retina.  I was then, of course, wowed by the speed and snappiness of the new Mini with Retina.  It was SO much more responsive than the Mini, and I wasn't really aware of what I was missing.\n\nThe other thing that truly stunned me was how much of a difference the display actually DID make.  Even after making the purchase, I still figured that the display couldn't be THAT much better than the original Mini...however, with the Retina display things are so much more crisp, in particular text.  I can't see the pixels that I was able to see on the original Mini, and it just looks better overall.\n\nI've been really impressed with the iPad Mini with Retina.  It took everything that I liked about the original iPad Mini and made it better.  If you're looking for a small tablet, the iPad Mini with Retina should be on your list."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "What can I say? it's an Apple iPad. they work."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Bought this for my wife to replace her full size IPad. She really likes the smaller size."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Awesome I use it everyday."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Gift for my wife; she loves it!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Love it!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Bought for my wife, she loves it, on it all the time playing games and no dropped signals etc."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Fun"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Product was great. Bought it for a gift and was very happy. Speedy delivery ."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "Its clearly a 5 star device but don't waste your time buying it on amazon, apple just dropped the price on its website to 299 for this model and 349 for 32gb model so there you go."}
{"rating": 1.0, "product_id": "B00GNKRFEA", "review": "Bought new and received a refurbished model.  Very poor attempt to repackage iPad with a very dirty and misaligned single film to cover screen.  Anyone that has purchased an Apple product in the past can immediately tell the shoddiness of this attempt.  Back of iPad was smudged with some sort of sticky residue.  Do not purchase from MoneySaving Deals ,,, last time I make any purchase outside of Apple directly."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "good"}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "Good for the price - follow the instructions carefully to gain a good fit."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "love the size"}
{"rating": 1.0, "product_id": "B00GNKRFEA", "review": "Never buy anything in this shop!!! I checked the IMBI and found that the device was activated on January this year. I bought it on October. Shoot.\n\nI'm a college student so I don't have much time arguing with the seller and I really need it right now. The device stucks sometimes, but it is ok so far. I just feel uncomfortable using a used iPad because I was cheated. If you mind this kind of thing and planning to buy from this seller, you better think twice. I'm so regret I didn't buy it on Apple.com. The cheap price totally doesn't worth a used device."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I love my little iPad! I upgraded from my previous iPad Mini (without retina display). Right out of the box, it's incredibly more noticeably faster. The screen is much sharper. I don't know why the iPad Mini wasn't first produced with a retina screen. Looked kind of like a step back for Apple. But now they got their act back together. The size of this iPad is just perfect; not too big but not too small. Very portable, yet a large enough screen for almost everything."}
{"rating": 3.0, "product_id": "B00GNKRFEA", "review": "Love this mini iPad. It is so handy. Just the right size for me. But the it's one thing that has me concerned... It is slower than my old mini."}
{"rating": 3.0, "product_id": "B00GNKRFEA", "review": "Shopping experience was the best. Ipad mini retina crashes a lot. Blue Screen of Death happens very often, at least twice in a day."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Love it, it does everything I ever imagine wanted plus. Great for my books, music, pictures are awesome love everything about it.\nThank you Apple\nBeatriz Rowe"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Got this for my wife and she loves it.  This was our first Apple product, so it'll take some time to figure out how to navigate from app to app.  Luckily, we have other family members that can help.  Apple tablets are more expensive than other manufacturers, but I figured we'd splurge a little and go with the \"name\" brand."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Working well, easy to use. Retina display clear and easy to read.  Everything  is performing as expected."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Size is perfect. Great on airplanes and in bed too. Camera is great, better than my stand alone camera."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Fast Shipping and Great Price"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I love, love, love this mini ipad.  I had the larger style but it was clunky and heavy.  I wanted to be able to carry it around in my purse, which I can do with this item.  The screen is very crisp.  I have no complaints about this.\n\nI also bought the usb adapter for it, that allows you to plug in a camera using the USB cable, and immediately load pictures.  What a great accessory!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I have the full size Ipad.  My wife wanted something smaller.  I set it up for her.  She is really using it and enjoying it unlike the notebook she had bough for herself a few years ago."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Has an iPad 2 before this, wish I had the mini all along. LOVE this size so much better. This thing is AWESOME for health professionals. Fits right in your whitecoat/labcoat pocket."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "Feels like some pixels are not the most responsive compared to other tablets (Microsoft Surface, Samsung)."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "The product arrived in new unsealed condition.  It was easy to setup and offers crystal clear resolution.  iPad mini is easy to navigate and does not disappoint in performance.  Also, it comes with the standard Apple warranty."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Awesome love the iPad mini, quick turn around no problems setting it up!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "great"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I've wanted a tablet for a long time and bought this a few days ago. It's an amazing product that can do practically anything! It's convenient to have a tablet when you want to sit on the couch instead of a laptop sliding all over your lap. Plus, it's a good size, since I think the iPad and iPad Air models are too large for me personally. If you want a reasonably priced tablet, I definitely recommend it!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I am using this Product review option in order to provide positive feedback about the seller of this product.  We already left positive seller feedback after receiving the product.  The System does not allow us to add to that feedback.  This feedback has to do with a product defect that came up months after the purchase of the product (activating the warranty and need for replacement).  We ordered two ipads and one of the chargers had a problem.  per my message to seller:  \"Thanks so much for the ease and efficiency of resolving the issue of the defective ipad mini charger.  And as you do not stock the chargers separately, your creative solution.  In this day and age of business, it is all the more appreciated.  I will be sure to note this on the \"product review section'\" as I already left positive feedback after receiving the ipads.  Mahalo (Thank you!).\""}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Love it!! and that's all I have to say about that!!"}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "having trouble downloading videos, other than that its a great device."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "EDIT 10/10/2014 - iOS 8!!\nBecause iPad Mini 2 has processor A7 with M7 (kind of new -last year-) iOS 8 works ABSOLUTELY SMOOTH, and this update is really cool because all the things Apple 'opened' for developers. From now we'll see much better apps and better integration with Apple iOS. So, if you're worried about how iOS8 works on iPad Mini 2 with Retina Display, well.. STOP READING THIS, BUY THIS IPAD AND UPDATE IT TO IOS8!! :D\n---------------------------------------------------\nORIGINAL REVIEW:\nSince the first iPad, i criticized why someone could buy a tablet. Many years from that I decided to give them a chance and holy cow! How could I be so dummy!? Now I can't imagine my life without my iPad. I use it at work, on meetings, on the university, taking notes, studying, reading, programming, at the bathroom (at the throne) playing (LOOL), to entertain my lil cousin, to check the TV Guide, to netflix, to stream at the chromecast, to do everything!! I love this thing, is so useful!!\n\nThe Retina display is beautiful; my lil sister has the iPad Mini 1 and the difference is big. Also the processor A7 with M7 works so smooth that I haven't found any app to make this powerful computer cry.\n\nI've recommend it to some friends and some of them bought it and they're so happy as I am. I planned at the beginning to buy a Nexus or Samsung Note 8, but I chose right, nobody can't kick Apple a**! With an iPhone and iPad, the power is unimaginable!\n\nApple is Apple, don't be a hater if you haven't use anything from them; once you start using an Apple thing, you won't like to stop!\n\nPD. iOS 8 needs almost 8GB free, that's a pity 'cause I bouth the 16GB version and I had to uninstall almost everything. But the update is great, the idea of quick replies and widgets is like the best thing for the update. Now we have to wait for the apps to make this update worth it.\n\nSome great apps: Office 365 Suite (Word and PowerPoint specially)"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I feel a little silly and perhaps inadequate writing about this. So I'll keep it short. It's perfect for me."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "This product met my expectation. The new iPad mini with Retina Display is another addition to my Apple line of product I use. The mini size is what exactly what I wanted. Display is good with excellent performance. There are many great apps, too, and I can use the same apps on my iPhone. Many apps incorporate iCloud with which data can be sync'd between iPad Mini and iPhone. This works great for me, too."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I love this ipad"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "If you read my review of Windows 8, you will understand why my NEXT computer is going to be a Mac.  Unlike Microsoft, Apple is devoted to protecting your privacy rather than exploiting it.\n\nMy husband ordered this device and is rather vexed that my Windows 8 experience has required so many shut-downs of the wireless network in our home."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Excelent"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "My iPad mini 2 with Retina Display shipped brand-new from James O'Neill USA LLC and it was in perfect, mint condition when I received it.  The packing film that the factory wraps them in was intact, which confirmed that it was indeed new and wasn't tampered with.\n\nI find the resolution is good and that the electronic tablet is a joy to use.  Also, it's a nice size for using it just about anywhere.  Not cumbersome."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Awesome, perfect for my needs.  Love the brilliant display, space of display, and ease of use.  Needed a larger screen for traveling, reading, etc and decided to go with this size rather than a full iPad.  This is amazing!"}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "I'm satisfied with the IPad ."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I won't realize how useful it's until you buy one. Long duration battery, easy to handle, light to carry, big enough to permit you go threw internet comfortably. I was in doubt between the regular and the mini IPad. No regrets at all. Great gadget."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I thought I was not going to like it because it was small BUT it's great convient to store in purse taking pictures etc..."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Got it on time and as shown on pics"}
{"rating": 1.0, "product_id": "B00GNKRFEA", "review": "The downloads on this iPad mini are frustratingly slow. Want to watch a little YouTube video? Half the time I've lost interest before the thing loads. No suggestions at the Apple store, no help. Aggravating!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Got the right model and everything. woo. Works very well for daily internet stuff and I dig the battery life. I've been at school for 5 hours and still have 70% battery life. Some IOS 7 things I'd like to change out of personal preference (I want android's capacity to auto-recommend/complete words!), but with IOS 8 free around the corner, I will hold that part of the review.\n\nTo experiment I synced my mac's itunes with this guy and the 16 gig version can hold over 1000 songs, dozens of podcasts, 50+ books, documents of unknown quantity, and hundreds of pictures with ease. I only have 2 gb left now, of course, but I don't even have anything else to put on it, haha. On the other hand, if you prefer video downloads, you might go for a bigger model. I do wish the embedded version wasn't $100 difference, because that would be awesome. But in our wifi-riddled world, at least in my city, there have been few times I've not had any access.\n\nOverall, a very worthy tablet. If it weren't for my WoW, Indesign, Photoshop, and other such programs, I could see this replacing my laptop."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "good"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "It was a gift for my tech-savvy son.  He loves it...it fulfills all of his needs and it is his constant companion."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "it is what I get, looks perfect, no damage"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Handiest school tool I own!"}
{"rating": 3.0, "product_id": "B00GNKRFEA", "review": "Not brand new. Its either refurbished or used packaged inside iPad mini's box and vacuum sealed."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Light, elegant, responsive. What else do you expect from Apple?"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "It is all I hoped for.  Love reading on a lighter ipad!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "i really enjoy using my ipad mini its a lot of fun"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "It's an apple fun and easy!!!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "This is the best tablet ever I had a nexus 7 and now I got this this is so much better get this now"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I bought this used from ezcorp. Item arrived quickly and perfectly described. The Battery is great! The speed is a breath of fresh air! I immediately added covers which makes it easier to hold. I don't even want to use my laptop anymore."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I am enjoying my ipad for now it's doing everything i expect it to do."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "excellent"}
{"rating": 2.0, "product_id": "B00GNKRFEA", "review": "very clear graphics....not sure whether volume is supposed to be as low as it is?? Otherwise, pretty satisfied."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "i out did myself again buying this product..."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "When the iPad first came out I bought one. It was truly amazing.  I loved the way it worked.  The portability was a relief after lugging around a 7 pound laptop.  But the 1st gen iPad wasn't exactly light and holding it for any extended period was tiring.\n\nWhen iPad Air came out I bought one.  Much lighter than the 1st gen. I still found it somewhat awkward to hold for any extended period.  For Christmas I bought my wife the iPad Air Mini.  At that point I realized the Mini was perfect.  I can hold it in one hand!\n\nSo I bought myself a Mini.  The price from this seller was the best I could find anywhere.\n\nThe Mini is just awesome.  I use it much more than the full-sized Air.  The screen is bright and crisp.  It's just big enough to make browsing comfortable.  In my book, this is the best size for a tablet. A 7 inch feels cramped.  A 10 inch is just awkward to hold."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "great product at a good price and fast shipping"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "nice"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "thanks"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Unreal omg. Why didn't i invest earlier? OK.You do get what you pay for! Beautiful 8in 2x HD screen with full tested 64bit OS, hardware, dual core + coprocessor, smooth and fast interface at 60fps....no...lag...using Coach's Eye to video review with onscreen arrows and prompts for my kettlebell strength coaching business IS night and day difference; compared with the $75 Chinese Noria 7in Android tablet...which is OK for basic surfing only,barely. My kids don't want it...gaming stutter and crashing and consistent delays. Android needs an app killer? .APPLE ROCKS."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Absolutely love it! I find the size to be just right for use as a reading device and has a function right in between my phone and laptop. It's light and small enough to take anywhere, but it has the same power and resolution as the iPad Air. If you need a tablet for information consumption, not to try to replace a laptop, this works great!"}
{"rating": 3.0, "product_id": "B00GNKRFEA", "review": "Great condition, fast shipping, but the included lightning cable was a knockoff that no longer works with the new update."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Just as good as air except more portable. This iPad has same Everything including pixels per inch as the IPad Air. Good price compared to Air also."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Still the best mini touchpad, much better than the disappointing ASUS Nexus 7."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "Still trying to get it figured out."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I've had the full sized&nbsp;<a data-hook=\"product-link-linked\" class=\"a-link-normal\" href=\"/Apple-iPad-with-Retina-Display/dp/B009W9BQMQ/ref=cm_cr_arp_d_rvw_txt?ie=UTF8\">Apple iPad with Retina Display</a>&nbsp;for about a year and a half and have found that both my wife and I use it so frequently that getting a second iPad made sense. Plus, I got a great deal at B*st B*y and that was all it took to convince me to purchase this iPad mini.\n\nI selected the iPad mini version this time because I felt that the smaller size would be nice, and with the retina display I knew that the display quality would be excellent. It is also quite a bit less expensive (than the full size iPad) and for an impulse buy, that helps.\n\nBriefly stated this is a superb small tablet. If you are already invested in the Apple ecosystem then the apps you already own will load right up and it operates identically to your other devices. I'm not going to try to make the case for the Apple devices vs. Android tablets. I think they are both good, and both have their advantages and disadvantages. I've been using an iPhone for several years, as well as the larger iPad, so staying with Apple is a big advantage for me. That is what they want, of course, but it is also fine with me because I love the products.\n\nPros:\n\n- The size and weight of this device is wonderful - this iPad mini is less than 50% of the weight of my full size iPad, which is a huge difference. The difference in weight is enough to make it much more comfortable to hold for any extended period.\n- The display is still large enough to web surf and read documents comfortably. It has the same display resolution as my full size iPad (2048-by-1536), with a higher 326 pixels per inch pixel density than the larger model. In other words, the two displays will show the same identical content, the mini simply a smaller version. The display is just crystal clear and sharp.\n- It comes with a charger and USB cable, which are all you need to get started.\n- It's compatible with all other Apple iPhone, iPod, iPad apps, works seamlessly with my iMac computer, and is easy to set up right out of the box.\n\nCons:\n\n- the smaller display is of course slightly less suitable, compared to the full size iPad, for doing some things such as watching video. The speakers are also smaller and do not project the same volume of sound as the larger iPad.\n- as with all Apple products, not cheap\n\nComments:\n\n- The 16GB size is the most affordable and is what I selected. It does mean that you are limited in what can be loaded on to the iPad. Many users, those who have large numbers of apps or keep many photos or music or video files on their device, will want the 32GB or even 64GB sizes. My needs are more modest. I use it more for streaming and web surfing, and other less memory intensive applications. The 16GB is therefore very sufficient for me, but it is at the low extreme for devices of this type today. I realize and accept that it may eventually limit me in what I can do with the device, that it means less ability to grow and for future needs.\n- Physically, this iPad mini is just slightly larger than Amazon's&nbsp;<a data-hook=\"product-link-linked\" class=\"a-link-normal\" href=\"/Kindle-Fire-HDX-7-HDX-Display/dp/B00BWYQ9YE/ref=cm_cr_arp_d_rvw_txt?ie=UTF8\">Kindle Fire HDX 7\", HDX Display</a>. The iPad display is somewhat larger than the 1920x1200 pixel Kindle display. The iPad is about half an inch taller, quarter of an inch wider, and is slightly thinner. They are just about the same weight. The iPad mini was just fifty dollars more expensive than the Kindle at the sale price I paid. The Kindle HDX would have been my alternate choice - I like Amazon's Kindle products, but again there is the issue of app compatibility with other iOS devices I already own. And the iPad works just fine in reading the books that I have in my Kindle library, using the Kindle app that I have installed.\n\nThis is the wi-fi only version. My needs are only for a device for use at home and I have no desire or need to use this away from wi-fi networks or on my phone data plan.\n\nWhen the iPad mini was first introduced, my wife and I looked at one at the Apple store, and we had mixed feelings about whether or not we'd want the smaller size. And that was the original mini, before it had the retina display. Now that the mini has the retina display, and I have one myself and I've used it for several weeks, I'm not at all dissatisfied with the size. In fact, it has become the iPad that I use every day, while my wife continues to use the larger iPad (which she does prefer, but she also has not had much opportunity to use the mini because I've pretty much monopolized it). For a two-iPad family I think that having one of each size is a good way to go.\n\nFor my purposes this is perfect."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "got rid of the ipad2 and got the ipad mini retina.  best upgrade for the buck.  gave the old ipad2 to kid.  everyone is happy."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Awesome tablet. Apple is definety #1 when it comes to tablets."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Love my new iPad, I only wish it came with a user manual. I have to print the 140 page user manual off the internet, and haven't had the time to do so yet, so am figuring out how to use it as I go along."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Just awesome"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "love it"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Product was just as described and shipping was great."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "EXELENTE MUCHAS GRACIAS"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Everything I expected and more. Thought it wouldn't have retina display or might be scratched upon opening the box but all my fears melted away when I saw it and held it for the first time. Brand new, works great, and couldn't be happier. Easy 5 Stars."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Very cute, totally recommended"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I've had my iPad mini for about four months now and I absolutely love it! I decided to go with the smaller storage and get the Retina display and it was absolutely worth it. I never go anywhere with out it! I use it for reading, games, and browsing the web. I also use it regularly in my classroom. It was an absolutely necessary investment. My parents had gotten me the Samsung Galaxy Tab 3 and it ran so slow and I absolutely hated it. I sold it to a family member and put the money towards this and couldn't be more pleased!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "It's very fast and it has an amazing display."}
{"rating": 3.0, "product_id": "B00GNKRFEA", "review": "good"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Nice"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Most people already know about iPad's, they are the device that simply works. It is the one thing about iPad's that will keep me from buying any similar products. They have a simple design and it just simply never errors out on me or causing me any headaches. Similar products like Galaxy tablets are great devices but they user experience is much different. They have many more features but the system they use is not foolproof as the iPad."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "The iPad mini retina is great.  I work from home in the web development business and always seem to be glued to my computer.  I wanted one of these so I didn't have to always run back to my computer during off hours.  The mini is great for everything I need to do, code editing, file transfer, email, messaging, skype etc.  Where it really excels tho, is watching movies or TV shows.  I have the WiFi version and when I connect to wifi, I can stream video flawlessly and the picture is exceptional.  I am an electronics junkie and I have some pretty high end TV equipment in my house so I like to think i know what a  good picture consists of.  The mini won't let you down!"}
{"rating": 3.0, "product_id": "B00GNKRFEA", "review": "The iPad hardware is okay. Nice and light, but it still feels sturdy. The screen looks great, though touch is not as responsive in some apps as I'd like. Not sure if this is a hardware or software problem though. The speakers aren't very good, and nowhere near loud enough. My phone is louder and sounds a lot better, which is sad. The entire iPad line would really benefit from some forward facing speakers.\n\nThe really, really big disappointment for me has been iOS and its many, many limitations. It looks and feels very dated, but that's easy to ignore. However, I keep expecting to be able to do simple things that can be done in other operating systems, and I'm frequently disappointed when I can't.\n\nI primarily purchased this iPad mini so I could work on music creation/mixing while traveling (props to Apple for making the GarageBand app free, it's nice for simple stuff). The third-party music apps are really where the iPad shines, but the limited ability of iOS to share files between apps, and having no access to the file structure on the iPad, makes importing and exporting sound files basically impossible unless you always have WiFi access to the cloud or a computer with iTunes you can plug in to. Why not at least allow some kind of shared folders in iOS that could be accessed by your apps? There's a great audio routing app called Audiobus on the app store, which lets you connect audio apps together, but it only works with compatible apps, and doesn't let you share previously recorded sound files between apps.\n\niTunes is still an abysmal, horrible piece-of-junk bloatware, and anytime I'm forced to use it I just feel frustrated and a little disgusted by the sloppy, lazy programming and ugly interface. Anyway, I shouldn't need a second device just so I can use the iPad properly. Kind of ruins the whole portability aspect of it for me.\n\nTL:DR - Cool device, decent hardware, but iOS constantly disappoints me. For the price, I just expected it to be able to do a lot more."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Best item I ever purchased"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Everithing OK!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "era lo que esperaba la resolucin de la pantalla es muy buena"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "For everyone skeptical of whether this is the real deal.... Well It Is!!!!! I ran the serial  number and it is legit. I love my new iPad mini. It is sleek and sophisticated. I always get compliments on how nice it looks and how great it is for taking photos. It is perfect for women who don't like carrying large handbags."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great product and excellent customer service thanks Tech giant."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I love it, it's great."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Retina display is just amazing!! The 4:3 aspect radio is the best ! And for everything especially webpages , social networks it does look amazing in comparison with a 7\" tablet.  I this the most important thing is its battery- it lasts in range of 11-13hrs continuously!! But if you use it at intervals it can easily last 2 or 3 days. In sleep mode it does not consume anyhing! Anything! A7 chip is under new archictecture armv8 64bits!!  Not even snapdragon has released something similar , snapdragon 800 chipset is based on previous armv7  32 bits only, and its power hungry ( clock at 2.0-2.2ghz) unlike apple chip is 1.3ghz and perfectly optimized with ios7 makes everything smooth.\n\nI know you are wondering or comparing it with nexus 7 (2013) , ive got the nexus 7  and let me tell you this display size its nothing compare to the aspec radio 4:3 8\" of apple. Also Ipad mini retina Its confortable to have it in one hand or two.\n\nUmm maybe now you're thinking of samsung tablet 8.4 pro or samsung tablet S 8.4( 2014) so let me tel you something , first sansung interface is not as good as ios, also they come with processor snapdragon 800 thus they're power hungry!! . These tablets now come with a resolution of 1600\" ( ipad mini retina 1536\") but its oled and oled exagerates the color accuracy, and if you go deep and investigate about their performance(cnet, the verge,iphonearena) you will find that these tablets last only in range of 6-8hrs battery.\n\nGo to cnet and the verge and see the best tablets ever so you will realize ipad air and mini comes in first and second place. Having the same machine underneath, also check geekbench 3.0 to compare it with android devices, then you will see hiw amazing this tablet is..\n\nNow this fall ios8 is coming , imagine how wonderful is gonna be with this optimization."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "In love"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Coming from Android experience, I find iPad Mini nice and sufficiently good. It meets my needs for a mobile productivity device with bigger screen and cool features."}
{"rating": 1.0, "product_id": "B00GNKRFEA", "review": "I order an iPad mini from this vendor (WorldWide Distributors) and there was a black line in the middle of it and no matter what I did it wouldn't go away. Apparently the device was used. Because I order a new one and I had to go through all the steps of registering the devices and signing into my iTunes account, something I didn't have to do with the first one.  When I turned on this first one it was already on the screen ready to be used, obviously they sold it as new but it was used."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "This one is more exciting as the Retina display is great for Facetime as well as to watch movies. It does lose WiFi connectivity once in a while - I believe this is a known issue - once I restart it works again."}
{"rating": 1.0, "product_id": "B00GNKRFEA", "review": "The ipad is still limited is so many ways.\n\nThis is NOT a productivity device, it is a consumption device.  For those of you thinking you'll be able to get some work done using page, numbers or keynote, think again because those programs are very limited in their capabilities. Anyone who uses those programs and thinks they work great obviously hasn't done any real type of work in office products in their lives.  If you are looking for an actual productivity device I would recommend the Microsoft Surface Pro instead.  When I was looking at one of those at Best Buy the other day I was completely blown away and the capabilities of the device.  It may not have all the apps, but who cares? So what if I can't play all the apps/games on ipad that are just a huge waste of time anyways.\n\nSecond, the apple OS is not the easiest system to navigate or to actually move files around.  You will need an actual windows based computer for that.\n\nI do admit though, that the screen is pretty clear.  That's about all the good that comes out of this device.  I plan on putting mine up on ebay tomorrow to hopefully get back some of the money I wasted."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Nice size and all the functions of the full size Ipad."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Have been looking for this for sometime. Had ipad 1st...2nd...and 4th gen already. Good products but wanted something smaller for bedtime reading. This was it! I waited tilli.had enough in my credit line toget it. Beautiful screen easy access and fast response. As always a great apple product!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I used to have a full size iPad. And then I decided to change to a smaller tablet, in this case, iPad mini.\n\nPros:\nFirst, I love the size and weight of iPad mini. I can easily hold it with one hand and read a book for a long time. It is much much lighter than the iPad3 that I used to have. It feels like a pad of paper, which makes the reading experience really good.\n\nSecond, the screen is good. For my mum, the fonts is little too small. But for me, it is excellent. The fonts are sharp, color is good. (Although I heard that the color accuracy is not very good, but I cannot tell.)\n\nThird, Apps. Since I use iPhone, I can find all the apps that I need. Especially 53Paper. I enjoy drawing on my iPad mini a lot.\n\nCons:\nThe sound of speakers feels tiny. Maybe the case that I use is the cause here, but the speaker is not the best.\n\nOverall, great small size tablet."}
{"rating": 3.0, "product_id": "B00GNKRFEA", "review": "The Audio(which I don't need myself)was real low when I got the unit then it stopped working altogether, otherwise I love the product."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I had an iPad 1 and iPad 2 and ended up selling both because I did not use them much, but I use my iPad mini all the time. It is so thin and comfortable to hold and the simple but very functional iOS is a pleasure to use. I have an android tablet from work and much prefer my iPad mini. Sound is great, screen is wonderful, battery is seemingly endless. And as always, apple's build quality is outstanding. Everything just works together so well, the iPad mini has become indispensable for me."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "The device was exactly as described, came running on ios 7.0.4 so I was able to jailbreak! Thank you very much."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I was torn between the iPad Air and the Mini Retina. I was in the market for a tablet that would let me read my newspapers and magazines in the mornings (WSJ, BusinessWeek, Evo, etc.) and play games in the afternoons after work.\n\nI am *very* happy that I picked the Mini Retina over the Air! Not only did I save almost $150 over the base Air, I also realized that a Mini is PLENTY big if you're looking for a portable tablet! The 2\" deficit over the Air is not noticeable at all, even though I played around with an Air for a few days. I am happy that I went for the compact Mini; it's perfect.\n\nPerformance and battery life are also commendable. There is absolutely no lag or delay in the OS at all. Further, my battery lasts 5-6 days with normal usage.\n\nStop reading the reviews and order the Mini Retina. You won't have a single regret after you power it on for the first time."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "The iPad Mini with Retina Display is a great product. It's fast,light,and convenient. However it looks as if it breaks easily. But other than that it's fantastic"}
{"rating": 1.0, "product_id": "B00GNKRFEA", "review": "I did not realize this problem until I back to China, one of my friend told me what I received is model A1432, ipad without retina display, not model A1498. But I have allready leave USA, and it is quite difficult to replace or returen the product. That means I spend $387 to get $299 things. I can not give any positive comments so far."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Love it so far.  Way better than my old Blackberry Playbook tablet.\n\nOnly issue is I should have purchased a higher memory iPad mini since 16GB gets used up very fast with music n a couple of movies."}
{"rating": 1.0, "product_id": "B00GNKRFEA", "review": "Purchased this product as a birthday gift for my girlfriend who uses several apple products and wanted an iPad so it would integrate with all her other computers.  What we received was indeed an iPad mini 16G; however, the product received did not have Retina display (the extra special part of hte gift I was hoping to give her since she knew she was getting an iPad).  We are now working with Amazon and Apple to remedy the situation.  The product was vacuum sealed stating it was an iPad mini with retina on the barcode  but that is not was was inside the vacuum sealing."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Works great, Wife loves it! The mini is a bit more mobile and stash-able than the regular iPad. Fits in her purse."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "This got here much more quickly than I expected and was delivered on a Sunday.  It was in perfect condition, and I'm typing my review on it right now!  No problems at all and I've had it for a month."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "Good quaility and fast shipping. I pad mini retina is so useful and design is really awsome. Overall, I satisfied with this product."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great little machine I use for both personal and professional services.  The light weight of it allows for one handed usage."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I bought this as a gift for my wife(without asking her). It arrived without fanfare or applause. I set it up for her so all she had to do was turn it on and go to it.\n\nShe has an iPhone and is very familiar with the Apple ecosystem.\n\nWe kept it for 5 days and then sent it back. We couldn't find any reason that we would need to spend $400 on a larger iPhone. Yes the screen is beautiful but it's not giving her anything that the iPhone isn't already.\n\nI suppose if I had given it proper thought I would have saved the time and energy on returns.\n\nIt's a nice device and it has panache. It's a really hard sell unless you know you have an app that you can't live without and want the status of buying the fruit company.\n\n5 stars."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Excellent in every way.  Apple knows how to build something that works.  Eventually I want to migrate to Apple for all my data processing needs.  So sick of Microsoft oriented devices."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I absolutely love my iPad mini. It is great for reading books and magazines, playing games, browsing the internet, etc. Its also a great size to take along with you wherever you go. So glad I bought from this seller, great price and fast shipping!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I did some research before buying considering my needs for a tablet.\n\nThe Ipad mini w/retina display is great.  Clear, bright display, good battery life, easy to use, responsive and just the right size.  Very cool how it sync'ed up my Itunes library in seconds w/me doing next to nothing.  Playing games and listening to my entire library is pretty awesome.  I'd definitely recommend it to others.  Happy w/my purchase."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "GRAND DAUGHTER LOVES IT!!! USES IT FOR SCHOOL, GAMES AND COMMUNICATING WITH OTHERS, ANOTHER EXCELLENT APPLE PRODUCT.  WOULD DO IT AGAIN"}
{"rating": 3.0, "product_id": "B00GNKRFEA", "review": "The iPad mini with retina display is great my Husband loves it and my son likes to watch his tv shows on it too"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "IOS for me is a boring OS, but that doesn't mean is bad. I don't do anything special with it that I didn't do on my Android tablet. This tablet is perfect for reading books and news and it has the same specs as the Ipad Air. If you are going to read, buy this one."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Works as advertised. Beautiful display. No problem.  Sometimes don't respond, but in general can you pull things up on the screen."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I bought this for my son for his birthday and he advised me that he loves it...was very prompt getting it"}
{"rating": 2.0, "product_id": "B00GNKRFEA", "review": "Upon delivery of the device everything was working great. About a week after I had the device I realized it was having issues with the headphone port. I didn't think much of it since it was only a week old and I figured I could just get it replaced easily. When I submit for exchange I realize I have to pay for the device to be shipped off back to them as well as a 15% restocking fee. In all of my years of ordering things through the internet I had never before been charged for returning a faulty device. It wasn't my fault that they sent me a faulty device and I was baffled I had to pay for them to give me another one.\n\nOnce my replacement iPad Mini is delivered I will most likely make sure that I never order from this seller again."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "I recently added the iPad mini to my Qosmio laptop, my ACER netbook and the Garmin Nuvi 52LM. I went on a trip and took the iPad instead of the netbook. The iPad kept me company and was a worthwhile companion. I have since replaced my basic cell phone with an LG Optimus II. I find that the the LG actually does a better gps job of giving me information as I walk around. The gps locator on the iPad is surprisingly inaccurate. Also, except for being able to read Kindle books, I use the LG over the iPad.  Finally, for walking around a city, the Garmin is quite useful in terms of showing gps location, giving walking directions and information on local points of interest. So, for the next trip to NYC I will take the iPad, the Garmin and the LG. If the iPad's gps accuracy was as good as the Garmin's and the LG's I would have given 5 starts."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "Amazing Ipad Mini, although the price is kinda high and Apple needs to increase the RAM amount. Ipad crashes on me quite a bit which is rather annoying. Apple also needs to allow split screen browsing like Microsoft or Samsung. If you aren't concerned about brand names, I'd check out the Samsung Tab Pro or the Surface Pro 2. They might be pricey but outperform Apple easily. Apps store isn't as prodigious as Apples but the Android and WIndows App store should suffice most users needs."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "picture is beautiful. love apple products there is no substitude. easy to set up and use. can't wait for the iwatch."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Retina display provides clear, crisp images, easy to read books or articles.  Video quality is excellent.  Would purchase this product again."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "While I am lost as to why Apple couldn't just name this \"iPad Mini 2\" we had purchased the Mini 1 a year ago and loved it. However, we found that sometimes video playback was choppy.  Having found someone willing to pay us almost what we paid originally for our first mini we decided to go ahead and upgrade having read so many positive reviews about the faster processor and more memory in this unit solving our video issues.\n\nSure enough, it did!  This mini is much faster than the 1 (which we truly had no other issues with except some videos) and our video playback issues are a memory.  This unit is solid like all Apple hardware and we use it every day. Highly recommended!"}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "It is slim, almost weight nothing, and retina display is an advantage to the eyes. You can hold it on your hands perfectly and the interface is fast. Good product."}
{"rating": 3.0, "product_id": "B00GNKRFEA", "review": "it's great but I'm still learning when to download new programs. the pictures is great and I like the size"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "While the iPhone and I were best friends, there's a new kid in town. So much easier than the laptop and smart phone. Beautiful display."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Just the right size, versatile, powerful, easy to use, long battery life. Great tablets for business, home or classroom use."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "And I was right!  I know several people with iPads, and, to me, they are unnecessarily large things to tote around.  As soon as the Mini was available with the Retina Display, I jumped on it like a duck on a junebug.  And boy, am I glad I did!\n\nWhile it can't take the place of an iPhone, it definitely takes the place of a full-sized iPad."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great Product, clear display, fits great in your hand. Perfect size to carry around with you everyday. Easy to use"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I am very happy with my new iPad mini. It is much lighter, easier to carry, and a pleasure to take on trips. I have not tried all its capabilities yet, but I expect to encounter no problems. Reading is simple and clear, and I especially like the fact that it takes up much less room than an actual book. Overall, I'm very pleased."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "High Quality as expected, beautiful display compared to iPad mini 1. The processor also makes a big difference and I am glad I sold my regular sized iPad 3 to get this!"}
{"rating": 3.0, "product_id": "B00GNKRFEA", "review": "The ipad is a very average machine in terms of day to day use.\nBluetooth will not transfer files to any other mac computer, Airdrop will only connect to iPads and iPhones you have to physically connect to your mac to transfer files. There is iCloud but that is Apples way of forcing you to part with cash the whole system is based on what Apple wants not the consumer.\nNo in built connections for memory card, video, software like ios7 is very poor no full screen browsing in Safari and no Flash player still. There is a sound issue with the iPad mini it is either all or nothing, there is no gradual progression of sound levels when using the volume buttons. The list goes on and on, I have used mac for many years but I have seen far better tablets for a lot less money, retina screens don't cut it any more with tablets offering better for less.\nThe only plus side for me is the build quality, but then once your tablet is in a case who would know.\nIn a nutshell you can get a HD screen tablet, expandable memory to allow you to enjoy movies etc, less restrictive software and more practical functionality at half the price."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Thanks for apple, I love my iPad mini, easy to carry, now always with me, it just wonderfully.\n\nThanks\nPutra arsana"}
{"rating": 3.0, "product_id": "B00GNKRFEA", "review": "I like this product but I must say the accessories are outrageously overpriced.  Come on 40 bucks for a lightning cable?  I have learned that the new lightning connector is highly proprietary.  WHile is its a clever design (its reversible), Apple can change the pin-outs on the fly because the each pin is controlled by a chip.  This makes it almost impossible for low cost accessory manufacturers to sell affordable cables and such.  I presume any third party accessory would have to be made under license from Apple in order to assure compatibility.\n\nI understand the merits of this in that it sustains an improved level of quality, at least short term.  But forcing high prices on inexpensive accessories essentially is a stealth way of further inflating/subsidizing Apple's enormous cash war chest, north of 200 billion bucks.\n\nAs competing tablets refine over time, I predict this proprietary strategy will decrease Apple market share as people wise up to this elitist high value game.  Do you get what you pay for?  I think the Apple Mini Retina is a great execution of a table product?  But your not getting what you pay for if you need a cable or interface that needs the lighting technology to operate.  Apple is clever but they may have outsmarted themselves."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I absolutely love my iPad mini with Retina Display.  It beats having to carry around a large laptop at home or when traveling."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "It was a gift and she just loves it it is small enough to carry in her purse already addicted to playing candy crush"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "This Ipad mini is super fast, a great size (can hold in one hand) and picture is amazing.  I would highly recommend if you are looking for something smaller than the normal size Ipad.  The Retina addition is a must have."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I have been using iphone and ipad models for years . Here is my opinion about this product.\n- If you still don't know which one to pick between the Air and this one, I would say if you want a small and portable device , go for this one. On the other hand, if you are the kind of person who likes big things :) , then go for the Air. They are almost the same.\n- People say the screen color of the mini 2 is not great as the Air . I went to the Appstore and test both of them. I didn't see any difference. So ignore what others say, go for your own!\n- You'll ask whether to buy the first mini gen or this one . I would say this one is worth 100 dollar upgrading. Faster, clean and beautiful Retina display. However, the first ipad mini is still super good . It's still fast and the screen is bearable. So, you get what you pay.\nOverall, the ipad mini 2 is a fantastic device !"}
{"rating": 1.0, "product_id": "B00GNKRFEA", "review": "In the description/summary it state that this ipad mini has 1USB 2.0 and 1USB 3. O port. This is not true, there are no USB ports on them. Buyer beware!!!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I am writing this review on my ipad mini!\nPros: great battery life, good gaming, portable, bright\nCons: very easy to dent on the back( you can just get a case)"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Beautiful screen! Highly recommended to anyone with a sharp eye and is mot ready for a full sized tablet.  ."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "A very responsive OS, great display and battery life. I also bought a pelican vault for it, so now I'm set with this. My fully customized desktop and this tablet have replaced and ended my 10 yr use of laptops."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "It is lightweight and small enough to go in your purse, yet powerful. I may not ever buy another Laptop."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I own a 1st edition IPad so the purchase of the mini with retina display provided an upgrade in a number of areas.  The weight and size are perfect for my purposes.  The mini also replaced an early Kindle for me.  The various adjustments to screen brightness and text make for a comfortable experience.  I love the resolution of the retina display and, of course, the processing speed is a nice improvement from my older unit.  The only caveat I can share is that purchasers should not count on getting the maximum battery life that Apple advertizes depending upon how they use the IPad."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "The smoothest tablet out there. Super fast and screen is vibrant with retinal display. I like the voice to text features as well."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "It's an amazing gadget. Fast, slim, small yet Powerful. I think this is the best site - weight for a tablet."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "Got it on time and mini is in good condition.\nMy son liked it and enjoying the Ipad. Great service."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I have never had a tablet or anything, first one, bought my first iphone a month or so ago, so I had to get a ipad, so they both sync. I love the ipad mini. Bought the mini on purpose because so it can fit in my purpose it"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I could not be happier with this purchase. You pay more for Apple products but as mom used to say You Get What You Pay For..\nI own an Iphone 5 and love it also.\nWould recommend that anyone looking for such products get Apple................."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I am downgrading in size but upgrading to a better display and personal assistant. I have the ipad 2 and was reluctant to pay 400.00 plus for a smallar tablet, however,  I made the right choice. The ipad 2 is just so heavy and hard to carry around. Wih the ipad mini I can use one hand, travel with ease while still keeping iOS 7. I love having siri as well. Plus it is just so cute and mini. The only down fall is how my package was shipped. It was shipped in one of thoes envelope's. All thogh it was small enough to fit I would have perferred it came in a box. Luckly everything was alright with my package. Overall the ipad mini is a great choice is you perfer a smaller tablet."}
{"rating": 1.0, "product_id": "B00GNKRFEA", "review": "Item came damaged, I have to pay to ship this all the way back to the US since I am from Trinidad and Tobago.\nWill eventually cost me more than the item itself to get a replacement."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I've always owned an iPad and finally with this one I was able to go small. Sold my iPad 4 and had the air for a little while but decided to go with this after it was released. Great decision on my part , in my opinion."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Excellent Apple product. If you like Apple, or are interested in trying a product, this is a good starter. It is lightweight enough to be handled with one hand. The retina screen took some getting use to as it seems much lighter on the printing than the iPad without the retina display. I highly recommend the product."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Perfect size and very fast!!!  I can use this iPad for everything. By far the best ipad yet (along with Air)"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I got the very first Kindle when it came out because I LOVE to read. I upgraded it to a newer version a year later, and when the iPads came out I got one more out of curiosity than any real NEED.  I use a laptop computer for everything at work and home, but I thought it would be fun to play with.\n\nI got hooked on the iBooks program, and have used an iPad or my iPhone for reading ever since.  I've gone through the iPad 1, 2, and 3, and now the new Retina Mini.  Each time I upgrade, I pass my replaced one to my son, and his replaced one goes to my mom.  So they love them as well.\n\nLast summer when I was still using the iPad 3, I tried the Kindle Fire HD simply because I wanted something smaller to use since most of my reading I do in bed.  I tried to like it, but I only used it for about two days before I got disgusted with the interface, the carousel, etc...\n\nSo this Christmas I decided to get myself a present.\n\nIt easily restored my backup from the iPad 3, and once all the apps were downloaded to it again it performed flawlessly.  I love how much lighter it is, and how much easier it is to hold and use anywhere.  I now carry it in my computer case with my Surface Pro so I have it handy if I have time to read somewhere during my day.\n\nThe performance is great, definitely an improvement over my iPad 3.  The screen is flawless, the text is just mind bogglingly crisp and clear even for the smaller size.  The games all perform great on it, but I got it mainly for reading and an easy way to check mail without having to go to my Surface Pro.\n\nThe only downside is the same downside all iPads have had - the slick back.  I really loved the original Kindle for the rubberized back surface, which made it very easy to hold onto.  This one is as slippery as any of them, but that's at least partially ameliorated after I got the smart cover, since it can fold back and gives some \"traction\" for the fingers.\n\nI was going to give my brother in law the Kindle Fire HD but I can't even find it.  It was so unimpressive that I just stuck it somewhere and forgot where I even put it, and it's not turned up in any of my searching.  That's how much I preferred the iPads for my use.\n\nSince I don't store music or photos on it, the 16GB version is all I needed so this is the cheapest version I've ever gotten (up to this point I always got the 32GB \"just in case\" and realized I never used more than half of the space anyway).\n\nFor me, worth every penny because as much as I was unhappy with the look and feel of IOS 7 (while loving the improvements in the interface itself, I hate the \"50 shades of grey\" color scheme they seemed to go with) it's still the interface I prefer for my light tablet use and ebook reading.\n\nVery happy I gave myself this present."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "I am/was a very light tablet user for until about 2 months ago (as of writing this review). I got a second hand Kindle Fire 7\" HD from a family member who upgraded and I really liked having the KFHD. I got the new (as of writing this) iPad mini w/retina as a Christmas gift.\n\nThere is a LOT to like about this tablet, and I am very grateful for the gift, but when I compare it to the Kindle Fire HD 7\", I wonder if it is worth the premium cost. So rather than review this item comparing it to nothing, I will compare it to my previous (and much less expensive) Kindle Fire HD 7\".\n\nPros:\n\n- syncs up with my two Apple computers and iPhone perfectly, Kindle does/did not do this\n\n- uses iMessage so I can respond to most text messages from my iPad\n\n- the hardware is absolutely beautiful, second to none compared to ANY other tablet, in my opinion\n\n- the retina display is absolutely gorgeous\n\nMAJOR PROs:\n\n- Being an Apple device, you get access to the best app store on the planet. I know that sounds like an Apple commercial but compared to the Kindle marketplace, I have such a better variety of GOOD apps and games to play. I never gamed on my Kindle Fire for more than 10 minutes, I found myself playing some App Store games, upwards of 45 minutes; I never thought I would game on a tablet for that long\n\n- The Operating System seems more stable. My apps crash less often, and I feel more in control of my apps. With the Kindle Fire HD 7, you can't 'close' apps; it's just not how it works (by close I mean actually stopping the apps from running in the background, when you double click the home screen and swipe them up to 'stop' them). Everything seems more fluid and less clunky as well, compared to the KFHD. This gives a huge benefit to the ease of use category for the iPad.\n\nCons:\n\n- Something is awkward about the speaker placement on the iPad Mini compared to the Kindle Fire. I -think- the sound is better on my Kindle Fire overall and the speak placement is definitely better. When holding the iPad in landscape mode (the only mode I use) your hands easily cover up the speakers, so a lot of the time you are muting or attenuating the sound, which gets annoying. This was not an issue with my Kindle. I work in audio and this gets under my skin; I am surprised they (apple) haven't discovered that people really enjoy landscape mode and should take that into consideration when placing the speakers on the device. I almost feel like they want me to use it in normal (portrait) mode, but that's not going to happen.\n\n- Although the OS on the iPad seems more stable and fluid, I feel (as of having the iPad for almost 5 days) that I prefer the layout of the Kindle Fire devices over the iOS layouts. I really liked the carousel on the Kindle and the way everything was laid out. This might change as I use the iPad more, but I still think I prefer the Kindle layout.\n\n- The form factor is a little different than the Kindle Fire HD; the iPad is wider, even though the screens are about the same size. This makes holding it a little more of a challenge than the Fire. I find searching for a comfortable landscape position on the iPad a little bit more of a challenge than on the kindle fire. Just the other day I was 'face timing' with a friend and I kept covering the microphone (which is on the back of the device) with my hand causing the person on the other end to have to repeatedly ask me to repeat myself and inquire as to what is up with my microphone. This never happened with the Kindle Fire on Skype calls or the similar.\n\n- The price, but I got this as a gift, so I can't really complain about it.\n\n========\nThe verdict:\n\nOverall I prefer the iPad to the Kindle Fire HD 7\", but the Kindle Fire is a VERY close 2nd to it. If I was making the purchase myself and not getting either as a gift, I would have a hard time justifying the extra 200 (or 180) dollars for the iPad.\n\nHope this helped someone."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "This device is overrated. I paid about $750 after the add ons, without an extended warranty. It is fun to have. I enjoy the idea of watching a really good quality video on the go. I'm going to enjoy loading my pictures on it but there'll be no privacy for the family in the photos. The apps have been disappointing so far. Often a \"free\" app is actually advertisement for that app, after you've given up your personal documentation. So you've been HAD.  But apps are very reasonably priced.\nDo not expect privacy, and not to be tracked to death. Despite disabling the \"third parties\", deleting and disabling histories, disenabling the location, and using privacy browsers -- it ain't happening. Google, mainly, picks up all the demographics from your device, and the wifi around you. So there's the ads for the local Festival and local weather when you've gone through Pains to disable location markers.  About the only thing that works well is blocking all that disgusting porn.\nOne has the impression that if one subscribes  to the Washington Post, then thereafter every newspaper site you visit will give you that darkened screen and disable your device until you subscribe to their media (or turn it off and re-boot). That's generally what happens.\nAnd YOU, you SIMPLETON, paid a grand for the privilege. Google and Twitter repeatedly bounces you off your page and deletes your entry or doesn't show your results, trying to force you to search within the APP version of Google and Twitter over there  at the Apple Store that has your personal details and credit card stuff that you had to give the iStores.\nAnother example. A relative has been sending me photos from his iPhone for a long time. Viewing them on the iPad mini? Not possible. The pad -- you can't control it -- bounces you over to a Total Video app with the question Extract this image? Say No, you can't see it. (It's already taken anyway.) Then you'll see a crowded batch of related Google imagery, no sign of your photo, and you will never, ever see the image that was sent you on your new iPad Mini. About the only thing you can do is delete the \"free\" App. You don't really have control over the device; it controls you.\nUpdate: 2/26/2016 I added a star because I USE THIS DEVICE ALL THE TIME! I would not recommend getting a cellular add-on to one of the big three carriers (it's $100 extra) because you will surely almost never use it if you are an ordinary person. I added on Verizon after reading wirecutter.com and once added $30 for 2 gb of data.  I used it all in a day simply Tweeting! The wifi at fast food places, ect., when you're not tethering it to your phone, is enough."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I bought this iPad yesterday, I haven't put it down. This is some of apples best work. It's fast, perfect battery life that you have to use forever to get to die, and the display is absolutely beautiful!!!"}
{"rating": 3.0, "product_id": "B00GNKRFEA", "review": "I would of give 5 Full Stars only if Setting then Sound has both adjustable Mic Gain Control and live mic monitoring, IT DOESN'T. iPhone 5s and the latest iPads is totally made for on the go portable device. One thing; iPad is the far from doing professional without you'll lugging the CUMBERSOME high-end smaller mixer with headphone monitor jack plus STEREO Microphone or 2 mono for left & right microphone for nice Stereo separation and 5 pounds of battery pack to run bulky equipments for video shooting. \"Come along!\" This is TWO MEN JOB to hold and run the equipments. The built-in video mic record in mono instead in Stereo. Without mic Gain control, you'll have to be in around 30dB overall sound as the PEAK up around 90dB for it properly pick up very nice sound with video shooting. It's not for nature outdoor sound unless near-by T-Rex is growing. If Apple wanted to win over Samsung Galaxy and Microsoft Surface and other Tablet. Apple can do better. iPad is something like the very high-end version of Chrome Book. iPad does very well in speed and very rich color quality on this screen. Only thing audio does very well from ext. Stereo Mic, is on Garage Band. Now I had discover, my ext. stereo USB mic doesn't work for video shooting. I'm stuck with built in MONO mic or nothing as no audio through any ext mic. So Apple has lost 1 more extra star = to 3 stars. I will find out, if Samsung Galaxy Tablet do 1080p video shooting with ext. stereo mic. -ADDED-ON- I had talked to Apple Senior Advisor for near 2 hours long about software issue through Video Shooting Mode. She had fully understand of my concern as she had FWD. it to top software engineers. It's totally 100% not Amazon fault at all."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "I like this. I put this tied for best small tablet with the asus memo pad hd. The pad does not have the specs the iPad has. But it does have a lower price. Battery life that's almost as good. sd card slot. The biggest reason why I don't think the iPad mini retina is above the pad. Is because for 400 dollars I think it should've came with a 32gb drive."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I am currently writing this review on my new retina iPad mini and I have to say it is incredibly easy to type with. I was considering the new nexus 7 and the kindle fire hdx. The hdx looks very nice and it's easy to use but what you see is what you get. You can't customize the background at all which is ok but it just seemed very limited and I don't have amazon prime. The graphics and sound we're great though. The nexus was my next choice because of the price range and the good display. However the sound quality was not to my liking which is very important to me. I do like the selection of apps and the android interface. But I did not like the aspect ratio on the nexus as I am mostly going to be using the tablet for movies and games. The iPad mini to me was the best option because of the awesome speakers, retina display, perfect aspect ratio, endless apps and the incredible build quality. Watching movies and playing games are perfect for this tablet. It is less than a pound and it is sporting all of the same features as the iPad air. I am very happy with my purchase. I usually have buyers remorse but I have not had a second thought about this one"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Background:\nI have been an Apple fan for a while but I (try) to keep my ratings objective. I bought this to replace my aging iPad 1, which sadly is too underpowered to stop from randomly crashing. The model I purchased was the 16gb black, WiFi only model.\n\nForm Factor: 5/5\nLike most Apple products, the iPad mini feels really solid while still being thin and light. It is light enough that you can easily hold it up with one hand, yet heavy enough that you can tap the screen or push the buttons without pivoting it too much. Size wise, it feels small when carried, but when you are using it feels like you have significantly more real estate, which leads me to my next category...\n\nDisplay: 5/5\nI was initially hesitant coming from a 9.7\" tablet that I would be losing screen space. This, however, is not a big problem, since the retina display lets you see much smaller text with significantly less eye strain. This is what ultimately sold me on the tablet. When I was in the store, I brought up an online math textbook on this iPad, the non-Retina mini, and a Galaxy Tab 3 7\". The iPad mini retina simply looked the best.\n\nPower: 4/5\nI think it is a bad idea to directly compare tablet power in PC terms (processor speed, memory, etc.). A better metric is how responsive the tablet is. I find that this iPad is very quick to respond to finger taps and button presses. Web pages load much, much faster than on my original iPad (which is to be expected) and my iPhone 5. However, this power comes at the expense of heat. When downloading large files or using high-power applications, it tends to get a little warmer than I would like. It's not problematic, but it is just something to be aware of.\n\nBattery: ?\nI haven't fully drained the battery yet so I'm not going to give it a rating yet, but I have noticed it drains about 10% in an hour of web browsing + streaming music, so I expect it gets about 10 hours. This is in line with what Apple claims, so I expect this rating will be a 4.5 or 5 out of 5.\n\nOS/Apps: 4/5\nI personally don't like the look of iOS 7, but it gets the job done and done well. While it doesn't have the nitty-gritty customization that Android has, it is very integrated. Control Center is a nice addition; Music, Mail, Newsstand, Calendar, and Maps have all been improved upon and function well. iOS may not be very interesting but it does a fine job, and of course you have the whole App Store to find 3rd party apps in case you don't like the Apple-designed ones.\n\nStorage Space: 4/5\n16gb is tiny (there is no doubt about that) BUT physical storage space is becoming less and less relevant. Because I use Spotify and Netflix/HBO Go for most of my media consumption, I don't use more than 3-4gb of space on the tablet. What's left is space for apps and documents... 16gb holds quite a few apps. But, if you like having a large offline media collection, go for the more expensive models, which brings be to my next point...\n\nPrice: 4/5\nWhat? 4 out of 5 for price on an Apple product? Yes, I said it. If you don't use that much offline space, this iPad is a solid value at $399. My experience with Apple products is that they last longer than average, so you can expect to get 3-4 useful years out of it, which is most or all of high school or college. Now, I feel paying $100 for an extra 16gb is outrageous, but I'm not reviewing that model. Don't get me wrong, this is a premium product, but for what you get $399 is fair.\n\nCamera: 4/5\nDon't take pictures with a tablet. That being said, the front and rear cameras are fine for video-chatting (which I suppose is what they are really meant for). Aside: I don't understand video-chatting with a tablet. All you see is the underside of someone's face.\n\nComparison to other tablets: 5/5\nLet's face it: there are other tablets on the market with features that the iPad doesn't have. The Surface can run PC applications. The Galaxy 3 and Nexus are both a bargain. But when you put the entire package together, the iPad wins every time.\n\nI suppose these average out to a 4.5, but I'll round to 5 stars because of useful miscellaneous features, including the smart cover, Lightning port, and dual-speakers which are pretty good for a tablet."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "What I Love About it:\n\n- Very tight integration with software and hardware. Apps launch quickly and are optimized for this tablet.\n- Screen is extremely responsive and colors look accurate, whites look white, brightness is good. The retina screen makes text and icons very crisp and sharp.\n- The 8\" size makes it easy to tote around, not to mention it was $100 cheaper than the Air.\n- The side switch can lock orientation which really comes in handy.\n- Safari is a treat to use with multiple tabs being easier to navigate with the latest update. Love the fact that Bookmarks get added to my iPad automatically when I add them via my iPhone or my iMac.\n- Love the fact that the Settings menus is optimized for tablet and laid out in an easy to use way rather than hidden like on the iPhone.\n\nCons\n- Maybe it's just my unit but I've been experiencing an awful lot of crashes. Maybe I should reboot mine or something? It will crash when I am running a certain video in Safari or running a game seemingly at random. This is why I docked it 1 Star. The crashes have happened enough to the point where I got the impression that the software is not stable enough.\n- Takes a long time to fully recharge, at least several hours.\n- Typing on the touch screen is kind of tough in landscape mode. Would have been nice if they could split the keyboard into halves so I didn't have so much area to cover.\n- I'm aware of the lack of color gamut compared to the iPad Air, I don't care, the screen still looks smashing!\n- Sound could be a bit louder. The loudest setting is quite audible on Youtube and other music and videos but it seems to me like the loudest setting should sound loud.\n\nOther Thoughts\n\nI got the official Apple Case for it (not Cover). I love it. It is really light in weight, holds the tablet snugly, and looks really good too. It also turns the screen on and off when you open and close it. I got the black case because I noticed other cases might get dirty and it shows and doesn't look so good. Black will never look dirty. It feels kind of soft, like pleather. It's a nice feel. Using the cover as a stand isn't the greatest, it's a bit unstable but is useable.\n\nI decided on Space Gray because the white models have a thin black line that goes round the screen. It's subtle and most won't even notice it, but I notice little things like this. The black bezel also allows me to focus more on what's on the screen so it gives a more uniform and professional appearance.\n\nAlso got the 64GB model because 16GB is just not enough for a tablet. Some games are 1GB in size and I wanted to put movies on mine as well. I wanted the TMobile LTE model but it's nearly $130 more and I didn't want to spend. Got mine from Best Buy before the holiday rush. Feel sorry for those who want one now and can't get it.\n\nRushed to get this tablet. Originally had the Samsung Galaxy Tab 7\" (first gen) which could actually make calls. It was basically just a big Android cell phone. Never used it, but have used my iPad religiously, even taking it to my trip to San Francisco. It held up fine and provided some great entertainment for me and others. IMO this is the best tablet out there regardless of size. App and game selection can't be beat. Waiting on dedicated game controller to use with it. :)\n\n*****UPDATE 1/16/14*****\n\nLove my iPad! Took it 3 weeks trip to Taiwan and Japan. Could slip it into my backpack or fanny pack with ease. Also slipped into the front pouch on the airplane without making it bulge. Battery life is good enough so I can charge it overnight and use it most of the day. Use it with Origami case and Apple bluetooth keyboard as a standalone workstation. Works very effectively to type long passages. Pair it with Oontz bluetooth speaker because the speaker is just not loud enough. I use the keyboard to control the volume.\n\nI still use my iPad every day pretty much. Tried putting one of those stickers over the home button but it didn't fit. Maybe the home button is slightly smaller than the iPhone? Then tried another sticker and I was unable to close the case properly so out went that. Bought a dual USB plug for higher amps (tablet) so I can charge my iPhone simultaneously.\n\nTried the keyboard trick suggested by the commenter and thanks. It really works but the keyboard kind of small, kind of hard to type on. Don't like the placement of the letter \"b\", it should be on the left side, not right. I keep reaching for it instinctively and it's not there. Every keyboard I've ever used that was split (Microsoft Ergonomic Keyboard and others) has the letter \"b\" on the left side."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "So many glowing reviews on this, so I'm just going to stick on the negatives.\n- I've felt that this was the model that should have came out when Apple first released the 1st gen mini. Retina has been the standard for a while on Apple products, and felt that Apple were letting down its customers with the low-res display. But that's the cost of being an Apple customer, they give you just enough for you to want it but not need it, until the next model comes out.\n- Retina Display looks absolutely gorgeous, the high amount of ppi, 320 or so, is definitely evident in pictures and sharp text. What they say about the colors not being as vibrant as the iPad air and the 4th gen iPad is unfortunately true. Colors do look a tad washed out, and it's especially noticeable on the reds such as on the Youtube app. Not really issue for me, didn't really notice it myself until detailed reports came out on it. It will be an issue for anyone depending on color accuracy, but that portion of the market is probably getting the Air for the bigger screen size anyway.\n- Webpages can be a bit of a hassle to navigate. Coming from a full size iPad I've found that I have to zoom in and scroll side to side much more often. This is the price of portability and having a small screen, not a big deal for me, perhaps for you.\n- Missing Touch ID. Maybe not a necessity as much as a phone, since most tablets are kept in the security of your home, but it would have been nice to have that feature nonetheless.\n- No option to create and switch users? I understand the need to sync through iTunes/iCloud , but I think it's time for Apple to allowing its customers to create guest accounts. Not needed in an iPhone because it's personal, tablets on the other hand are usually shared between families within a household. It would be nice to be able to keep designated accounts for your child especially.\n\nConclusion. I think that this is the ideal tablet for the casual tablet user. True there are other small tablets out there that are less expensive and better spec-wise, but the iTunes App store is the best store for tablet-oriented apps on the market. I've yet to purchase an actual paid app, but have found tremendous value in the free ones for my interests and needs. Don't let the color gamut issue dissuade you from purchasing one, you won't be disappointed."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "128gb Here!  I had the original iPad mini, which was phenomenal for me because of the portability.  I was completely happy with my 64gb tablet and had no real interest in the retina display.  So when I heard of another mini coming out, my mind said \" Meeh...\" UNTIL I saw that the new one would be 128gb.  I was sold before it even came out.\n\nI'm an app hound.  I want whatever I own mostly available to me.  I listen to music while reading from my Kindle app or doing photo editing, so I expect loads and loads of pictures to be stored.  It has the Amazon Prime Video app, so I'm not missing out on my year of prime videos.  I do yoga, meditate, breathing exercises, play games, create my family tree...you name it.  Listen to Amazon cloud player for my purchased music. Download a boatload of movies while going on trips.\n\nFor me, comparing the iPad mini to my Kindle Fire was like comparing Apples to Oranges.  I loved my Fire, but iPad does SO MUCH MORE!  I am trying to teach myself calligraphy and drawing/painting.  I don't have to pay the money of expensive tools that I'd have to clean up.  I do it all on my iPad.  I love you, Apple..."}
{"rating": 4.0, "product_id": "B00GNKRFEA", "review": "<div id=\"video-block-R1NM5NDFPKY1T0\" class=\"a-section a-spacing-small a-spacing-top-mini video-block\"></div><input type=\"hidden\" name=\"\" value=\"https://images-na.ssl-images-amazon.com/images/I/B1Y-oOzKuCS.mp4\" class=\"video-url\"><input type=\"hidden\" name=\"\" value=\"https://images-na.ssl-images-amazon.com/images/I/81qY2Bw9ogS.png\" class=\"video-slate-img-url\">&nbsp;I am writing this as an upgraded view not as a first time iPad buyer. i actually got the 64GB version but i do not see it listed on Amazon at time of writing this so i'll review the 16gb. i bought the black, i had the white. i went black because as beautiful as the white is i found myself looking at the bezile often. the bright white distracted me from the screen sometimes. the bezel fades out of view when black and i find myself seeing more of what is on the screen.\n\nthe retina display is a huge upgrade. i have corrective lenses and need 1.25 reading glasses. reading all text on the retina is worth the upgrade for me. while i do not have an iPad to compare the color gamut i can say that i think the colors are fine. the display is a worthwhile upgrade consideration. as much of an improvement the screen is the processor is an even bigger improvement. i use to see load time of a game called Field Runner2 HD (there is a free version too if you want to check your mini) of 40 seconds or so, the new mini loads twice as fast. i wish i took a video of the two side by side before i sent my old one to a friend. it was amazing how much faster the new iPad loads games. i did do a video on the retina loading the game.\n\ni would like to say the iPad mini should have had the fingerprint scanner and all Apple products are overdue for built in wireless charging. still this is a really nice product and i am glad i spent the money on the upgrade."}
{"rating": 1.0, "product_id": "B00GNKRFEA", "review": "Update 5 - (Amazon deleted the news link.)\nMercury News - \"Wolverton: Despite upgrades, iPad mini not worth Apple's premium\"\n\nIf you are ...\nPoor - You should not be playing around and just buy a $350 laptop.  Money is tight and you need a full function PC for daily needs.\n\nWorking with little cash - You may want to consider the original Mini as it is $299 and with gift cards, but you should save your money for emergency car repairs & etc.  Use the money to buy a smartphone as it has the same functions.\n\nWorking with a lot of disposable income - Go buy it at the Apple Store or Best Buy.\n\nRich - What are you doing here?  Go fly to the Big Apple and buy it from the Apple Store.\n\nLemming 17 - the cat is finally out of the bag.  You must be a 3rd reseller.\n\nLemming 18 -\nSome basic facts about the 2nd generation Nexus 7\n- 7\" is the perfect size tablet for an adult to hold in one hand from the sides.  The iPad Mini is a drop hazard and carrying the iPad is much harder than you think.\n- If Chrome crashes, install Safari, Opera, Internet Explorer or Firefox on it, but I highly doubt it crashes as much as you say.  Keyboard?  The virtual keyboard is great and very responsive.  3rd party keyboards are garbage, they might be garbage but you don't need a keyboard when you are using a tablet.\n- iPad Mini vs Nexus 7 - world's apart?  Both are good tablets that work with apps.\n\nI find your post negligent in facts and with exaggerations.  If you need to sell your Nexus 7 to buy the iPad Mini with Retina Display, you may want to buy the original Mini as it is $100 cheaper and includes gift cards from several national retailers.\n\nIf you are new to tablets, you need to understand what it is capable of.  Tablets can use light office applications like for spreadsheet, typing and etc., surfing the internet, camera, Wi-Fi chat, cellular signal chat, & apps.  Tablets does most things poorly, but it excels at apps.  The apps are very specific applications that does everything from playing games to find words in a dictionary to finding the latest sport scores and etc.  Do you need it?  Probably not.  I already have a smartphone & Windows 8.1 for my apps.  If I want to surf the net, I have my ultrabook laptop which excels at web surfing, software applications, typing, adding on accessories like a mouse, charging my smartphone, music transfer to my smartphone, & etc.\n\nDid you get confused on how Apple is referring to color on the back and not the front?  I am rooting for Apple to come up with more backward strategies.  Retina display.  Silver & dark grey because Apple is referring to the color on the back of the iPad Mini and not to the front color.  $39 cover.  $99 Applecare that covers internal damage wires as stated by the Applestore guy, but not drops like Square Trade.\n\nThe iPad Mini with Retina Display - I reiterate the 1 star rating.\n1. The original Mini is $100 cheaper, with gift cards give away.  When playing with apps, it makes little difference with better resolution as it just animated colors and lines.\n2. The Nexus 7 2nd generation is $200 cheaper, higher resolution screen, better at holding with one hand, Android apps are just as abundant as Apple store apps, takes just 5 minutes to erase and make your Android like new.\n3. Kindle Fire HDX is $180 cheaper, higher resolution screen, has \"Mayday\" button for help immediately, a ton of free videos with Amazon Prime membership.\n4. Microsoft Surface 2 has Office RT, Excel, Notes, Word, Power Point, & Outlook, 1080p resolution, a lot of ports, and super neat keyboard cover.\n\nWhen compared to other devices, the Mini with Retina Display gets 1 star.  When you don't compare to any device and rate it stand alone, the iPad Mini with Retina Display gets 4.5 stars.  Not comparing it to anything doesn't make sense and so 1 star stands.\n.\n.\nUpdate 4\nWhat?  If your Apple product is so great, go put up a review at the Apple store.  Can't put one?  Go talk to Tim Cook about it.\n\nLemming 16 - $39 Apple MacBook Air stand and gives 5 stars for a piece for matching plastic.  You might want to make a donation to the Apple shrine or Apple temple.  Laptop manufacturers have never created a vertical dock/stand because it is not a good idea.  Heat disbursement is concentrated at an unintended area.  I hope your MacBook Air is fanless, but no matter as you can easily afford to buy 2 o 3 more if your vertical MacBook Air gets knocked to the floor by your unintended hands.  You may want to email Apple about when you can buy a decent pair of iHeadphone and an iCar.  Selling iHeadphones for $299 would be easy as selling hot cakes.  Selling iCars for $100K would be a piece of cake.  Tell Tim Cook to buy Tesla for $20 billion, rename it Apple, and call the models iCars.\n\nStarting on December 17th - ends probably in 7 days, Radio Shack has the original Apple Mini for $299 and will give you a $100 gift card, but it must purchased at the store.\nStarting on December 17th - ends on Saturday night, Target has the original Apple Mini for $299 and will give you a $30 gift card.\n\nSo did you hear that Apple makes their old products obsolete by allowing software upgrade, which slows down the old unit tremendously?\n\nNote to self, I want to be as rich as Lemming 16 soon so I pay for overpriced Apple products that gives me less value than what I pay for.\n.\n.\nUpdate 3 - (Amazon deleted the article link.)\nBBC - \"The more inept you are the smarter you think you are\"\nThis article is for most of you who left a comment.  You & your mom probably thought you could be as smart as Einstein, but you are probably average to below average.\n\nTo be efficient, I will simply refer each & everyone as lemming 1, lemming 2 & etc.\nLemming 1 - nothing to add, just a jerk\nLemming 2 - states some half truth.  Just pretend Wi-Fi signals are flying everywhere, and your iPad is like a magnet pulling and concentrating the signal.  Walls will block Wi-Fi signals and/or make the signal much weaker.  Why doesn't some scientist research about the possible health issues of Wi-Fi signals and other cell phone signals?  Wall Street & the White House do not want to stop consumers from spending money and might cause black lash on technology.\nLemming 3 - too much irrelevant information.  I will explain the 1 star reasoning below.  By the way, did you provide your back up why it would deserve more?\nLemming 4 - don't hate me because I am popular.\nLemming 5 - I am sure you buy things because other people buy them in masses.\nLemming 6 - micro USB to ethernet will allow reliable internet connection.\nLemming 7 - delete by Amazon and so who knows what he wrote.\nLemming 8 - nothing to add.\nLemming 9 - how?  anything to add?\nLemming 10 - MTV afficionado?  still paying Comcast $80 per month for cable TV?\nLemming 11 - Finally, someone with an opinion and recommendation.  Above average IQ from this group.  It maybe 2013, but Wi-Fi is insanely unreliable.  Another LTE gadget, it is going to get costly, about $150 extra for the device and expense fees to access it.  Downloading apps with Wi-Fi can take hours.  I requested about 90 apps to download and I am still not done after heading to Starbucks for 4 times, over 10-12 hours invested.  An almost new Starbucks did not allow me to connect period.  At a Peet's Coffee shop, Wi-Fi was insanely slow.  If I was able to connect it using an ehternet cable, I would be done in 1.5 hours.\n  I don't mind being tied to an ethernet cable because I don't surf like the rest of you as I don't sit on a desk.  I use my gadgets using a standing desk.  Just saw something neat last week, the Varidesk will convert any desk to a standing desk.\nLemming 12 - lacks common sense.  Did you mean using a lead hat?  What about the body?\nLemming 13 - nothing to add\nLemming 14 - Windows 8.1, both a tablet & PC, a great combination.  Wi-Fi to download apps is simply too slow.  If it was me, I don't care about tablets with an iPad as Windows 8.1 & a smartphone would be enough.\nLemming 15 - save your money.\n\n1 star still stands.\nCome to Amazon to pay a mark up price, it is not very smart.  Go buy it at the Apple store or Best Buy.\n\nBuying an iPad Mini w/ Retina Display vs. the original Mini or iPad Air, it is not very smart.  7 days after Black Friday, the original Mini is being sold for $299 w/ $50 gift cards from Radio Shack.  7 days after Black Friday, the iPad Air is selling for $479 w/ $30 gift card.\n\nFor rendering simple color and lines from apps, the original Mini & Mini w/ Retina Display doesn't make much difference.  For app usability, the original Mini & Mini w/ Retina Display doesn't make much difference.  Some people say the better display or faster chip is worth it.  On specs, it does.  On the practical side like actually using the app, probably not.  If the display is for things like surfing the internet and showing hands and face, I wouldn't use the iPad for that anyway as I would use a laptop.\n\noriginal iPad Mini - if you want it, I would rate it 3.75 stars.  This is simply because your iPhone works in the same way, but tiny screen vs much larger screen.  It is difficult to carry by the way unless you have a large purse or backpack.  Good thing so far as I have not seen anybody play with their apps on the bus.  If you don't have a smartphone and want it, it could be a 4.5 stars device.  However if you don't have a smartphone, it might be better to use the money to get yourself a smartphone instead of the iPad.\n\niPad Air - it could work if you are into using a tablet.\n\niPad Mini w/ Retina Display - 1 star since practical improvement over the iPad Mini is minimal.\n\nIs anybody still asking what I should get?  If this is you, you should head to Best Buy, browse & play around with different devices like the iPad, Android devices, Surface, Chromebook and touchscreen Windows 8.1.  But Chromebook & Windows 8.1 are not tablets.  They are as they have the ability to add apps to the main screen.  With 2 in 1 laptops with Windows 8.1, the laptop will fold back to be like a tablet and can save apps to the main screen, tiles.  With the new Acer C720P, this new Chromebook will have touch function for $299 and can save Android desktop apps.  If it was for myself, I find no reason to buy an iPad.\n\nStill, I want an iPad, but don't know which one.  It is obvious as you should buy either the Wi-Fi model or better yet buy the T-Mobile LTE model.  T-Mobile will give you free 200 MB of LTE access every month for life, but just try not to go over as that will incur additional charges.\n.\n.\nUpdate 2 - for the ignorants.  Yes, I just created the word \"ignorants\" for the Apple fan boys and maybe the 3rd party sellers also.  Google Nexus 7 and Microsoft Surface can connect to the internet by using an ethernet adapter.  With the Nexus 7, you can connect by using a micro USB to ethernet adapter.  I prefer a micro USB to USB adapter and then a USB to ethernet adapter.  The idiot at Radio Shack tried telling me that a micro USB to USB is an \"extender\", but they don't carry it anyway at the retail stores and neither does Best Buy retail stores.\n\nWhy doesn't Apple support internet through an ethernet adapter?  Who knows and don't care as Tim Cook isn't a good CEO.  The Apple Air uses uses a thunderbolt to ethernet adapter and the lightning plug may be a dumb down version with limited capability to get Apple fan boys to buy both thunderbolt & lightning adapters.  Apple is saying \"Pay Up\".\n\nThe iPad Mini beats the iPad Mini with Retina display based on price with similar capabilities.  Tim Cook left the iPad Mini at $299 and the iPad Mini with Retina display at $399.  For the average person, they should have their money and get nothing.  For the consumers with disposable income, get the iPad Mini or iPad Air.  For the Apple fan boys, why are you looking at the Mini with Retina display anyway?\n\nI hope you like paying all these gadget fees every month.\nCell phone - $100 per month\nCable TV - $80\nApp cost - $0-$20 per month, varies\nInternet connection by phone or cable company - $50\nWhat does this all mean?  It means that you are spending $3,000 per year or $90,000 over 30 years on these fees.\nCollege football access cost?  NFL access cost?  Baseball?  Magazine online subscription?  In app purchases?\n\nIt is no wonder your girlfriend can splurge on an iPhone & makeup as you are the one left paying for all these plus apartment rental, food, entertainment, water, garbage, gas & electricity.\n\nWhat the..?  Amazon deleted my previous update or auto delete.\n.\n.\nFirst post -\nThis iPad is going to a toddler to learn to read.  iPads need to work with Wi-Fi or else it doesn't function properly.  Apple does not have \"lightning to ethernet\" adapter and the \"thunderbolt to ethernet\" adapter does not fit the iPad Mini.  I bought the \"lightning to USB\" adapter and it doesn't work with the USB 2.0 nor USB 3.0 to ethernet adapter.  Finally if you plan to connect to the iTunes store to access the internet, it doesn't work either as it the iPad will instruct you to connect to Wi-Fi.\n\nI don't have Wi-Fi at home and I chose it that way because I don't want invisible waves going through my body if I can avoid it.  If you want to go to the App Store, you will need to connect it to Wi-Fi.\n\nWindows RT is for teens & adults, but I will seriously consider Android tablets.  With Apple, use it the way they want you to use it or else it fails to work.  It is failing to work for me at this moment and hence the one star."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I read in the news today about it becoming available.  Bought one and love it.  Will be disposing of my iPad 4 as soon as possible.  The mini with retina is better in every way.  This is what a tablet should be.  Using the iPad 4 after using this just feels very cumbersome and unappealing.  I like this tablet a lot.\n\nIt's very light.  I never get tired from holding it.  The display is superb.  It's very fast.  I really think apple achieved perfection with this jewel.  It can't be improved, I've been brainstorming how from the time I started using two days back.  There is zero chance of me going back to regular size ipad or tablet.\n\nThe processor is the A7, rather than the A5 in the first mini.  It's much faster than the first mini.  Geekbench timed it as three or four times faster depending on activity.  It has the same resolution as the Air, but on a smaller screen, therefore the ppi, pixels per inch, is higher than the Air.\n\nMuch ink spilled about the color gamut issue, namely that the mini only reproduces sixty three percent of the gamut.  I think it is true the colors are a bit washed out.  I had an ipad 4 before this, and the display of my mini, while beautiful and very sharp, does seem subdued over my ipad 4 screen.  But it could be psychological bc of the smaller screen.\n\nAs to the debate of mini vs Air.........if you are the stationary type, the Air is probably better.  I dunno though, I AM the stationary type and I still like the mini tons better than my ipad 4.  It's amazing we as a people have become spoiled to the point a 1.5 lb like the ipad 4 seems heavy.  But it does.\n\nI think the mini is awesome for reading but everything else too like TV and movies thru netflix or iTunes or whatever.  The minis form factor can't be beat.  You can hold it in one hand, and I have very small hands.  It weighs only .75 lb.  it is such a great product.  I have never spent a better four hundred bucks in my life and I regret having to spend nine months with that behemoth that wuz my ipad 4 when I could have been canoodling with a mini that whole time ;("}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "This is my second ipad but my first mini, I'll never go back to full sized again.  This is what tablets should be, easy to use, blazing fast, comfortable to hold, crips & clear screen.  When the mini first came out last year I fell in love with the form factor, but the specs didn't live up to what I wanted in any computer.  The old mini was out dated before it launched, it was using 2 year old internals and a screen that was 1/2 the resolution of not only competitors but the other iPads.  Not only do I feel that this new retina mini has top of the line specs it truly is so adhead of its time with a 64 bit chip and second stand alone co-processor, this thing will be relevant for years to come.\niOS and the AppStore that comes with it make the iPads worth the extra money over samsung and amazon, but this hardware is amazing.  It's the perfect companion and bridge to my technology at home when im at work or out on the town."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I just got this tablet 2 days ago, wifi edition.  My wife uses the 4G LTE edition, and we both love them!  The craftsmanship, design, speed, superb display, and refined iOS apps help to make this tablet the best one yet.  I love that I can finally hold it above my head in bed with my index finger and thumb on my left hand and use my right hand to touch the display.  I bought a cheap clear back and smart cover for around $11 or so on ebay from 2 different sellers.  I came from an ipad 3 (the new ipad), and the difference is night and day.  I also like that they are including the office and media creation apps for free if I ever need them. Another plus is that they have it $100 cheaper than the Air and kept the same processor and graphics in it, so I don't have to worry about being hindered."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I'm using the retina mini right now as I write this review. I loved the original mini because of the amazing build quality and comfortable size. Now it's essentially all the good things we had before but with crystal sharp display and faster processor.\n\nThis device reeks of quality and craftsmanship. I sold my Nexus 7 and Nexus 10 to buy the retina mini and I've made an excellent choice. While the Nexus tablets are great they feel like budget tablets. I prefer the smaller size tablets like the mini and Nexus 7, but I found the Nexus 7 to be a tad too small. It's even smaller than 7\" because of the onscreen buttons. I'm much happier with the size of the mini for writing emails, surfing web pages, and most of all reading books and comics. Sharp as real paper right up close.\n\nIf money is not an issue the retina mini is totally worth the $399 price tag. I thought the original mini was worth more than the $329 they charged for it. I'd have paid $349. It's that good. So I'm okay with the retina mini price. I would say Apple is the Acura of tablets. Classy, elegant, and high quality."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Wasn't always a big fan of minis but maybe it was because I never really gave them a chance.. I finally wanted to try it and found a good deal on amazon so decided to get one for myself. I LOVED it. I owned an iPad previous to this but it was always too big for me to use and I felt as though I just didn't use it as much because of that. This iPad brought back the reasons to why I bought the iPad in the first place and allowed me to use it more because of it's size. The size aspect of it made it much more convenient for me and allowed me to bring the iPad with me to a lot more places and be able to use it comfortably in a lot more situations. Big love to Apple for bringing out this product!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "When I bought it I didn't know how much I was really going to use it but the more I've had it the more I've used it. I love using this iPad for facetiming with my parents who live far from me. Really just a great device to have on me!! Would recommend"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Great iPad and great pricing too! Love how compact this device is and how it works, combining every aspect of every apple device into a singular model!! Love it!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Wasn't always the biggest fan of the iPad franchise because I always thought that they were too big to use. I finally decided to give this one a look and try it out and was surprised how much I liked it and how much I ended up using it. The mini is much more for me as it isn't as big as the regular iPad but is still bigger than any phone can be."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Having a young son is not the easiest thing to please. He gets bored of everything very quickly, so when it was time for his birthday, I had to find the perfect item. I did just that with the Apple iPad mini 2. This product was the perfect gift as it keeps my son happy, which keeps me happy! He loves the smoothness of it and the size. Great product apple!"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "This iPad is one of the most convenient thing Apple has ever made. The original iPad was maybe seen as too big for some people, but this one is not too big, but also still has that size that makes the iPad stand out throughout the Apple product list. It is also an upgrade from the first iPad mini. Very happy with this product."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Exactly as described.  Near perfect condition with OEM charger and cord."}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "I love it"}
{"rating": 5.0, "product_id": "B00GNKRFEA", "review": "Excellent!"}
{"rating": 1.0, "product_id": "B00GNKRFEA", "review": "Stopped working after 2.5 months, tried reaching out to the seller no communication back.from them. Buyer beware."}
