{"rating": 3.0, "product_id": "B00HWMPKJK", "review": "Just received the Apple Ipad Air.  I have not opened it - my expectations is that it will work just great.\n\nKnow what I am really bummed about?  It says APPLE CERTIFIED REFURBISHED nicely printed on the shrink wrapped box!  I bought this for a gift, and I would have told my wife that I got a good deal on a refurbished one, but I didn't like the fact that its on the box!  They could have put the refurbished designation on a sticker, so it can be removed.  Now when she opens it at the party everyone will see APPLE CERTIFIED REFURBISHED!  I just don't feel like this is right."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "iPads are great!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "The product works great !"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "iPad was purchased just over 6 months ago, won't even charge now and have had issues with charging since receiving it. Bought for my 10yr old sons birthday so he can keep in contact with family out of state and he can't even use it."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "product came locked with password. no literature, support, and most importantly no password was given to me. ruined fathers day. support team did not solve problem."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Bought two of these for our twins.  One of them won't hold a charge and also keeps showing headphones are in and they arent. The other one  won't hold a charge either and the sound keeps going in and out.  Returning both. I would not trust buying these!  We took our chances with the mixed reviews but unfortunately have to give these a big thumbs down!!!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Works great, came quick, and so far no issues. Love it!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "For being refurbished its good and so far works great. Looks brand new seems brand new and if wasn't aware that it was refurbished I wouldnt have known. Will give a follow update in a few months!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I bought this for my niece and she loves it! Its in perfect condition"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I've had it for a few months now and it's worked perfectly, I love it!"}
{"rating": 2.0, "product_id": "B00HWMPKJK", "review": "So everything was good about the ipad I mean a little weird things here and there but for the price its been great, I bought a glass screen protector not knowing it came with one so I left the one the ipad came with for back up well I finally needed the back up screen protector it came with and my whole screen shattered and the screen protector that it came with not a scratch smh unbelievable !"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "It came perfect. Honestly I was preparing for the worst. Definitely worth the buy."}
{"rating": 2.0, "product_id": "B00HWMPKJK", "review": "I couldn't get it to work with the help of a trainedApple tech so I returned it."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "This product was a large disappoint. Bought as a gift for my husband he were unable to use it as it wouldn't hold a charge for more than 2 hours"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "The first iPad ordered was a certified refurbished one and it kept cutting off and wouldnt hold a charge. I sent it back. The new one was guaranteed a delivery date-I paid extra for that and it arrived 3 days after the guaranteed date. Im not very pleased."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Update: WiFi has stopped working after about a month.\n\niPad looks more like a used product than a certified refurbished product. Charger that came with it doesn't work. Overall the iPad works and has no problems operating, it just has physical blemishes."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Didn't work out"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "This was shipped to me with a damaged display screen. The illuminated startup screen showed discoloration (red spot). Trying to return now"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "the ipad has a strong blow on the back and that was not indicated by the seller"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "This product is used and it came in a old box with fake apple charger not what it looked like in pictures"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "5/5 Would buy again."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Innovative thin design."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Horrible battery life! Goes from fully charged to dead in 5 minutes or less!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Very good"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Purchased to face time, easy to use, family had lPads,  needed another device."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great product. I was genuinely surprised because it was a refurbished item. It looked brand new and there was a factory reset. Thanks 10/10."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I would buy this again when needed! Originally bought this to replace my 3 year old's old iPad mini that got a busted screen! Have been considering buying another one for my husband and I to share!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Excellent product! No issues at all, Im actually writing this review on the very same iPad."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "i am very happy with my ipad"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Product delivered when expected, in pristine condition. This ipad appears like new with no blemishes. Arrived with 50%+ charge and set up was quick and easy. Updated to IOS 11.4 with no issues. Product came with a charger and cord that work fine. I'll update this later if there are problems with holding a charge, etc. but everything appears as new except that it came in generic packaging but that was also as expected."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "So weird. When you look under settings it says this iPad managed by.. bizzare"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Waste of money. I've used it maybe 5 times and each time it became progressively slower. I only downloaded one app on it and it couldn't handle that."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I love my new iPad!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Sons birthday present. He purchased a drawing app. He loves it."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great little Pad. Like new."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Didn't even get to use it once. The very first day we opened it, battery goes from 100% to 30% instantly. We created an apple Id and it still doesn't let us use that ID to download anything. We were out of the country so missed the return date so we are just screwed out of our money."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Keyboard hyper sensitive.  According to Google report 1000 have been returned.  Should have been inspected before sending out.  Obviously wanted.  Waiting on my refund.  Product shipped back yesterday."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Its good!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "showed up and was in perfect condition it only lacked the shrink wrap and brand new apple product smell."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Product irks fine, and it arrived when they said it would."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great product"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Do not buy this product. If you have any problem with it, the seller will not help you. Apple will not help you with it. They carry no records of the purchase to support a problem with Apple."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Everything works great and my son loves it."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Perfect.  Affordable.  Bought it for hubby so I could have mine back."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Exactly as discribed."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Item didn't work. Returning"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "This is a good product so far all that I thought it would be.  No visible damage and set to new user"}
{"rating": 3.0, "product_id": "B00HWMPKJK", "review": "As a windows/droid guy since 1982, this takes getting used to.  Furthermore, Siri and voice-to-text are stupid in comparison to Droid.  My Droid learns my vocal patterns on the fly with no training, and it's very accurate.  Voice-to-text on this thing is far more trouble than it's worth!  I've been told I can train Siri.  Too bad Siri starts off with such low capacity to understand.\nIt seems to work well enough, and I have no complaints about the quality of the refurb and condition of the product.  Very happy with that part."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Battery did not hold a charge!!  100% lasted maybe 15 minutes at best!!!!!!!!!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Can't complaint. It came spotless so much so it looked brand new, even the screen looked retina!. I got this to be used with a MEVO camera to live Stream our Church services. It works perfect! Battery lasts forever (with WIFI and Bluetooth on). Before this I had problems with the MEVO working  with two Android tablets(had to return both) switching to iPad has been wonderful and it works seamless. Will recommend."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Good"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "VERY DISAPPOINTED AND DISGRUNTLED!!!!!!!!!!!!"}
{"rating": 3.0, "product_id": "B00HWMPKJK", "review": "The charger it came with is junk. Have tried a few fast chargers on it and they take almost 24 hours to fully charge it."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Good product but very poor packaging."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great ipad, i received it like it was almost new, hardly any scratches on it. So far everything is working, thank you"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Works good and the finish is ok"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Battery could be better"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "This ipad gave trouble charging from day one.  For months Now it only charges if it is turmed off. And then it never reached 100% even when left overnight."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great clean like new product excellent price"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Works great!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "iPad came in great condition! Definitely ordering another one soon."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Thank you!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Got this for my son, 9yro. Wish I would have gotten it for myself, instead. Great price, could fit all my music and the picture is HD. Very happy."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I bought this refurbished iPad to be able to give a good gift for Christmas but still low cost. It works just like a new one. It did not come in the original box."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "very slow- didn't open until may 10th and now I cannot return item. horrible"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Absolutely NOT! it won't power up. I called three times .family business and all. Received no call back. I hate to make a bad review but that is the way of it.\nReturning. Thank heavens for Amazons easy return process."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Screen has a deep scratch at the top.  The tablet would not charge above 80%.  The only good thing was it came in several days."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "This is the perfect size. I've been looking for one like this for awhile."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "very pleased"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Bought this for my kid for Xmas. It seemed to be ok in for the first couple months then it started locking up and restarting at random times. My kid was frustrated and gave up. My guess is the screen was replaced with a non Apple screen because the video will freeze but sound continues on for a bit then it shuts down?"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Just what I wanted in the time they said it would come\nThanks Mem"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I like the size and accessibility, great product and price."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Works great"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "The iPad came with no cosmetic damage and a new apple lightning charging cable. When I turned it on, there was a full charge and the device immediately updated to iOS 11.3.1. I was able to activate with my iPhone and restore from iCloud without any issues. The whole process took about a half an hour, but when it was completed, it was like I had a brand new iPad. Very satisfied with this purchase."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Died 2 months after ordering it. Doesn't turn on. Apple indicated it had aftermarket parts and would cost $300 to repair. Don't buy, your better off purchasing brand new."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Did not charge out of the box"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Refurbished but good as new!"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Arrived in time for Mothers Day looks brand new so far works great."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Had to buy a new iPad for a trip and chose to buy it here. We have had it for a few months and we have not had a single issue."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "I purchased 3 iPads 6 months ago and only 2 are still working at this point. Cannot find any warranty information or how to contact the seller."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Good product , no problems"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I was hesitant to buy a refurbished IPad, but the product is perfect. Exactly as advertised. You would never know it was used.  Im very happy with the purchase."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Just opened it today as it was a Mothers Day gift. So far Im loving it. Thank you."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I was very skeptical about purchasing a second hand iPad but I am SO glad I did. Ive had it for several months and have not had one problem with it. I would purchase one again"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "The computer is fine, but apparently the power supply is not. It will intermittently charge. I had the same problem with an iPad I bought from a different company."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "THANK YOU!!  Perfect condition and perfect quality"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Came in white box. Charger and cable packaged with it. Excellent quality except one very small minor defect on screen.  You don't notice it until you apply screen protector included. Had to remove protector because of bubble at defect. Not worried. iPad charged fully and updated to latest iOS. Works really well. Highly recommend this supplier. Havent fully tested all hardware features yet will update when completed."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Just received and I am super pleased so far! Works great and look new."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I got this iPad for work and it was half charged and it looks like no one had used it at all. I was happy that it was delivered safe and the packaging kept the iPad safe too. Right now I am using the iPad to write the review."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "What I expected. Works good."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "I always hope to have the luck of purchasing something refurbished, but I guess not this time. Very excited when received but when its on, it immediately disappointed me with that scratch-look-alike on the screen, first I thought it was a crack on the screen, but no its not! Its the inside! All I could say is, its just a little bit and not a big dark spot covered. Sigh just sigh....."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Works great and use for a purpose"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "bought this for my son, works fine."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "I am pleased with the pad  but there was no ear p;ugs or manual with it"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "When it arrived I called Apple to purchase an Apple care warranty. Apple advised that this IPAD was so old that they would not allow a warrantee on it . SOOOOO it's being returned !"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I was initially worried about getting a refurbished tablet....but with the return policy option I decided to give it a try. It came in perfect condition and my son is not gentle with it, but it hasn't had a single issue so far! Highly recommend!"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "ok"}
{"rating": 2.0, "product_id": "B00HWMPKJK", "review": "had this for a couple months now . and within the entire second month ive had problems with it charging and glitching me out of the apps i use . i ordered a protection plan which doesnt cover it for another two or three years, so they told me to contact Apple CS about the issues and no one has been able to help . they say the problem was done by me or i just don't get a hold of someone ."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Love my ipad"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "The tablet never turn on, when conect the charger does not turn up the battery. What i have to do?"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "I am highly offended and appalled by the below poor customer service provided by this \"company\"!\nI've had my iPad for 85 days and it stopped working! I called the customer service number given all day yesterday and no one answered the phone! NO ONE ANSWERED THE PHONE DURING 8 HOURS OF BUSINESS! I've NEVER experienced anything like this. My iPad is used strictly for business and I am scrambling to purchase another! I am looking at over $200 worth of junk! This company does NOT deserve stars!"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "For a refurbished iPad it is in very good condition. I like it so far."}
{"rating": 3.0, "product_id": "B00HWMPKJK", "review": "It freezes up sometimes, and Ive had it about a month. I have to hold down the on/off switch and turn it off and then turn it on again. I hope this doesnt mean its not going to last long."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Good value for the money."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Didnt work, had scratches on the screen"}
{"rating": 3.0, "product_id": "B00HWMPKJK", "review": "Bought 2 both have mute icon showing up on the middle of the screen??\nCant get it off"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "IT'S AWESOME!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "The ipad was delivered quickly and looks new. It works just fine and was all that was promised.  It was a little pricey but seems worth it so far."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Ipad was in great condition as stated. There was no noticeable marks or blemishes."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "It does not hold charge at all.  I need to get this sent back so you can fix it. Providing its still under warranty"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "D"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I love my new iPad Air"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "So far this iPad has been exceptional."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Very disappointed, would not work properly. I guess reconditioned is not for us."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Excellent refurbished product. Operates like i bought it new."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great product, Super fast shipping"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Ive been testing this refurbished iPad for about a month now! Absolutely love it! Nothing is wrong with it! Giving it a 4 stAr bc the usb charger didn't work. But overall - the product itself is wonderful! Would recommend!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Looked new! Easy set up daughter using it for classes at university instead of lugging her computer to class. Easy integration with other Apple devices."}
{"rating": 3.0, "product_id": "B00HWMPKJK", "review": "The pad came in so so condition the battery will only hold a hour charge and a few nicks on the screen"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I've ordered two iPads now and it doesn't even seem like they're refurbs.  Sure, you get an after market charger, but the iPads themselves are in pretty much brand new condition.  Definitely worth it."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "It was a gift to my niece. She really enjoying it."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "I received my shipment but received a standard IPad - not an iPad Air!!!\nNot thrilled"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Love it"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Nice iPad Air! Totally new look and feel! Easy to set up. Solid power/data cord. Charger is generic and when I hooked it up to a 'KILL AWATT' tester showed 10.7-10.9 watts (Apple's is 12 watts I understand) and .19 Amps (Apple's, 2.1 I understand). That said it still charges well (tho hot to touch). I used a stopwatch to see how long it would take it to charge 1% and it was 04:33. So do the math for a full charge to 100%. What it that, like 7 and a half hours? =]  The charge lasts a longtime. Update: Looks like 2+ hours to go from 50% to nearly full.\n\nDisplay is crystal clear and reading PDFs is tight, pictures beautiful and watching Netflix is better looking than my TV!\n\nVIP Outlet really came through for me!"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Minor scratch scratches on the screen but works fine with good battery life."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Awesome... will order another"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "The iPad was all that I expected it would be."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Works great"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I was very hesitant to buy a used ipad without inspecting it beforehand, but I was pleasantly surprised! No visible external damage at all, and it works wonderfully. This was a great buy!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Works great gave it to my wife and she uses it all the time."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I bought this for my sister as a birthday gift. I checked, and seen it was graded an A since it was refurbished I still was a little skeptical about it. I got the 2 day shipping, and it came a day early than it said so I was very excited about that. It was wrapped in the box so it wouldnt move around, and break while being shipped. When I actually looked at it its honestly hard for me to believe it wasn't brand new. I noticed a place that looked like the metal on the back was chipped, but I only noticed it because I was hardcore looking, and its super small. I thought it was fuzz from a distance. Charged good, and everything has set up, and works. Im very pleased with my purchase, and I feel I definitely got what I paid for and then some!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Awesome for a certified refurbished item! I was very impressed."}
{"rating": 3.0, "product_id": "B00HWMPKJK", "review": "No earphones is my only issue"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I had never purchased refurbished before but needed a better tablet option for my 6 year old twins. These came in perfect condition and work just fine!  We are thrilled with our purchase!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "The IPad was as described.  I was replacing an IPad 2nd generation."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "It was exactly as described and like new. My son is one happy 13-year old!  The low price was fantastic!!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Bought refurbished. Received it,and was blown away. Unit had No signs of wear,in fact screen looked new,without slightest marks. Battery charge times were normal,as were battery life. Even came with a simple clear protector case. Very happy with seller( you guys rock!)."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Got this for my son, then he changed his mind. Had to return but looked great to me?"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "It seems each new OS update impacts the performance of iPads if you don't have the latest model. Battery life is going down hill quickly. Full charge to 10% while online happens in about three hours, no streaming at all too."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Bought this a few months ago. Its good as new and Ive experienced no problems at all! Very impressed"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "It was great! Until two months ago when the battery started dying. I was in denial, but I had to face the facts when it went from 100% to 0% in 30 minutes."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "A quality product, looks, operates and functions like brand new! I couldn't be more happier!"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Works like new no scratches or dents nicely packaged in original box...the only thing is the battery is bad only holds a charge for 15 min .. it will coat 89.00 to replace it"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I liked the product."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "The delivery was fantastic! Right on time!. It works almost perfectly but sometimes I have problems with the screen rotation."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "No difference from brand new"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "This iPad works great. Looks brand new."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Yes it great"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Looks new and works well"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I was kind of surprised at how nice this IPad Air was. For the price I thought Id get what would look and work like a second hand iPad. This looks and works like new. Setting it up was a breeze, connected with my iPhone and set up automatically. No issues at all. Im very happy with my purchase."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Junk ! Right out of the box ! F****** junk !\nTurn it on and it turns sound off every time ! Junk !!!"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Refurbished rubbish"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "The iPad I purchased was exactly as described. It was in pristine condition and ready to transfer my data from my old ipad to the new one.  The new iPad was in perfect shape without a mark anywhere."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "So far, so good. My daughter loves her Christmas gift."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "It is very light and easy to carry around"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "iPad arrived quickly and was just as described."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "horrible a garbage, its load lasts 30 minutes so to use it has to have 100% charge and still have the connected"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "DONT BUY THIS IT WAS USED FOR education and is set up this easy it's a working scam"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "very happy with product..excellent delivery also."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Garbage"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Works as expected.my wife daily used.video graphics amazing"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Wow!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Just like new! Im very happy with it. No complaints."}
{"rating": 3.0, "product_id": "B00HWMPKJK", "review": "Often, if using for a while, the entire page will disapear and I have to go back to the beginning. Especially frustrating when shopping as when I get back, the cart items are gone and I start all over again...I use it mostly for games"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Sent a defective IPad. Cuts off randomly with 100% battery then says it needs to be charged. Very upset."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Excellent condition my cousin loves it"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "nice"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "It works fine but has  aesthetik damage on the back of it. And now its not charging smdh"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Love it got it for my son and it is perfect"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "This is the most stupid purchase I've made"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "God product, it was in perfect conditions"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "working great so far"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Ipad looks brand new with no scratches or dents, and came with a charger. No complains here!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Refurbished IPad Air is working well after one week. Great for the grandkids. As hoped and expected."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "There came a insert with the IPad asking for an honest review. So tha'st what I will give!\n1) It came on date was given. Great delivery and boxing! (Box was white, not the apple box itself)\n2) Opened the box and the IPad had a foam protector over the screen and well tucked into cardboard inlay. Removed and found no scratches or marks on screen or unit itself.\n3) Charger was there and nothing visually wrong with it. Matched with IPad perfectly.\n4) I took out and pushed the power button and it started up with 45% power on it, which was cool. I was able to use my IPhone 5s  to link up to it right away!\n5) Following the on screen directions it walked me threw the whole setup process and had no problem at all. Kept my IPhone close by as certain steps it helps to have it there, since it refers back to the phone for a reply at times.\n6) I added my apps no problems and was really pleased with how clear the screen was and the speed it has for doing things. Even viewing u-tube on it was a breeze for it. Installed my screen protector (Tempered Glass for IPad Air 9.7\" by supershieldz) and my (Jetech IPad Air Case Wake Feature Black)\n7) I am charging this IPad right now and am having no problem with the charger or tablet. Everything working as it should.\n\nI have read the reviews before buying this myself, because I always value what you guys say about a product. And it does very much influence me in my purchases. I saw there were problems as well as good experiences, and looked like it was worth the try weighing everything out.\n\nMy Personal and very honest opinion to anyone looking to get this, I am very happy with my whole purchase, and cannot see anything refurbished about this although it is. It appears new and works as new."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Bought for my wife-not a apple fan myself but after got it set up she loves it. Can't tell from new. Good price. Just what we wanted!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Arrived timely and was just as described."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Looks new works great"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "It was like new. In fact brand new. NO signs of wear or use what so ever. Works great and I haven't had a single issue."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "We work at a daycare and have acquired the Hi Mama software for our staff"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Product came sooner than we expected and like new condition. Looks brand new and works perfectly. No complaints"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Awesome ipad with this price. I received the IPAD AIR quickly. The unit was in very good condition. We are very satisfy for this  refurbished unit ."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Refurbished iPad came with a defective Home button that is difficult to get to respond. You have to push it hard to get it to respond."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Completely dissatisfied. Not even 6 months in and the battery goes on the iPad. Even better, when I purchased the iPad the warranty said it was 1 year. Now their page says it's only 90 days.  Very unhappy with my money down the drain."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Tablet did not hold charge at all"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Bought it as a gift and the recipient was thrilled with it."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Clean and scratchless."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I am still learning about it.  I like most things about it."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "There is nothing I liked bout the air ipad first it didn't come with any power cord or charging cord."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Didn't work out the box. Wouldn't charge. Nothing. Won't buy from them again."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "No problems"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Works like new one"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I bought Certified Refurbished IPad and couldn't be happier that I got for only $214.99.\nIt looks brand new with only tiny scratch on the back. After charging over 12 hours, IPad is ready to be used. I got the charger as well in the box."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "The product is excelent! Great!"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "RETURN!!!!! We cant even get it to turn on. What the heck?! iPad came in a small bubble wrap sleeve in a box. Not the original safe box. And came without original charger. None of that matters because it won't even run."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "The product works really well so far but as it was refurbished there are some minor scratches here and there on the surface.  It's not a big deal for me given I need it for commercial use but it's worth noting."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "At this point, I'm assuming that the refurbishment must have been a screen replacement or an internal hardware failure because this iPad looks basically brand new. Not a dent or scratchon it. Works perfectly as well. Typically, buying refurbished items can be a coin toss, but in this case it was well worth the risk. Great buy!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "works good and looked new when it came couldn't have asked for more"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Very happy with this purchase. Its perfect for what I need."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "so far, it is working as it should.  I've had it about 5 weeks."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Came as described. Would DEF recommend as it's a HUGE money saver purchasing refurbished anything. Like new and works beautifully. Happy customer!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Love it, would recommend!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Amazing!!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Very nice came in box with charger . Almost brand new looking my boyfriend loved it for his birthday!"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Hello! The product seems fine, but I have not been able to log in because it is asking me for a 4 digit password that I do not have. I may need further clarifications and instructions as this is the first apple product that I own and I am honestrly not familiar with the technology."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "the iPad Air was in good shape works great no issues came with a protective screen and a protective case"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great purchase!!  Would recommend"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Very good"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Love my refurbished Apple iPad Air.  Work at this moment in time GREAT. !!! Hope I didn't jink its."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Good purchase"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "My son loves it and it works just like new!!\n\nAt the beginning it was kinda slow to turn on and do the iCloud information. -.-"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I love my tablet ! This was an amazing deal and a great birthday present for myself. No issues no malfunctions."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "EXCELLENTTTTTTTTT !!!!!!"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "When opening the package, the screen was cracked which was very upsetting. Then, I had to send back hopefully the second time around the screen will be a great condition."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Excelente!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Aside from never using crApple products this purchase for an employee was a good! Quick service, fast delivery. Definitely will buy another when I need it, well, when someone else does."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great for the price and came in good condition. Very pleased with seller and product"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "I di not receive the liste product, instead, i recieved a como ipad. New are of this vendo."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Did not charge correctly."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "This Ipad worked just like a new one and saved my money .  Definitely recommend this!!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Not applicable"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Was concerned about a refurbished ipad but it works great and was in perfect condition"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "the battery didn't work. It had 100%battery and in 10 min it goes to 0. I tried another charge and the same. Couldn't use it. Worst buy. It was refurbished."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "This iPad works great! Works perfectly with no scratches on the screen or on the back."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "The iPad worked flawlessly, ass long as I kept making sure it was charged!\n\nCons?\n\nThe battery died at like 59%"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Came with a charger that works perfectly and the iPad came in pretty good condition there's tiny scratches on the edges but Idc the screen is perfect and the battery lasts forever Tip: (DO NOT DOWNLOAD IOS11 APPLE PURPOSELY MADE IT SO THE IPAD AIR IS SLOWER SO THEY MAKE YOU BUY A NEW ONE) I'm pretty happy with this device so far hopefully it stays like that :)"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great iPad... works as good as a new one. We have had no issues with it so far and it is used everyday."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great machine, my first iPad, Hard to navigate to location of IPad model number, etc."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Fantastic, nothing wrong with it"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Purchased because my son broke his last 2. He uses them as a talking device. (ASD Nonverbal) If it came in a Apple iPad packaging, I would have thought I just purchased a brand new iPad. It's flawless, keeps charge all day, fast, and easy to use. Got the life proof case this time because the otter box did not help my other devices at all. So far so good! Glad I took this leap of faith!"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "I did not receive an iPad air. I received the iPad 2."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Good to see that most people liked their tablets. Mine was a no go. The product was physically rough on the edges. It had obviously been dropped more than once. I suspect the screen was replaced because it was perfect. Operations were unstable. It would start apps and switched app pages with no input. I suspect there was a defect in the ROM memory because the operating system required very frequent rebooting. After trying to work with it for a few days, I returned it."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Works 100% smoothly. And cosmetically looks great too! Havent even noticed a scratch . I am very satisfied. Thanks so much (:"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Reconditioned\nLooks and works like new"}
{"rating": 3.0, "product_id": "B00HWMPKJK", "review": "Ipad itself was good and that's what's most important. However it's a little annoying that I received aftermarket charger and cord. The \"surgit\" cord that came with it stopped working for any apple product that it was plugged into after 2 weeks. I'm not going to send everything back just because of the cord, so of course I'll have to order another cord that works."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Was a bit worried due to some of the negative reviews I read, but I was worried for no reason. Looks brand new. Not a scratch on it and runs perfectly. Will definitely recommend this seller!"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "iPad says its at 100% and its dies"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Perfect condition! Perfect for what I need it for which is fairly light use (photos/videos)"}
{"rating": 2.0, "product_id": "B00HWMPKJK", "review": "The iPad itself was like-new, no scratches on the screen and clean. There were a few small scratches on the back of the iPad, but not anything to complain about.\nSomething to know when ordering this iPad, it does not come with an apple box (at least mine didnt.) It come delivered in a generic brown box with minimal bubble wrap inside.\nThe product also includes an off-brand charging cable and wall adapter. Its good that it comes with it.\nAll in all, I am happy with my purchase and the device is working perfectly. I hope it continues to work well into the future.\n***Update***\nAfter a week of use the iPad started shutting itself off and wouldn't turn on.  Tried updating and factory resetting, but nothing is fixing the problem so I am returning.  I checked online and saw that other people are having this problem as well with this version of iPad.  Shame too, I wanted to keep this iPad because its exterior's condition was perfect."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Shipped with bad Battery, battery would not hold a charge and would cut off when it said 50% battery remaining. It was in great shape and look new other then the battery issue. Sent it back waiting for a refund."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Product was delivered and doesn't even hold a charge or even turn on when it is plugged in.  I highly doubt they even tested the product as they said they did."}
{"rating": 2.0, "product_id": "B00HWMPKJK", "review": "Poor performance - slow loading and web pages loading errors.  Sure like to get a replacement, but just passes item return window."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Okay. I just received this item today. I really needed a new iPad but just did not want to shell out $300 for one. This one had a great price point and wasn't too old. I had an iPad 2, so this was an upgrade. I open the box expecting an Apple box, but was surprised to see the iPad in the box WITH NO PROTECTION!!!!!! The iPad was in a little plastic sleeve just loose in a large box. There was also an Apple factory charger. I was so surprised that there were no bubbles or peanuts in the box to protect it. If someone threw the box hard enough, this iPad would have been toast. When I got the iPad out, it was already turned on and it was on 72%. I was really afraid that the iPad would be damaged, but this iPad is in immaculate condition. There's not one scratch on it and it looks brand new. The charger looked used though, but that's not a big deal to me. I immediately put it into a Lifeproof Fre I purchased for it and it fit nicely. It was easy to set up and didn't have Any old info on it, which I was afraid of because of other reviews saying their iPads were still connected to the previous owner. This iPad is essentially brand new in both looks and speed. I can't rate the battery yet since I've just got it today, but I will update on it. I got the space gray IPad Air for reference. I was disappointed that this isn't an Apple certified refurbished, but I can't complain because it's in great condition and works fine. I'm just weary of what the seller advertised that it'd Apple certified. Apple wouldn't send an iPad with no padding across the US. They are lucky it didn't break!\n\nUPDATE: 02/28/18\niPad is still in great condition. No complaints about battery or screen. I did download the newest update to the iPad because some apps wouldn't work without it. The update did NOT make the iPad slow down at all. I last charged my iPad on Friday 02/23/18 and with minimal use I still have not charged it. It is at 60% and my brightness is pretty high. This battery was in perfect condition and my iPad really works like it was brand new. So glad I purchased this! I was weary due to the bad reviews, but this saved me $200!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Awesome product in perfect cosmetic condition considering this was a refurbished item.\nHave been using for few days, so far all looks great!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I've just began to use my Ipad Air. So far it meets my expectations and beyond. I received it on time and in good order. I have no complaints."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I've had mine for over a month now and haven't had any problems yet. I'm very hopeful that this will be as if I bought it brand new from a store and at this point, I don't have any reason to believe it won't be like that. If you've nervous about buying refurbished like I am, then get the 2 or 3 year warranties. It's not that much and you won't regret it."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "After update iPad stopped working"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great buy"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "When i got the ipad it didn't hold charge."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Very unhappy with my purchase. Fully charged, set up and tested. Everything was fine for about 4 hours of use then the I-Pad crashed. Stuck in voice mode, Wi-Fi off, can't get past log in screen. Numerous attempts to VIP Outlet with NO RESPONSE."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Had to return.  Ordered iPad Air and received mini.  Box marked correctly but item inside was mini."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Did not work. Had to return it"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "iPad has been lightly used and is already not accepting a charge! So disappointed! Its only been 6 months!!"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Received the IPAD Air  in good condition  looks new also  Really happy with the decision to buy the Air\nNo issues so far  and works fast as expected"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Everything is good."}
{"rating": 2.0, "product_id": "B00HWMPKJK", "review": "Takes FOREVER to charge"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "It is all it was advertised to be!!  I am happy with it!!!!!!!!!!!"}
{"rating": 3.0, "product_id": "B00HWMPKJK", "review": "not come with iPad charger"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Got this for my daughter for her birthday. She asked for an \"iPad (old but not super old)\". I did some looking at different model years, and this felt like a sweet spot, value-wise. She loves it."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I ordered an iPad from another seller and it was absolutely awful. I sent it back and ordered this one expecting the worst. But when it came in, it literally looked brand new. No scratches, no dings, nothing wrong with it at all. Set it up in 5 minutes and began doing my thing. I'm going to be ordering three more for the rest of my family. Amazing product"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Read the reviews and bought a refurbished iPad for my wife for Christmas to replace old iPad.  So far there are no problems and she loves it!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great product. Looks New!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Very satisfied."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Came fast. Could not tell that it was refurbished. Works as if brand new."}
{"rating": 2.0, "product_id": "B00HWMPKJK", "review": "Ipad came in with counterfeit wall charger and adapter that doesnt work. Home button getting stuck."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "2 years use, still works perfectly."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Regardless of the reviews high and low I purchase this Apple iPad Air it arrived fast and was in great condition and works properly great thanks"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Exactly what as expected. Had an issue with the cord but the seller addressed it quickly and is handling it. Thank you!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Very good condition, 1 minor scratch on front of screen but barely noticeable, works perfectly."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I was nervous about the condition this would arrive in due to some of the negative reviews. However, I am happy to report that I received a beautiful, fully functioning device in essentially perfect condition. No visible scratches or dings. It didn't have the original Apple packaging, but in almost every other way it is like new at a fraction of the cost of a new device. A great buy!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Looks brand new! Works great!! I loveeeeeeee it!!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "NO issues at all sine it was given as a gift for Xmas"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Mostly like it and seems like it will do the job. (Lesson plans for my classroom). However, some of the internet function is not working quite right and I may need to make an extra trip to the Apple store to figure it out."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "No issues."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I go this to replace my husband's iPad that seems to be on the brink of a breakdown! He loves it! Bigger than his other one."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "bought as a gift - excellent price and so far no issues at all."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "The cost was primarily the reason I bought this item.  I was a little wary at first of purchasing a certified refurbished product, especially because others had stated theirs' had arrived in unusable condition.  However, I decided that it was worth a try, especially because I have prime 2 day shipping, and if it didn't work, I would only have to wait another few days for a replacement.  When the item arrived, I was at first disappointed to see that there was some backlight screen damage; not enough to make it unusable, but it is noticeable.  After some use though, I realized that I hardly even noticed it, because it only shows when the screen is white and it's toward the top.  My guess is that the iPad was dropped, and the screen was repaired, but the backlight wasn't.  Not a huge deal, it still runs fine for being a few years old.  Overall, I've been pleasantly surprised with its performance over the past couple days, using it for mainly streaming and browsing.  If you are looking for an iPad Air in perfect condition, pay $300+ for it, but this is a great product for the price."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Not bad for a refurbished item. No major dings or dents."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great IPad!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Fast delivery, well packaged.\nNot a scratch, dent....it was perfect.\nThis iPad is exactly as was described, and am extremely pleased. I also bought the warranty."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I bought this as a dedicated iPad for recipes.  It arrived in great shape and works perfectly -- looks new.  I also purchased a stand so it would not be down on the kitchen counter (where spills happen!).  It has made cooking much easier, and was not very expensive.  Very happy with this purchase and would recommend it to anyone, especially those who want to get rid of a shelf of cookbooks."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Does it's job. I haven't had a chance to fool with it very much yet."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Works great."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I bought two both products looked perfect. 2 weeks in no issues. Definitely would return to buy another item from seller if need be some day."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "This is a great iPad Air. It came with the box and the iPad looks new and works perfectly. Great seller! I originally bought a mini but my 90 year old Mom said it was too small. So I returned it and got this instead. No problems so far"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great IPad, and feels like new. Just what I needed. :)"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Perfect condition\nWorks great"}
{"rating": 3.0, "product_id": "B00HWMPKJK", "review": "This products runs slower than a brand new iPad, which may be expected of a refurbished product. It is evident that the screen has been replaced and can be somewhat difficult to use at times as the responsiveness is a bit off. Other than that, the product works fine for what I plan to use it for."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "A great IPad for the casual user, one who does not download or save a lot of information"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Very happy with this purchase was like new!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Hello\nI just say sank you very  much, everything was perfect.\n\nThe iPad is ok give us good experience\n\nRegards"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "I got the iPad and it will not even take a charge. So it does not work."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "I was going back and forth in my mind whether or not to buy a \"certified refurbished\" iPad, instead of buying a new $1,000 ipad from Apple.  I ordered this one, which arrived with 22% charge on the batteries. It died twice while setting it up.  Finally, i just charged it for an hour and got it to 76%. After 10 minutes of watching Vice News on my HBO App, it died again.  I really really really wish I had just bought a new one.  Used electronics? really?  BAD IDEA!"}
{"rating": 2.0, "product_id": "B00HWMPKJK", "review": "I bought this iPad to play an online game. Thats all Ive added to it. Its slow loading and gets hot after playing the game for about a half hour."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Works great! Havent had any issues with the any of its functions. I will be back for another one next month."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "So far so good. It looks brand new and runs like it is new."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Wife uses every day loves it."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "We have had nothing but problems with this ipad.  It freezes up and has to be reset weekly.  Now that is not working.  I restored it to its original settlings a month ago and it worked for a while, but now it won't work at all.  Took it to the Apple store and they couldn't fix it.  I am very unhappy with this purchase."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Very nice quality, I would never know it was a refurbished product, fast shipping"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "This was a great find. Wonderful quality. I am very happy with this purchase."}
{"rating": 2.0, "product_id": "B00HWMPKJK", "review": "This worked great for the first few months and then the battery has started going bad and it won't even charge while using it now."}
{"rating": 2.0, "product_id": "B00HWMPKJK", "review": "This was purchased as a Christmas gift for my husband.  I am very disappointed in this refurbished iPad.  As long as you don't need Wifi he thinkis its great, but the Wifi doesn't work properly.  If you are not 5 ft from a router, it will not connect.  We have tried various firmware and software updates and tips, but nothing works.  It has to be a problem with the hardware which is probably why this unit was returned in the first place.  Very unfortunate, we have normally had good luck with Apple products."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Works well and looks like a new one."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "IPad didn't include headphones with it, but otherwise a great purchase. My daughter loves her birthday gift."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I love all of it"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "My daughter loved it and was so supposed! Thank you for being honest, reliable and having it shipped with no damages!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Just what I wanted .Was a little Leary of buying a refurbished iPad but that fear is gone. Never owned an apple before what a cool toy cant put it down. For the mone you cant go wrong. Thanks Amazon"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Very happy with the product."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I never had an Apple product before and I love the Apple Ipad Air. I'm thinking about getting the Apple Ipad Pro next."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Excellent condition and worked like expected."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Completely satisfied with my purchase. Product arrived promptly, was in excellent shape, and works like new."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "It's not charging any more."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "My mom loves this iPad! The battery doesnt last very long but I got her a long charging cord so its working out nicely!"}
{"rating": 3.0, "product_id": "B00HWMPKJK", "review": "Came really fast. I wish there wasn't as much visible damage as there was. But for the price I didn't complain. I bought a lifeproof case and cant see the dings now."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Sorry, but the unit was trash--lasted a bit over a month and crashed."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I would not have known it wasn't brand new!  Works and looks great."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great iPad, works very well and it arrived in great condition! I love it!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "The iPad was in new lie condition.  Perfect experience."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Working good and I received it really fast"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "I ended up buying 2 of these for my parents. Both came in good condition."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "The iPad arrived safely and looked like new.  We have had it a few months now and it generally\nworks well.  Occasionally it will freeze briefly.  I don't know whether that is due to a glitch in\nour wi-fi or a minor problem with the iPad.  So far, it \"unfreezes\" within moments to a few\nminutes.  We are happy with it.  The picture clarity is great."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "very good"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Does not stay on while on the charger... please contact me"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Absolutely perfect!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I love it!"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "It only worked for a couple of days, they it wouldn't charge or turn on. I have returned it and waiting for a exchange"}
{"rating": 2.0, "product_id": "B00HWMPKJK", "review": "Bought this and it came charged to 50%.  I wanted to get it fully charged before giving it as a gift to my daughter for her birthday.  I have had it on the charger for 6 hours and it is only up to 53%.  I even changed it over to a charger I know works just to see if it was the charger and after 6 hours I've only charged 3%.  I will be returning it which sucks as my daughter's birthday is today and now she will open her gift and have to send it back."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I love my Apple iPad Air! Everything is working great so far! I would highly recommend this product."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Excellent product !!!!"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Charging port stopped working."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Very pleased with the iPad Air.  It is just like new and in good condition.  So far no problems.  I like the refurbished items because they are like new with a cheaper price.  Can't beat that"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I was a little hesitant about buying a refurbished Ipad but I love it!  This is perfect for my needs which is pretty much online shopping, streaming TV and social media.  I looked at a few other sites but decided to purchase from Amazon since their certified resellers offer a 90 day warranty.  I have a Kindle Fire that is still going strong but wanted a larger screen and something I could sync with my Itunes.  I loved the feature that allowed me to just hold the Ipad right next to my Iphone to sync it up for the first time use."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "The work put into refurbishing this iPad Air is holding up well. So far, so good! Only 4 stars, because It has only been a month. But, I'm enjoying IOS 11 new features."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I have an iPad 2 and it is still working fine! The new is faster and holds more data 32 gb. The screen is brighter. I am on waiting on Apple to help me open old iPad. I locked myself out and are going contact me in a few days to unlock it."}
{"rating": 2.0, "product_id": "B00HWMPKJK", "review": "This ran very slow.\n\nTook a long time to download anything\n\nKept shutting off\n\nTook it to apple they said that this was an older version ??\n\nWill not buy refurbished again ."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Excelente."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "So far very happy just like new"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Exactly as described - Fast Shipping. Very Happy Customer"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "It came later than expected. Didnt meet expectations"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Love it"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Very nice, could use better instructions on downloading to square"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Just got the refurbished iPad.  Looks great, works great so far but they aren't kidding about the generic cords.  The charger cord was not even supported by the iPad. Got not supported messages, not charging icon and really slow charge,  Correct cord solved all issues."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Nice machine with no dents or scratches. It was ready to set up without any problems. Well packaged with Apple certified labelling."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "just as described , fast shipping"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Its an iPad. Hard for me to keep up with the different models and their capabilities, but Ive had no issues with this one. I was concerned since it was refurbished, but he performs like new."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Good buy from a third party vendor. priced exactly where it needs to be."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Wife was happy with the larger screen and works like new at half the cost!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Very nice,  clean"}
{"rating": 3.0, "product_id": "B00HWMPKJK", "review": "A bit beat up, but works good"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Im writing this review on the iPad I purchased. It came exactly as advertised and is a great product!"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "A lot different from a laptop. Covered"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Great price on a great item. quick purchase and item was as advertised"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Dont buy .... seller will not back their product..."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Dont buy from these idiots. Ordered a 128 gig iPad and received a 16 gig iPad. Obviously they have employees who cannot read or are clearly inept. Not what you want when you pay over $400 and expect a comparable product. Just go to a store."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "It worked out perfect for my 6 year old"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "The shipment was a day late due to the weather, but the company kept me informed the whole time and I never had to wonder where my Ipad was or when it would arrive. It was packaged very good and arrived in great condition. So far, I am loving it. It's my first experience with a tablet and I am learning as I go. It's very user friendly and when I need help, I have my children I can call on to help me! It is a reconditioned Ipad, but seems just like new. I love it!"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Good quality so far so good."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "The product has no damage marks and works fine."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "If I could give it no stars I would. I ordered a space gray 128gb iPad Air and received a white iPad from 2012 that only has 16gb. This is ridiculous."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "My daughter loves her iPad! Great service and quality products."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Big time bummer! Shipped in OK time but the battery went from 100% to 65% in 20 minutes just scrolling through Facebook. Once it hit 65% it shut off and said the battery was completely drained."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great product but 2 days ago the screen  cracked"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "You also sent me a dead unit that won't charge, no way these are \"certified refurbished\".....complete scam"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "The refurbished I pad looked new and came with all its parts including a computer screen protector. This is the perfect way to go for kids!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I purchased this for my husband for Christmas. Looked brand new. Works well. So far, so good. ."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Works great and love it! Great price for refurbished iPad. And had great customer service from the supplier when I had an 'out of the box' issue. Helped resolve it for me and was up and running in no time."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "All was as promised. Thank you"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Easy to set up and use. Very easy to configure for my granddaughter."}
{"rating": 3.0, "product_id": "B00HWMPKJK", "review": "Works alright. Took forever and a day to get up and running so use discretion when buying"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "My IPad came and it is so perfect.\nWas impressed with both the speedy delivery and the packaging .\nHave used it daily and it exceeded my expectations."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "After 6 months, the ipad simply stopped charging. This is the second refurbished iPad we ordered from Amazon, the first had a power off glitch, which Amazon replaced immediately. The ipad won't respond to the charging cord or the charging stand that we have. It's really unfortunate that we'll have to replace it so quickly."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Works great!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Fast delivery for a quality product that is just what I need."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "I love my new iPad Air.  It works great, was easy to set up.  I use it every day.\n\nI would have given 5 stars except the charger included with it was non-functional."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "These guys are great highly recommend them."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Nice"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Very disappointed that the battery would never hold a charge more than a couple of hours. Bought as gift for daughter who never used it due to battery life issue"}
{"rating": 2.0, "product_id": "B00HWMPKJK", "review": "The I pad seems to be good BUT no lightning cord instead I received some kind of generic cord that doesn't even work\nHave called have emailed no answer guess that I will try Amazon for a proper cord that works"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Speaks in a different language and their is no way to alter it. Will be sending it back in"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "This came in just like brand new not\nA  scratch on it  I was super happy\nWith it"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Do not buy these iPads. Very poor condition. Battery dies within 5 min. One charger did not work at all. iPads have been nothing but problems since they were opened. Would never purchase from this seller again. Bought two iPads for my sons for Christmas. Neither worked appropriately. Spent over $500 for nothing."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Looks like new, Im impressed!"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Good item a little dent on the side but nothing i would complain about. Happy with what i have."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Ipad works great!"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Bought this mid-Sept and it only lasts about 30mins before needin another charge."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "works well-do you recommend cases and tempered glass covers for this I Pad?"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Shipped quickly, arrived in good condition. Performance is good with absolutely no issues."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Love my iPad Air, works wonderful, looks just like new,"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Got the device in time.  However it would not hold a charge for more than 15 minutes.  After checking several times to confirm it is the poor battery and not anything else, I have contacted Amazon and now getting it returned.  Thought this was a good price, but it was just too good to be true."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "I wish I could give it zero stars! This item is not refurbished. It is someones old iPad that hasn't even been cleaned. Fingerprints and grease stains galore and it smelled of cigarette smoke and had some sort of nasty goo packed into the speaker, charger, and mic holes. A nasty dirty charger that doesnt even meet Apples spec to charge the iPad was included. Complete fail Amazon. Sell products like this to the public and watch your business suffer. For an an additional $30, you can buy the later MP2F2LL/A model new in the box."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I love it! Im actually shocked at how beautiful and brand new it looks!! It works perfectly and the thing is huge!! And I got it earlier than I expected. Im in love with it!!  Charger looks brand new too!!"}
{"rating": 3.0, "product_id": "B00HWMPKJK", "review": "This is in very good condition and works great. Only problem is, its taking 12 hrs to full charge. Contacted the seller. They respond very good. They replaced the charging cable, still no use on time taking. But still I like this product so didn't returned."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "After reading some of the reviews here about certified, refurbished electronics, I was a bit worried. Ordered 2 of these as Christmas gifts, and both of them look and perform like brand new. I would not hesitate to order from them again."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "The one I got would not hold charge. I got it for my husband for Christmas. The night before I completely charged it and wrapped it up. Christmas morning he opened it and it was dead."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "While the iPad looks like new, the battery is in terrible shape, it shuts off at 50 percent charge and several battery testing apps rate it at 48 percent"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "This was an excellent purchase. This ipad works very well and this does not have any aesthetic detail. It is a great option if you are looking for an ipad with a very competitive price."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Lightweight and doesn't freeze up."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "This iPad has a low battery icon displayed and it will not reboot. I checked all of the online solutions for the fix to this problem but nothing works. It also had a cheap charging plug & cord... not Apple. I sent company an email, but got no timely response. Now I have to go LONGER with no iPad while I wait for a return credit, order from another company, and wait for shipment again. At very least, Amazon should provide FREE one day shipping."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "For a Certified Refurbished product, it arrived in very good packaging. It was charged and ready to go. I gave it as a present and the receiver was very happy with the Apple iPad Air."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "LOVE MY IPAD!!!!!!"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "DO NOT BUY FROM KISS ELECTRONICS. Faulty products that do not work as others have said. Shuts off after 10-30 minutes of use with a full battery."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "works perfectly, very happy,with grandsons help it was easy to set up"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "iPad came defective , charged it 3 times and within minutes it completely went off. :( upsetting"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I wish there were 10 stars because I'd click all 10, it was a gift for Christmas and she loved it, thank you!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I was worried about ordering a refurbished item but this iPad was great! My daughter is super happy with it and I am very happy I made this purchase."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I am so happy with my iPad. I got it with very good price and even though it is refurbished, it functions so well. Nothing to complain. I trust this refurbished iPad. I choose the right one. "}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "No scratches...great condition"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Like the unit. Very clean. Good value."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great product. Great seller"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Product was as advertised and earlier than promised."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Absolutely love this ipad!  Use mine everyday.  It has almost completely replaced my TV and cut my laptop use way down.  These are great!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I bought this I pad air for my daughter and her family for the holidays .\n It looks great !!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Not being a iPad person I am impressed at how well this iPad works like a new one. It might be better than new without having the usual bugs you get with new devices."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "very poor quality item for the cost, never tested and cannot use I pad will not even turn off, the buttons do not work , not a very good item for purchase for these reasons , also very poor packing and shipping issues"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Good value for the price."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Good value, prompt delivery, product was as advertised.."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I read all the reviews before making this purchase. I could see there was a small % that had problems, mostly with their battery life. This did make me a little nervous about ordering a refurbished unit. Still, I saw there were way more positive experiences and thought for the $ it was worth the small risk. Turns out I was right. My unit is perfect in every way. A couple weeks ago I had a problem- my unit would go to passcode lock after every 30 seconds forever. I tried turning passcode off, hard reset... nothing worked. Finally, in my 30 second operating window, I could get into Settings and do a Reset to Factory Settings. That solved it and my unit is perfect again. Sort of wish I would have bought a 64GB unit."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Love it"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "It's a bit outdated, but good functionality and great packaging. I have an iPhone 7 that is far more speedy, but for browsing, reading, playing the occasional game, emails, and basic functions, I could not beat this."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Works like it is brand new!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "The device has met my expectations and I have had no issues."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I love my new iPad Air it is my second one and I love that is is so my lighter then my last one!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Just awesome!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I was lucky. It was in original packaging with original accessories. It was charged and it has consistent, long battery capacity. Very pleased."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Its great"}
{"rating": 3.0, "product_id": "B00HWMPKJK", "review": "I guess I did not read the description well enough. This is really an old iPad. Took it to the apple store and they told me about it. I will read better."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Good"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Apple iPad Excellent condition.  Easy to use."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Will never buy anything thru them again. High restocking fees that are buried in the fine print!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Product exactly as advertised - would never know it was refurbished. Job well-done."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "The IPad was in excellent condition.  I returned it because I did not need another IPad."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Purchased this unit as a recertified Apple Product, meaning it has been check by Apple and made available to resell with a lower price.  The device is given a good rundown to make sure it comes to you as if new from the factory.  They make sure it works exactly as it would a brand new iPad from their store with charging block and cable.\n\nTheres nothing wrong with these devices, they all work well and they give a 90 day warranty from the day your purchase it.  So if you do find anything wrong with it they will take care of it with a replacement or your money back!  Currently using this iPad for some light gaming, email, photo editing, timelapsing, and writing this review!  If you cant afford the latest of some of their iPads, consider a recertified one that Apple has approved with these devices.  With the 90 day warranty, youd be a fool to pass up such a great offer!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I just love it."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Very happy so far with how it was shipped quickly, and doesnt seem to have any issues yet. I am giving this to one of my children for Christmas, so haven't really played with it too much. I would post pictures, but wife already has it wrapped up, Theyre gonna be so happy."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "The iPad is great. There is 1 big scratch on the back of the device, however it doesn't really bother me because I have a case on it anyway. The device is a bit slow; not sure if that's because it's an older model or what the problem there is. Going into this, you should take into consideration that this is a refurbished product, so obviously its not going to be perfect. Overall I am happy with my purchase! I also got this product within a couple of days so delivery time was awesome. I trust this seller!"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Seems to being doing well so far as best I can tell."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great product, highly recommend. Does everything I need it to do, and it looks brand new. Thank you!!!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great piece. It has minimal scratches here and there - nothing noticeable and really good for the price. Checked all the functionalities - everything works fine - its like how i would've kept the product if I brought it anew when it was released."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "It was on merely perfect condition until it needed to be charged. i purchased a new charger thinking it was the cord but it wasn't. i recieved a ipad that can't charge shop im sending it back and hopes for a better one if not then i will settle for buying one brandnew."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great product!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "It is like brand new, I love it"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Love it had for over a year no problems at all"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great value & not a single issue!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Just got it yesterday so far Im impressed very nice condition in and out and a strong battery...got it in two days very satisfied...."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Corrected review as everything working as expected."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "It was priced right and it works as good as a new one."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "As expected."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I'm giving 5 star because it looked like it was in new condition.  But for the rating of the  performance I'll leave that up to my daughter after Christmas."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I needed an Apple IPad that would except the IOS 11 upgrades, the Air was a perfect item for me. It arrived in perfect shape, like new. Thank you"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "perfect its working great"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Works like a charm , looks great at a great price ! Love ....."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Very bad experience with the iPad. The battery would not hold a charge so we sent it back. We waited over two weeks for the return on the iPad only to find out that they intentionally sent back a different iPad without telling us. When I inquired as to why a different iPad was sent to us they replied back saying that our original iPad was with them for additional testing. We have no idea if we will ever get our original iPad back. In meantime we are having problems getting the replacement iPad to activate."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Ive had it for only one hour and it keeps glitching on answer off. It powers on the right back off, battery dropped from 100% to 26 in a matter of seconds. Save your money"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Hi i recieved the iPad but it has a dent on the speaker and no head phones and I also wanted to ask why didn't it come in a apple box ."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "the ipad won't charge or turn on."}
{"rating": 3.0, "product_id": "B00HWMPKJK", "review": "Great as a stand alone product, however I only purchased it to work with the Square Register Bundle, and I can not get the square register to work with no customer support."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Just as described. Works perfectly. Hopefully stays that way."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "So I originally bought an iPad that was a reman and I loved it. Only one small problem-so did my wife. Poof! No more iPad. So it only seems fair that I should get the iPad Air for myself this time, right? Absolutely, glad you agree. Mine arrived in a plain brown box with just a charger and a warranty card. Okay. Odd but okay. Seems to be in perfect shape, no scratches or dings at all. Functions flawlessly thus far. I dig it. Gonna hide this one. Highly recommend. Thanks for reading\nUpdate: 2/13/18 just wanted to leave a quick update that after several months of daily use, everything is functioning flawlessly. I have no qualms whatsoever about purchasing another reman. product from Amazon. Very good item.\nQuestion for anyone who can help: with the iPad Air, if I try to read reviews on Amazon, it will only allow me to read the complete reviews of the first three people on each product. Doesnt happen with my iPhone 7. Is it a setting? Where? Drives me nuts. If you know, drop me an e-mail. Id really appreciate it. Thanks"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "I like it it's fast, but very smudgy"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "This was a very great deal! Would definitely recommend this to a friend only flaw is it did not come with original packaging or headphones but had a decent charger. I also noticed a small dent on the bottom of my speaker but both work just fine."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I must admit I was hesitant to buy a refurbished product. It looks like new and so far I have had no problem at all."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Love it love it love it - and it was a fabulous deal !!"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Exactly what I wanted.  Enough storage, Wi-Fi only, no data charges and uses the latest iOS. The display is very sharp and I could not find a flaw any where on the the unit. It does everything I wanted in a tablet and more, could not be happier.  Arrived very quickly."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "good"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Works like new very stisfied with it for he price even more happy with it"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Touch doesn't work sometime"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "It appears like new. Ive found no problems with this tablet. Replaced one I sold. Tried android tablet for a while. Back to Apple. Great buy. Very pleased"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "This ipad air is Certified Refurbished and works great Im very happy."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Cosmetically like new; the battery runs down faster than if it were completely new. I have to charge it about every 3 days after moderate use. On the whole, satisfactory - I expect to get a couple of years of use our of this unit."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Exactly what i wanted!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "So far so good.  Purchased this to replace my failing iPad 2 that was beginning to slow down and have other problems.  Works and appears just like new.  Couldnt be happier with the product and the money saved."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Very good purchase"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great deal"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "We are not Able to access the EIME number to connect to Verizon."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Battery isn't worth anything"}
{"rating": 3.0, "product_id": "B00HWMPKJK", "review": "Came with a junk charger"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "This iPad will not hold a charge. It is used for a business and has been super frustrating."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Very pleased with product"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great price and a great guarantee!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Love this"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Love it so far."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Bought this iPad to help me with my academic studies and it works like a charm! I just downloaded a few apps to help keep things organized and it has made a positive impact on my grades. It's also really nice that I have all of my notes right there on the iPad so I don't have to try and find a certain notebook."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "works perfect. no complaints. A+"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Awesome buy. IPad showed up looking brand new not a single mark on it. Works absolutely fantastic.  Highly recommend.  Thank you."}
{"rating": 2.0, "product_id": "B00HWMPKJK", "review": "Okay"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great deal Love it !"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I purchased this renovated iPad Air as a birthday gift for my sister.  She said it looks new, and she is enjoying using it."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "I received a high-quality iPad Air but unfortunately the battery seemed to be damaged, suddenly shutting down at a full charge."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Still going strong 2 years later..have not had any issues"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "This is a nice replacement for an older model that kept having speaker problems. Pleased."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "We received it as promptly. This refurbished ipad air looks like brand new. It has been running flawlessly. And the battery life is great."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "This is a great deal!  They delivered quickly and just as expected."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "The iPad version received is as good as new. I could not tell it was refurbished. It works great!  Thank you"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Bought this for my wife.  It works like it should and looks like new.  Happy with the purchase"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Everything works as promised.. love it acts like a bran new ipad"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Works great!"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "The tablet arrived a week earlier than advertised and was in exceptional condition.  Everything worked well, except the plug in for headphones had to be in a particular \"spot\" to function. I am informing the company and expect them to correct this situation."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Im using it now love it"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Bought this to replace an iPad mini for my kids after 4 years of having it. The iPad I received was like new and had so major signs of wear! I received original charger and charging block. I am very pleased with this purchase. I will Likly get one more :)"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "I was unable to set the iPad up and had to spend hours trying to restore it before being told my only option was to send it back. The iPad is apparently from a school system and the school system still has a lock on the iPad that could not be removed."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I was very happy with this refurbished iPad Air.  All of a sudden, I had to tap an icon that I wanted to open, then double tap to open it.  I could not scroll.  I found a fix on the internet.  Somehow I had turned on voice over, when I turned that off, the iPad works like brand new."}
{"rating": 2.0, "product_id": "B00HWMPKJK", "review": "I bought this iPad Air to run my wireless speakers. I have Airport Extreme and Airport Express already hooked up in working order. So I get this iPad Air and it won't play Airplay from the control panel! Really iPad \"AIR\" won't play Airplay! It does however play from the iTunes application, but that limits me from playing my Amazon Prime Music. I have to get the iPad \"Air 2\" to be able to play Airplay from the control panel. Apple...REALLY????? I returned this and ordered the Air 2. Everything else about this iPad seemed to be perfect. It worked nice, it looked nice. So, if you don't care about Air Play, this is a nice unit for the price. I found an iPad Air 2 (Certified Refurbished) on Amazon and thats what I replaced this one with."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Seems to be perfect, and a lot less expensive!"}
{"rating": 2.0, "product_id": "B00HWMPKJK", "review": "Unit came looking great, no signs of being used. Worked great for a day then charging issues arose. Would leave plugged in for hours with no or worse change in battery status, then would not connect with square stand. We know for sure  it is not the stand, we tried swapping ipads and stands, this unit was the common denominator with the problem."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "So far I am very happy with my tablet Ive only had it for three days but its great. It seems to work just like it should just wish it had the thumbprint reader. That wouldve been $200to the $300 more Im sure. If I have a problem with it in the future I will edit this post."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great present for sister-in-law"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Good Ipad , processor is in good performance. Everything is perfect for daily use."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Bought this as a gift for my father. Works well and considering he is 70 and not very tech savvy the ipad is a breeze for him to use!"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Within two weeks, it died.  After I downloaded the recommended IOS 11.0 update, it hasn't worked since.  It is stuck on \"connect to ITunes\", but since I don't have a computer to connect to iTunes, this purchase is useless.  This is what I get for buying refurbished."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I bought this ipad for my daughter as her birthday gift. She loves it. This ipad looks like new product, suitable for daily use."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Im very happy with my IPad !"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Sent an ipad that had display issues"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Good price. Very happy with it."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I bought this for my daughter. She just loves it and uses it all the time. Very happy camper."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Still quality product, performs great."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Good Apple iPad. The processor is fast and resolution of screen is good enough for watching."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "No problems!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Looks new and works great!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Very pleased with the iPad."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Looked new and operates perfectly!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "This I pad arrived in earlier than expected and in great shape. It looked absolutely new and works perfect. Battery life is fantastic. I am very pleased with this I Pad."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Bdndnd s"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "This iPad Air A1474 is awesome.  Why spend $700 or $800 for a brand new model, when a refurbished model works exactly the same.\nGreat purchase, works terrific."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "It works well but sometimes it discharges instead of charging."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Love the Retina Display."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "She loves it!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Excellent shipping and good condition. Came with charging cord and brick. No scratches on the screen and only a few visible scratches on the back. Buttons all work proplerly. Very fast and responsive tablet. Definitely satisfied. :)"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Item looked brand new, worked perfectly!  has a 90 day warranty as well.  I would buy from this seller again and I highly recommend."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Not completely unlocked.  when I received the Ipad and tried to set it up as a new account a configuration screen popped up from Kanawha County School District stating that configuring the ipad allows  the school to manage the ipad over the air.  It also stated that an administratror may disable features, install and remove apps, monitor and restrict internet access and remotely erase the ipad.\nI definitely didn't want someone other than me to be able to erase my ipad, so I contacted Amazon, they advised I send it back and request a refund which is what I did.  Please beware of things such as this when buying used/refurbished electronics."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "My grand dauther Loves it"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Excellent works well!"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "They sent the wrong iPad and I had to send it back but other than that it is truly a wonderful device even today, I have nexus and pixel phones, android tablets, chromebooks, even a kindle with Cyanogenmod but even an android enthusiast like myself had to get my dad an ipad because iOS is simple but also highly functional, secure, and stable."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "arrived super quick and product works great!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Flawless"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Perfect, very good product"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I love my ipad. Thank you so much. It works great. Looks and feels brand new. Very fast. Pictures are beautiful. I can now down load my photos from my Nikon 7100 using WiFi and the Same with my go pro. I bought one of these for my husband from my Apple account and I can not tell a difference. This is a real customer.\n\nupdate: I bought two more of these pads and they work great.. I have had no problems with the first one I purchased and this is why I bought two more as gifts."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Piece of junk ,, battery not charging ,, what a waist of my time"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Works great and looks brand new!"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "ipad I bought came with a pass code"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Love love my iPad. I work from my phone so this really helps my business."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Love it!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Just got this today. Was amazed it looks like new.  So far very happy"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "iPad was nice in appearance with minimum scratching."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Quick shipping, packaged well and product was just as promised!  I'd buy again and recommend with confidence."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Love it!"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Warning do not buy this item. I thought I was going to be lucky but ended up getting screwed. It was perfect at first day But then on the charger it would say it was dead. And it would die on 95%. I knew it was too good to be true."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "I would have gave this a 5 star review if they bothered to give me an iPad charging brick. Seriously what is the point of doing this, it's well known 5 volts takes super long to charge an iPad... Also I didn't come in factory box but a brown box with the lightning charger and the dreaded 5 volt brick, but I expected that... And as I took a picture for evidence, I unsurprisingly notice the brick itself was already hot trying to charge this behemoth for only 10 minutes with 1% increase in charge..."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "great"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I purchased this iPad for my 6 year old and I was amazed at how great of shape it was in. No cracks, damages, dents, NOTHING.! For it to be a refurbished iPad. Great buy hopefully months down the line it continue to work lol."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "At first, I was hesitant to purchase a certified refurbished product.  However, I am pretty much satisfied with my purchase.  The only thing I didn't like was on the back of the iPad, there was what appeared to be some dried residue of some sort of adhesive tape.  I decided to leave it on as attempting to remove it might scratch the back."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "It's working like a champ.  So glad I bought it.  Perfect for my music charts this I use with the program ForScore."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Good iPad"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "The iPad came perfect condition. Very satisfied with purchase"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Love it but it does cut off sometimes.  Loves the size"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "This is the iPad Air (first iPad Air).  For most this tablet has all the memory and speed you need.  I bought it for using as a roaming tablet on the shop floor and this is perfect for that!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "This was great for the first 90 days and as soon as the warranty was up it stopped connecting to the internet. I brought it into Apple and the diagnostic showed an issue with the WiFi chip that they can't repair. What a mistake, I should have bought this directly from Apple!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "i love it"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Works great. Charger didn't work when we got it, but they quickly sent a new one free of charge."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I have purchased, certified refurbished items, from Amazon before. This item is no different. I have never had a problem, or a reason to return any certified refurbished items. I have always been completely happy with each purchase. Each certified refurbished  item  was in the electronics category."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "It was a gift for my wife and she loves it"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Described accurately. Shipped as stated."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "This product is sturdy. I recommend"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Received my refurbished certified Apple iPad Air in beautiful condition. Sound doesn't work and even worse, the screen doesn't rotate. I spent over 4 hours working with it and speaking with apple support for 2 hours. Very disappointed."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Been using product a few days now. So far, so good! Shipped timely."}
{"rating": 3.0, "product_id": "B00HWMPKJK", "review": "It's ok I can use it for what I bought it for. Unable to upgrade it"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "looks and operates just like a new one"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Love my iPad.  2nd one.  Definitely covering this one with lifeproof"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "The IPad looks brand new and works beautifully.  Although I just received the IPad, I am very happy with the purchase."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Very disappointed the IPad isn't charging even trying a different iPad charger. The screen flickers and it gets extremely hot when charging. Hoping since it's been less than a day. We can return it. This was supposed to be my son's birthday gift. He has CP and surfered 3 strokes from open heart surgery. He loves the iPad but sadly this one isn't going to work for him"}
{"rating": 2.0, "product_id": "B00HWMPKJK", "review": "wasn't able to use due to old profiles still on ipad"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I've been well pleased so far. Ask again in five months."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Works great!!! Looks brand new"}
{"rating": 3.0, "product_id": "B00HWMPKJK", "review": "shortly after I had it the button stopped working but the tech at apple store showed me how I could use an app to put a virtual button on the screen and still use it so I can still use it with my mackie DL1608 mixer. and I had it foe a while now so I have to say I'm very happy with it."}
{"rating": 3.0, "product_id": "B00HWMPKJK", "review": "Product ok. From time to time it freezes up. And I never had that problem with the ipad 2."}
{"rating": 3.0, "product_id": "B00HWMPKJK", "review": "Looking at the physical appearance of the iPad it seems almost brand new but I've been having problems at times when I try to play music on YouTube. Initially there is absolutely no sound then it makes a buzzing vibrating sound. I can't tell what's wrong. I just keep trying different videos until the sound returns"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "So far so good. Works great, charges just fine and gets the job done. Great value for a kid to use."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "The iPad Air is working great and in excellent condition."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "very nice"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "It came in original packaging and super fast."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Works well, good buy!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Works great"}
{"rating": 3.0, "product_id": "B00HWMPKJK", "review": "Works great except that the wifi cuts out every time it goes to sleep. I didn't realize this was an issue until too late, ie after the warranty ran out. I have to reconnect to my network every time I want to use it and sometimes I have to restart completely. I asked a guy at the Apple store what could cause that and he said the wifi card probably need to be replaced."}
{"rating": 3.0, "product_id": "B00HWMPKJK", "review": "iPad had a barcode sticker on the back along with glue residue. Charger and cord were not genuine. However it's in great condition and works flawlessly."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Love having the assurance of a certified refurbished IPad. Saved almost half the cost of a new system."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Purchased this refurbished product. The iPad worked well for few months and then started randomly powering down and get a blank screen. Now it's doesn't turn on . I would stay away from this seller."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Good deal.  Works well."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "In 6 months it just completely died, worked last night woke up this AM and it's dead!!!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Very good condition"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Apparently refurbished means return, had nothing but problems with this iPad"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Looked new. Love it"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "I purchased this refurbished product four months ago.  The warranty is for three months.  The iPad worked well for 3.5 months and then started randomly powering down.  I would start working on it and after anywhere from 10 minutes to 30 minutes it shuts down and then powers back up.  There is no warning when this will happen.  I contacted the seller through Amazon and they said that the product was out of warranty.  I would stay away from this seller because the refurbished product did not hold up and the seller would not fix the problem."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Product was not unlocked but registered to St Joseph High school. I'm so disappointed."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "A great, affordable product. I've had it for two school semesters now and it works exactly like new!"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "iPad doesn't work. Was shipped with no battery life and when trying to charge it just turns on to the apple then back off again. Scam."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Love it!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "iPad was in excellent condition like new. Everything has been working and is there are no issues. It was delivered timely and I am very happy with the purchase!"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Bought Sep 9, 2016 -- completely worthless six months later. Started randomly shutting off and now won't power on."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "I bought 2 for christmas. One will not charge now. Have bought new cord and cube. It will not charge. Not asking for money back would like an exchange for another. I do all my shopping on amazon"}
{"rating": 3.0, "product_id": "B00HWMPKJK", "review": "some of the charge cables were old and low quality"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Does not work after first week company does not stand behind these."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "This has been a great product! I'm so glad I went with this one.\n\nUpdate (1year later)-- this has been so reliable and a great tablet. I have had no issues."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "VERY PLEASED WITH SERVICE AND PRODUCT! A BIT UNSURE ABOUT \"REFURBISHED\" ITEMS, BUT WITH A \"SATISFACTION\n\nVERY PLEASED WITH PROMP SERVICE! A BIT UNSURE ABOUT ORDERING \"REFURBISHED\" ITEM, BUT TRUST APPLE PRODUCTS.  WITH A GUARANTEE TO RETURN IF NOT SATISFIED, I TOOK THE LEAP!  HAPPPY WITH APPLE iPAD AIR A 1474!!"}
{"rating": 2.0, "product_id": "B00HWMPKJK", "review": "Not bad, had to reset the operating system, was not done when sent."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "This Apple iPad Air has been amazing.  it does not lock up, freeze and the speed is incredible.  We are able to have many apps on this item and everything runs smoothly."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Good is new"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Good apple product"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "A must for your I pad"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Excellent"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "The IPad is great. Beautiful in white. Working well. Had to buy new charger. However Charging slowly."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "My mother and I gave this to my father for his 75th birthday - he loves it! Super easy to set up and simply for him to use."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "works great"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Fantastic!  I ordered two of these for my kids for Christmas and they arrived in great shape. Had some minor cosmetic blemishes, but that was expected for a refurbished product. The screens were perfect. Both charged and held charge well. My kids have been using them a couple weeks now and they are working great!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "This was a refurb iPad Air purchase - greatly pleased.  It came in aftermarket boxing with an adapter and 3rd party (amazon written on it) power cable - but the Air itself is the real deal.  No blemishes at all that I could find.  All buttons work, sound works, it's fast (coming from a 2nd gen iPad that is..).\n\nIf I need another - i'd go this route again after a good experience with 2 weeks hard use logged (Battery is Solid)."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "I received the iPad in excellent condition! However, it did not come with a SIM card. I had to purchase that separately."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Really a good buy on an IPAD Air that looks and acts brand new.  I am thrilled"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Good quality, looks and operates like new.  Very satisfied"}
{"rating": 2.0, "product_id": "B00HWMPKJK", "review": "Never again will I buy a refurbished apple product. Works but has several issues with no warranty. Live and learn!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great condition except for the charger cord looks terrible but it works so it is what it is. Ipad is perfect though"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "This is the second one I purchased!  Came right away and is everything my college bound student needed in a tablet."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "What great things can I say that haven't already been said?  Fast & easy operation, razor-sharp screen, battery like nobody's business, and seamless integration with iPhone & Mac!"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "The volume control did not work. We returned it for a refund."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "What can I say. Who doesn't love an Ipad. I'm addicted!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "This is a great item and a good price!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Screen is perfect. Even the back looks new. Battery life feels like a brand new unit. Very pleased with purchase."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Very disappointed!!, Buyers beware!!\nThe iPad arrived in a fairly good state no obvious damage.\nI powered up and completed the registration on then the iPad but it would never stay on for 20 minutes after that.\nThe iPad would crash/freeze when you try to use any installed app like YouTube.\nI did a factory rest for iOS, then attempted to use only built in apps, after a few minutes, it would show white lines across the screen then stop, nothing, you would have to force restart after that.\nIf you left the iPad idle, it would still crash, with the same white lines across the screen.\nAmazon you need to do a better job at who you call Certified Refurbished branding to. I am very disappointed and will not buy any Certified Refurbished products as the product was completely worthless. This seller BREED should not be Certified.\nI have returned the product after 3 days for wasting my time."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Works great. Speedy delivery."}
{"rating": 3.0, "product_id": "B00HWMPKJK", "review": "One of these products worked great the other one flips screens without even touching it!  So needless to say I have to take my 17 year old daughters away and see if I can get it fixed!"}
{"rating": 2.0, "product_id": "B00HWMPKJK", "review": "I suggest don't buy refurbished products as they lack quality, I purchased this ipad and the camera is very bad especially front camera , lot of small dots around the picture after taking.\n\nSeriously no to this one."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Works great as square register!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "awesome."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Shipped quickly. Great quality for refurbished. If you need an iPad, but don't want to spend a fortune, this is the way to go!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Awesome"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great buy!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "great!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Works great for being reconditioned.  Loses its WiFi connection periodically but otherwise no complaints."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Bought this used IPad Air for my son's birthday. Works perfectly and he loves it. I did buy an Otter Box for it since they are not cheap. Highly recommend protecting your investment. I do like other tablets as well, but Apple products are so easy to use, especially with younger kids."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "It came sooner than what I expected, it looks brand-new and works like a brand-new iPad. I am very happy with it."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Good product"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I bought this ipad for my parents. It s been already 6 months and works perfect!"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Product started to not work on day 99 of the purchase from the third party vendor. The vendor cant do anything (or wont, who knows) even know it came with a 90 day warranty. Lesson learned. Dont buy refurbished items from third party vendors. Three months may not be enough time to see if the item works fine under extremely normal use."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Have only started it up but now used it yet because it is a gift. It looks like everything is OK- connected to my wifi with no problems."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "So far so good, no scratches or dents. It came 4 days early. Came in original Apple Packaging. The iPad was wrapped nicely in plastic, and the charger cord and box was wrapped nicely, I easily set up for the most recent IOS update (IOS 10.2). It looks like it's never been used. We'll see how things go in the next couple of months but I love it so far. Worth my money."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "<div id=\"video-block-R1XIRC36HGYEQS\" class=\"a-section a-spacing-small a-spacing-top-mini video-block\"></div><input type=\"hidden\" name=\"\" value=\"https://images-na.ssl-images-amazon.com/images/I/A1XFjR5KQYS.mp4\" class=\"video-url\"><input type=\"hidden\" name=\"\" value=\"https://images-na.ssl-images-amazon.com/images/I/91HyTjkbrDS.png\" class=\"video-slate-img-url\">&nbsp;&nbsp;Item arrived quickly but that was the end of the positives. As soon as I turned this unit on the video started glitching, which stopped so I thought maybe just a glitch at first boot, I went through the set up process and found the wifi in this unit dropped almost continuously, then once finished with the set up the screen started glitching again and then went black and would not turn on for 30 min, during which time I requested a return. Thankfully I was able to reset the device after the 30 min to remove my information during which the video glitched more. In addition to that the frame around the glass was chipped and dented and the glass looked to have been scratched by something. Very dissatisfied."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "My niece loved it and still uses it"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Sent wrong charging cord. Other than that, so far so good."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Received this ipad and the screen was cracked all the way across. Not impressed."}
{"rating": 2.0, "product_id": "B00HWMPKJK", "review": "it only work for 2 month then it didn't charge..\nbut they refund me so of the money"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "This is a great value. I was conidering a new mini but chose this instead. It showed up in three days, packaged well and wow does it look good. I would say like new for sure. Not a single ding or scratch and genuine apple charging components (in my instance, ive read of others getting knockoffs). Came with 40% charge so i could set up and play a little right out of the (generic) box. Very pleased."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "works well. like the additional storage"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great product at a great price. Just as advertised! Would highly recommend this seller."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "box was empty when I opened it"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Bought this for my 4/5 year old as a Christmas gift. Went to set everything up to get it ready for Christmas and did the update and now the screen won't rotate. Took it out to the Apple store thinking it was something with the update since it worked fine before, found out that it was a known issue since May (months before I purchased it). They have a list of issues with the Ipad I purchased. So now I have an Ipad that won't rotate and nothing to give my kid for Christmas. Guess I learned the hard way not to purchase things like this except through the actual store."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "No problems so far , work as expected !"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Works ok, Washington deliberes on time, thank you"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Product came with a giant crack in the screen."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "The original iPad lost the ability to charge, or stay charged.  This replacement gets my wife back into her Facebook account.  Now that I have two iPads, I regret only getting the 16 mb versions.  The storage fills up quickly.  I should have gotten at least 32 mb."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I bought this for my wife to replace the old Windows XP computer that kept getting slower and slower and slower. All she wanted was e-mail and Internet browsing. The iPad Air handles that and more. She loves it. Other members of my family steal it once in awhile preferring the 10\" display over the display on their iPhones."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Love the IPad and the price is great."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Very nice condition."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Awful. Worked great for three months and then the display just went on it. I can't view anything on the screen now."}
{"rating": 3.0, "product_id": "B00HWMPKJK", "review": "The unit works perfectly - can't complain about that.  But, for it being refurbished it was not what I expected.  There is a big sticker on the back of the unit, dent on the back where it say Ipad and scratches on the face.  I have attached pictures of the back of the Ipad for you to see.  This definitely shouldn't have been labeled as refurbished - but used."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "To much scratch on the back!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Bought for school and it came no scratches or anything I love it!!!!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Works flawlessly. No one knows but me it was refurbished."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Perfect! Verh happy with the quick shipping and the packaging. Fits perfect on my square stand which is what i needed it for. Thank you"}
{"rating": 3.0, "product_id": "B00HWMPKJK", "review": "Product keeps turning on and off whenever it feels like it! Really annoying when you are doing something and it just restarts on you!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Very nice very nice !!!!!"}
{"rating": 3.0, "product_id": "B00HWMPKJK", "review": "The iPad was very good but the charger burn off inmidiatly when I connect the charger ti the electrical power."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Iam disappointed  its not a1474, its md786ll/b. In the case the is Screet"}
{"rating": 3.0, "product_id": "B00HWMPKJK", "review": "The ipad seems ok but the charger that cane with it doesn't work well. Is there a way to get the charger replaced?  Thank you."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great product, works perfectly. Recommended!"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Arrived on time and works fine!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Perfect"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Very nice, virtually new.  Buying certified refurbished is the way to go.  The only drawback is that charger appears used, not sure if apple brand, but works."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "iPad started blinking, then went black, then came back on, started blinking again. This has been happening for about a month. Very aggravating! DO NOT buy a refurb from this dealer!!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Product arrived with no issues."}
{"rating": 2.0, "product_id": "B00HWMPKJK", "review": "The iPad was in good condition and exactly what I ordered. The reason I rated it a 2 star is because the charger went up in smoke within minutes when plugged in. It works properly with a new charger, but I'm disappointed I had to spend additional money on the product after purchasing it."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Received item promptly, and was exactly as described.  No issues, just like new refurb iPad!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "It was exactly what I wanted. It came in the white apple box and had all the cords. I'm very excited to give this as a Christmas present"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Screen stops working and I get the blue screen of death. So upset I wasted my money on something that has gotten worse and worse to the point you can barely use it."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Looks brand new! It was even apple refurbished!!"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Great buy!!!"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "iPad went black screen after a month of use."}
{"rating": 3.0, "product_id": "B00HWMPKJK", "review": "Don't use the charger and cord they provide as they burned themselves out when I tried to use them.  The iPad is ok but has occasional charging issues."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "All I have to say is Clash of Clans. War champion over here. Never miss a single spell drop."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Smaller, lighter version of the original"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I love it!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "great for the price"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "I've only had it for a little over a week. So far so good. Haven't experienced any real problems other than the charger. The charger is pretty cheap and comes unplugged fairly easy. Other than that not too bad for a refurbished product."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Works great"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Purchased these for our church worship team. We use it with Onsong and sync them across the team. These despite being a generation old, are very responsive and feel of the highest quality. We don't have any cases for them but they feel like they could survive a few drops (haven't dropped any yet, but if we do and it breaks I will update this post)."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "As I upgraded from iPad 1, I now have the memory and speed needed to use my iPad Airbtomits fullest capabilities!  It's great!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Awesome and fast."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Not even 6 months after purchasing my videos won't play\nIt works fine for everything else, but if I go to play a video on YouTube, Facebook, anywhere-- the screen goes black\nIt wasn't cheap so I'm very unhappy with this purchase"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Super light works great, front button sticks sometimes"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "The iPad is not working satisfactorily - sometimes multiple taps don't produce any result, at other times the iPad produces blank page while displaying the correct URL at the top.  I would like to exchange this iPad for a correctly functioning one."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "The apple iPad Air is like brand new, no scratches or blemishes at all I bought this for my daughter for her birthday and she loves it  I would buy this item again"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Ipad stiopped working after 4 months. Waste of time."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "As described."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Love it. Arrived in plain white box with charger. I had no problem setting it up and have no problems with it. Charge lasts me 2 days. Never had an iPad before but I really like it."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "We have been using this iPad for over a month now, and there was no sign that it wasn't a brand new iPad!!  I was nervous about buying it, but I'm very happy with my purchase and the money I saved by buying a refurbished iPad."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "It's an Apple iPad. What else I can say??"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "The ipad have a bright spot . It s noticeable on a blank page or on the IOS interface.\n\nI know is a refurbished ipad but for the price you expect a screen without any issue.\nIt was gift so I will see if the person wants to change it or not."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Are you happy with my purchase thank you"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "iPad no longer turns on. Have had this refurbished product for a little over 30 days no and more often than not when you go to turn the iPad on, nothing happens. Multiple attempts using both home and power button. Just home button. Just power button and it simply will not turn on. Don't go for refurbished as they don't work like a normal apple out of the box should.\n\nNo refurbished indicated on box when delivered either leading one to believe never used."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Have had this for about six months and has been great! Came in original box with all the original stuff!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Item is as described. If you don't need the latest and greatest, this is a great option. Runs everything i need it to."}
{"rating": 2.0, "product_id": "B00HWMPKJK", "review": "Didn't work properly and only a 90 day warranty for a refurbished unit. I expected a new one year warranty"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "A good size for my dad to use and lightweight."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "<3 it its so convienient and the battery life is amazing"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Handy works well so far. Satisfied"}
{"rating": 3.0, "product_id": "B00HWMPKJK", "review": "It's just fine."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "This was perfect.  I could not afford a new one and this is just like new!  I would not hesitate to buy one again.  No scratches in very good condition."}
{"rating": 2.0, "product_id": "B00HWMPKJK", "review": "I have a couple of problems with this iPad. 1 I didn't know I was buying one that had cellular capability. 2 it didn't come with a apple wall plug, the one it came with overheats when the iPad is charging. 3 this iPad took over 6 hours to charge! I'm sorry but my iPad Pro doesn't take that long! I would like something to be done about these issues. Thanks."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "I love my IPad"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great machine. Even though its refurbished, it looks and works like a brand new machine."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Nice tablet that works well and is intuitive to operate.  I got this for my 11 year old for school and he loves it. The battery life is excellent and with the case it is very durable."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Amazing "}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "It's functional, I wish it had a USB port"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "very nice"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I love this thing! It is lightning fast, is small enough to carry in my handbag, light enough to not weigh me down, and has so many new things that my old IPad 3 did not have! And I looked like new! VERY PLEASED! Having lost my old one to a crushing tire as my car rolled over it, I was thrilled to have to upgrade but didn't want to spent $700 or more! This is the perfect solution! And I have 32 GB compared to only 16 on my old one!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Works fantastically and does everything I could ask at a fraction of the price of a new one.  Item was listed as refurbished, but looked brand new.  Operating system is very quick and I've found 16gb to be plenty for what I use the iPad for. Videos stream flawlessly and apps download almost instantly.  Overall very satisfied."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "As good as new - you really couldn't tell that it was refurbished.  Works perfectly."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Best and cheap just like new"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "First time I have bought refurbished,it looks and works like new saved all kinds of cash."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Like new!  Can not tell it is refurbished!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Works great!  I use it constantly and it doesn't let me down.  Fast shipping too. Great seller, thank you!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Everything brand spanking new ! Every thing original, even box . I'm very happy\nHighly recommend"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Kinda hesitant on buying refurbished, but this was amazing! Looked brand new and worked brand new. There were no scratches to be seen."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great price, looked brand new, functions as it should, packaging was good. Would buy from them again. Nothing bad to say at all."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great buy"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Exactly as described. Refurbished by Apple and works perfectly - at a fraction of the cost for a new iPad! WILL CERTAINLY PURCHASE from this company again."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Works great.  Looks brand new."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "One day service is awesome! I read the reviews after I ordered and I got nervous but it was packaged very nicely and it is very nice and sleek. It charged very quickly and I was able to sign on to my Apple ID quickly. I am happy with it so far. Such a good deal too."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Very good product. I got a refurbished iPad and had zero problems."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "It arrived in a nice apple refurbished product box. It looks and works like a new product"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Exceeded my expectation.  Looks and functions perfectly."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Perfect for our daughter! Came very nicely packaged and works just like a brand new one. No visible defects or deformities!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Perfect!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "awesome, love it"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Like new! Great buy for the price"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great iPad! Referbished but like brand new!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "It is like new. Great graduation gift for my daughter"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Nice tablet, works great, should have gotten the 32GB but this is good."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great deal and runs perfectly"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Excellent condition"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great deal on an iPad Air.  If it was ever used you cannot tell. Looks and performs as new  love this device and the quick shipping that goes with Amazon prime"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Ordered a refurbished iPad for a friend because new is so pricey. The iPad looked like it was new and so far as worked great. Glad there are refurbished iPads out there for those of us unable to afford new ones at full price."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "The block and cord given to me with this \"refurbished\" iPad is junk. Fried every cord and device I plugged into it and was almost too hot too touch. Junk! Do not buy!!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great product, no complaints here!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Fantastic, it was like bing new. Have had no problems"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "This iPad Air was purchased for my wife.  So far it has worked flawlessly as far as I can tell since the wife has not made any complaints to me - and no news is good news :)  Only time will tell if this product lives up to its reputation."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "No issues.. loved it!"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "The iPad would not fully charge. The touch screen was slow to respond at times. Pretty disappointed, I am not the most tech oriented person but I could tell this was not new. Amazon stood behind the product and returning it was easy"}
{"rating": 3.0, "product_id": "B00HWMPKJK", "review": "Works as advertised."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "We got this for our 1st grader because they now encourage devices in our district. It came in a white box with a sticker that said \"certified refurbished\" (unlike some reviews that said certified preowned). There are no scratches or dents anywhere. The system started up immediately and it was easy to set up. We downloaded a bunch of school required apps and other games and he has had no problems using any of them. It catches on to wifi network and is just as fast as our old one was when brand new. From now on, we will come here to buy another because refurbished is the way to go! We saved money! Received our package within two days and we couldn't be happier."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Exactly as advertised.  Meets needs & performs well.  Being used by students to live score meets, and able to function rapidly enough to be accurate."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Our IPAD Air is a year and half old and has never been physically damaged and always kept in a protective case. Then i decide to go ahead with the OS update as it had been bugging me to do so. The update gets to 80% complete, then dies. I took it to the genius bar and after a couple of attempts to fix it they say that there is nothing they can do and its out of warrantee. It feels really lame for a simple operating system update to brick the iPad.\n\nDon't get me wrong I am really trying hard to become an apple person as I love my 2013 macbook pro. Last year i even got a fully maxed out Mac Pro, but its video cards were constantly failing so after its last repair i sold it. At this point the only apple device I can recommend is the macbook air and pro they are rock solid."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "I charged it fully and started to configurate and lights were getting dimmer and dimmer I started to erased all my information before it disappear and then Puff I started smelling something like Acid and after that it was totally gone , she also came with a few scratches but I really didn't mind that if it would work ok!!"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "The charger doesn't work after one week of use. I am hoping it is under warranty and I can return it. I just have ot go through the pain of backing up all data."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Works awesome, as expected"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I received this in about less than a week from ordering it! It came in perfect condition, with an original iPad Air box and charger. I'm so pleased with this product!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "The product was delivered as described. Works fine. I was able to activate it and tie it to my own account just fine. No problems with shipping."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "1st ipad I've owned...had other tablets...and this refurbished one works great.  The only trouble I had was that they sent the wrong charger with it, but they credited my card $10 so I could buy one.  So I'm satisfied.  It is far better than my last tablet (a Kindle Fire 8.9).  Sorry Amazon."}
{"rating": 2.0, "product_id": "B00HWMPKJK", "review": "It's not like a new"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Everything has worked out fine. Ordering and delivery went very smooth and operationally the iPad is doing great"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Birthdays for my son at his request and he loves it no complaints but no further fine details"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "After market boxing. no manual, no warranty , scratched"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Ipad is great. Only complaint is that it came with a non-Apple brand wall charger that overheats to very hot temperature when in use."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "THE ITEM CAME WITH A LOT OF DEFECTES, SCRATCHS AND DAMADGE...WAS USED FOR SURE...I WANT MY MONEY BACK, OR SEND ANOTHER ONE."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Purchased this as an economical upgrade to our 1st gen iPad. Sold as \"certified refurbished\" but upon arrival I found no indication that it had been refurbished or certified but that it was \"new\" (which it clearly was not) and another label stating it was \"preowned\". Additionally it had several scratches on the screen and body/case. Much to my disappointment we initiated a return immediately. The reviews are mixed so it seems you have a chance at getting what you ordered or something else. Warranty offered is 90 days however true Apple \"certified refurbished\" products offer 1yr and optional apple care."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "It has had glitches since we purchased it. Terrible. Would love to return it."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Works great . Quick delivery"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "got it for my wife.  she loves it"}
{"rating": 3.0, "product_id": "B00HWMPKJK", "review": "Great price but some issues with the touch screen in the middle after a month. Should have stayed away from a refurbished product, I guess."}
{"rating": 3.0, "product_id": "B00HWMPKJK", "review": "came with wrong adapter (for iphone instead of ipad)\nbut, perfect delivery time"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "The refurbished systems are great! But the lithium ion battery may be faulty. But, all in all, it's a solid product. Unfortunately, I retuned it."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Product died within 60 days of purchase outside window of return."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Very nice. Great price"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Perfect"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "didnt work after two weeks now i hear i might be charge for returning it?"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "It works perfectly. In brand new shape. So I happy I saved money & purchased it refurbished!"}
{"rating": 2.0, "product_id": "B00HWMPKJK", "review": "I bought this several months ago for my son for his birthday, and the return window closed well before I knew it needed to be returned. No downloaded apps will open! We have tried everything from resetting it to completely restoring it. Now he's stuck with an iPad that he can pretty much only use through the Internet. I thought refurbished would have all of the bugs out and be fully functional. Huge waste of money."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I've been on it every day for the past 6 months and I've had no problems. It came in its original iPad packaging and didn't have a scratch or scuff on it. It works as if it was brand new straight from the factory and I've been thoroughly enjoying it. If you are in the market for a refurbished iPad I would highly recommend this one from this seller. Don't bother shelling out the extra cash for one straight from the factory, because this one is equal in all aspects."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Very fast and easy to set up, I can't believe all the tasks you can do on this"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Came with a little dent in the box . Despite some reviews , this is definitely apple refurbished and does not come in a brown box ! Works perfectly , definitely saved me about $50. Looks brand new"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "great!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great shape, works perfect.  Will buy another one when needed."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "excellent fit. great price"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Its an ipad; there's nothing I can say that you haven't heard already. So buy one!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I am completely satisfied with my purchase.  I was hesitant but went ahead and ordered anyway. I was surprised, the iPad appears brand new.  It arrived on time as well. I have only had it for a few days but it's working.  Thank you Excellent electronics!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Firstly it came packaged beautifully. What is even better was that there was not a scratch on it and BONUS I got a WiFi/3G model. Works beautifully"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "very satisfied no issues with a refurbished Pad."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Received it and it was like new. So far it has been working very very well.  I am very happy with my purchase. Would do it again."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "I purchased 14 of these supposedly certified refurb units from BuySpry.  Two arrived dead.  Within 2 weeks, two more were dead.  I've now had 7 die.  Another one of them died about 5 days ago.  I emailed and phoned BuySpry and had no reply.  I finally get through on the phone today and am told that I ordered them on Apr 19 (I ordered on Apr 22 - actually received them on Apr 26).  I was told by BuySpry that the 90 day warranty had expired (it hadn't, especially if you consider when I actually received the units!) and too bad so sad for me.\n\nStay far away. These units are total garbage and you will end up wasting your money."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "It was a gift for our 12 year old daughter, she just received it this weekend.  She loves it and is as happy as she can be."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Like new, no wearing signs, works great"}
{"rating": 2.0, "product_id": "B00HWMPKJK", "review": "I try to buy refurb whenever they are available and I've generally had good luck. Not this time.  I bought this refurb iPad as a gift for my teenage daughter. I didn't mind that it came in a plain brown box. I found it odd that the charger base was an odd shape (not the typical bright white Apple cube), but that's not a deal breaker. What is a deal breaker is that the camera is buggy. Most of the time, when the camera is launched, the result is a black screen that does not respond to touch. When we don't get the black screen, and the rear camera is selected, we might be able to snap a photo or take a video, but so far, the front camera has never worked which means that FaceTime is impossible."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "great buy"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Perfect condition, would totally recommend. I've purchased 4 from Apple paid $650 for each. I paid 320 for a refurbished iPad Air and it was exactly the same."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Very pleased with my purchased! Item as described!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "For the money, you cannot beat it! Great little tablet!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "exactly as expected. perfect."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I received the IPAD AIR quickly. It was packaged in a generic box (not original, but fine) and had all the accessories. Certified refurbished is the way to go if you want to save a few dollars. They work just the same as a new one. This was the best price I could find anywhere for an iPad Air with 32 GB. Priced very fair. I would recommend this to anyone looking for a new iPad and wants to save a few bucks!!\n\n I recommend 200% this good seller and this product!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I received a cellular-capable unit in perfect shape. I was a bit concerned that I that it was completely dead, but 6 hours of charging brought it back to usable life. This was a great value."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "This iPad was like new new and cost substantially less than a new one. The charger and cable were not Apple branded but the supplied cable and charger work fine. Do your self a favor and try one of these and save some money."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "The iPad came as directed.it is perfect condition. It is lighted and faster than my current tablet"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Does not have SIM card."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "I got this with no real plans with what I would do with this and I find that my laptop is way more versatile.  It works well and has good resolution."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Excellent, couldn't be happier"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "What you see is what you get. Setup out of the box was standard."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great iPad! No problems with the refurbished one. I love it."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "After charging, the iPad would not come on."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Great condition but didn't come with charger or other accessories."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "I love the crisp & dynamic screen's display. It's a bit smaller than I expected but the display gives it a win. This is my first Apple product, & although refurbished, I'm very pleased with my purchase. I highly recommend this item for downloading Art images-paintings, Photoshop, etc."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "This refurbished iPad works awesome! No blemishes or defects, screen is perfect. Love it!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "excellent"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Grandson enjoys"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "9 months later I have a $330 paperweight. The iPad I bought from Amazon through Square Deals Inc. is almost completely useless. Both Safari and Chrome crash repeatedly, and other apps misbehave as well. Square says there's nothing they can do for me. So frustrated that I have to get a new iPad after such a short period of time. Buyer beware indeed."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Incredibly frustrating to receive a certified refurbished iPad and to have it stop working the minute I plug it in.  Hard to believe that between certifying it and receiving it there would be a complete software crash.  Last time I will take a chance on something that shouldn't be an issue."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Love it I use it all day everyday"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "In great shape"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Love my new iPad Air"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Refurbished iPad that is performing as well as a new one.  Would definitely buy from this vendor again."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Complete waste of money. After two months something went wrong with the hardware and it would change pages and move the cursor around by itself so it was unusable. Cannot be fixed."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "1 Star review for including a counterfeit USB Power Adapter that could have burned down my house and killed my family.\n\nThis product came with a counterfeit 10w USB Power Adapter that could have started a fire.  I was attempting to charge the iPad with the included cable and power adapter, and after 2 hours on charge, the iPad had received no power, and the adapter was hot enough to actually burn my fingers.  The adapter was so hot that I could (and still can 12 hours later) smell the cheap white paint burning, and it has a burnt electronic smell as well.  My house now smells like burnt electronics.  Had I not checked the charge level of the iPad, it's entirely possible that this knock-off power adapter could have burned down my home.  Whomever decided to use the fake power adapters is criminally negligent."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Couldn't be happier with this purchase"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "No not really, good iPad at a good price though."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Love my ipads and this one was to upgrade mine and give the old one to mu husband.  I had it for about a week, really enjoyed using it, then it was stolen from mu car.  But I do recommend it."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Everything worked but the screen! The touch did NOT work! Would not Recommend! Paid for 1 day shipping and regret it because I got all excited then when it came it turned on but the only thing that didn't work was the touch. Getting all my money back!"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "It's my first iPad, and I am really enjoying it.  Since I have an iPhone I find it easy to operate. The only thing I would change is to have the better camera which may not be important to some, but is important to me. It's not a bad camera, they just make a better one. That's why I gave it 4 stars.  Time will tell if it's enough GB for me."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Works perfectly"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "On my second Ipad. First one had a home button the was pushed all the way in and he second one lasted a week and is completely frozen up."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "The iPad is perfect. The power adaptor does not work. Cannot charge iPad. Have asked for a replacement. Have to use husbands adaptor."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "The thing turned on, flickered, then stopped working all together.  Bust!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "The IPad was delivered in a perfect condition. No complains so far."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Item is in perfect working order.  The charging cable was damaged however, but I had a spare."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "PURCHASED FOR:  5 year old nephew (I know, I know)\nPURCHASED ON:  3-10-16\nPURCHASE PRICE:  $329.99\n\nAs the owner of a brand new Apple iPad Air 128GB, WiFi, etc. I was skeptical purchasing a refurb.  However, they offer a warranty, UH-MAZING!  This refurb's been going 2 months strong now and having the warranty to back me - so silly not to purchase!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Perfect!!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Love it!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Certified refurb is indistinguishable from new.  Thanks!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Mine came in a week . No dings or scratches . It was a refurb 32 gig silver iPad Air. I would definitely order another in the future. The battery life is good and my wifi works great."}
{"rating": 3.0, "product_id": "B00HWMPKJK", "review": "It did not come in a factory box, but rather a non-descript brown box.  It came with a charger.  It was in \"like new\" condition as promised.  The issue we had is that we could not setup with a cloud backup, it wouldn't do it because they had not properly wiped the device clean, so there were some issues that had to be worked out at the Apple store.  So it was no fun to have to take time off to hit the Apple store."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Worked perfectly out of box - looks new!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "If they hadn't stated this item was refurbished, I wouldn't believe it.  This iPad was in absolute pristine condition when I received it.  It comes in a generic brown box.  It comes with a 120V wall charger and charging cable.  It's a \"No Frill\" package.  But the iPad itself, has plenty of frills!  If you don't tell anyone it was refurbished, then they will think it's brand new.\n\nI'm an Android user for all my life and I am still getting use to how an ipad works.  They seem to be very \"smooth\" and polished.  I felt a little stupid because I couldn't figure out how to sync my Ipod with it, but it just \"does it\" via WiFi-I guess?  All I know is what purchase on ITunes will magically appear on my Ipod.  The Apps are great.  I use Charter Spectrum to watch shows via On Demand or however and they are very clear.\n\nI would recommend this unit and I would recommend this Seller."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great product, brand new looking - would highly recommend as it's much more price friendly than the newest models, while being a light easy to use workhorse for business. Combined with a type keyboard it's fantastic!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "It arrived nicely packaged with appropriate cables. Has worked perfectly fine. No problems."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Have not even turn it on but it has a BAD scratch by the apple. Should be mentioned on the description! I just got it and it was the first thing I notice :( very unhappy right now."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Works Great!! Another perfect Apple product!!"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "I have enjoyed using the Apple iPad Air. I do want to go to a class so learn to use it better. But I think it will be helpful for me."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "This is perfect for our needs. We have it connected to a 3D image capture lens for our Physical Therapy clinic. It works excellent."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Biggest mistake do not waste your money"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Works perfectly"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "The iPad is excellent"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Arrived quickly.  Works well."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "To much money AND TO SLOW"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Looked brand new and was so excited. But didn't work properly, was very glitchy, would randomly power off and not turn back on."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "We love it thank you"}
{"rating": 2.0, "product_id": "B00HWMPKJK", "review": "Several of the ipads didn't work. They would begin typing information without you entering anything. Had to return for a refund."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Arrived on time and works great. Take it everywhere to quickly look up listings on homes for my clients."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "I was so excited to get my iPad Air! After being a loyal Apple customer for years, I couldn't wait to unbox my new iPad! My old iPad had just gotten to old for me to use regularly anyway. However, I was extremely disappointed that when I opened it, I wasn't able to restore from a backup, and then after updating to the new iOS my iPad froze on the apple screen for hours! I'd love to get this fixed, but the closest Apple Store is two hours away  I guess I'll have to take care of it that way."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Love my ipad"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Tanks i love this iPad great product."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "cant even tell it had ever been used"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Was thrilled to save the money, but it didn't turn on "}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Very great quality for being refurbished. The only thing I've noticed on mine is some slight nicks on the top of the tablet. It's fast and runs like it's practically brand new. My only complaint is the battery is a bit wonky. It depletes a charge when I have it plugged in and am using it. So if I want it to charge better I have to leave it be. But the battery life itself is amazing and I get a whole days use out of it if I'm using it frequently. If you're wanting to upgrade an older iPad or take the leap and try out the iPad, I highly recommend buying refurbished from this seller. The packaging was great too. It had a lots of extra padding and was securely packaged."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Love this iPad packaged very well item looks like new works like new. Great bargain"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Outstanding overall as you would expect.  Limited to four stars because the first iPad Air stopped working after twenty months."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Decided not to return."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "sound quality isn't great"}
{"rating": 2.0, "product_id": "B00HWMPKJK", "review": "I am pleased with mi iPad. It came in great condition and works like a charm.  However, it came with an iPhone charger which takes up to 15 hours to fully charge the device which is a disappointment."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "This was NOT a \"certified refurbished\" but rather a used product, scratched and poorly cleaned, no original packaging, speakers clogged, the apple logo on back was heavily scratched. buyers beware!"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Great item works wonderful."}
{"rating": 2.0, "product_id": "B00HWMPKJK", "review": "I had high hopes for this iPad as it looked like new out of the box and, for the first couple of days, it seemed to work as advertised. By day 3, the keypad began typing phantom characters, freezing and then presenting a pop up asking me if I wanted to enable dictation. This happened almost every time I tried to type an email, a Facebook post or anything that required text input. After reading several other recent reviews, it seems that these iPads are not properly refurbished. I am returning it to Amazon tomorrow."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I had an older iPAD 2 and the glass shattered. I am really enjoying my new iPAD air. It is way faster than my old one. It is also a lot clearer with the retina display"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "This is a \"certified refurbished\". But it looks like it is brand new.  The company that refurbishes and sells seems to be quite thorough and well organized, as I received the product in two days wrapped up like a new one would be.  There's not a scratch, mark, or smudge on it. Looks as if it came from the Apple Store directly.  My computer was almost completely charged when I got it, but I wanted to make sure it charged properly.  I turned it on and everything is working well, no issues.  The iPad Air is the lightest tablet I've ever owned.  I bought it for my practice for medical notetaking, which is Internet based. The wifi worked seemlessly and I have used it this week without any issues.  this product comes with a 90 day guarantee that I think is more than generous.  Great price point for a product you could buy new for about $100 less, but why would you??"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Excellent refurbished IPad at the right price!\nWe use it daily, and it's everything Apple advertises.  Shipping was prompt, packaging was A-1.\nSo far, absolutely no complaints -- only Kudos!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great - brand new - no problems."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "The iPad cannot rotate. The problem is I cannot return it as I have setup my person account on it already and don't really know how to delete my account. This is my worst experience with any Apple product."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "This product came in exactly as advertised. From the screen to the frame I did not notice any blemishes. Also system seems to be running really good."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "I received the product very quickly, but the home button was broken and there was a big dent on the corner of the tablet. After trying to still use it for a day, the iPad just stopped working entirely. I have since returned the product and chose to buy a new one instead.\nI was under the impression that a Certified Refurbished product was just as good as a new one. After this experience, I will never buy a certified refurbished product again."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Purchased for my girlfriend for school.  Refurb came as described, no wear marks, looks brand new, acts brand new.  I'd even go so far as to say \"sexy\", if it wasn't an apple product ;)"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I'm loving it.  Works great.  I would definitely buy from them again."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "iPad had not been cleared of old data and was password protected. Contacted Square Deals and they said they were sorry but that I had to contact Amazon for resolution. The only options were to return it for a replacement or a refund."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Everything was fantastic, until I noticed the battery doesn't charge. Even one the charger not in use, the battery slowly dies. Really angry and disappointed I paid one day shipping and was jumping out of my pants excited about something that doesn't work."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Ordered a iPad from here and upon powering the iPad on the touch functionality on the iPad dos not work at all. I couldn't swipe or anything."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "The ipad did not arrive in original box as stated, and did not come with original charger as stated. The charger doesn't work. I could've purchased an \"open item\" and gotten them for a little more without having to buy a new charger."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I'm really satisfied"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I've Had My iPad Air Now For Over A Week Now - Very Happy Wih My Purchase!!!"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Definitely not CERTIFIED REFURBISHED. I was so happy to get it, BUT when I turn it on it freezes and wouldn't go beyond a frozen screen.\n\nIf you want Certified, the only place to get that is at the apple store. I learned my lesson."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Works beautifully. Couldn't tell the difference between this and a brand new unit."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Exactly as describe. Like new."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "So satisfied with the certified refurbished products on Amazon!  I was able to afford a 64GB iPad Air for almost less cost than the 16GB version brand new!  Despite being two generations old now, this original iPad Air still runs the latest version of iOS beautifully and smoothly."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I just love the way it works. You have to curb your expectations for shopping here and you will gain your happiness!\nThe one I got, works great and going to be perfect for my parents.\nIt's beyond the point that the model is different (it's great when you know what to expect!)\nI got MD788B/B - close enagh!\nWell, there is not 16Gb but 12Gb - who cares, my parents would never use a fraction of it.\nBut, here is the prize! There are not two, but three cores in the processor. Isn't that great, ah?!\nPurchase totally worth the money spent!\nI'm a happy man now!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Works great for a refurbish product and cheaper cost."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "IPad arrived with non charging battery. Very dissapointed."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Wow ! Very good refurbished product ! Thx very much !"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "iPad defective upon arrival. Unexpected restarts and shutdowns with blue screen appearing. Took it to the Apple Store to get checked out and they told me it was a hardware issue probably from refurbishment."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Defective product.  Microphone wouldn't work.  Came in blank box (expected),  but labels say \"do not break seal unless using parts\",  and \"as is pretty owned\",  product of mainland China.\n\nThis is clearly an older,  defective model they tried to pass on to customers.  Otherwise,  product was clean  and the rest fine.  Just seems fishy.  Steer clear."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "The device did not work. It would not turn on. I have been an owner of various Apple products for over 10 years, so ran through all the troubleshooting steps. The device I received was apparently defective. I am in the process of returning it. The seller I purchased through was BREED.  I will be purchasing this device again through a different seller (Bluetek USA) in hopes of receiving an iPad that actually works.\n\nUPDATE 3/21/16\nI reordered this device using a different seller, BLUTECH USA. THIS PRODUCT WAS DEFECTIVE AS WELL!!!! I mean seriously???!!! This is supposed to be an \"authorized Apple refurbished\" device. I have ordered refurbished devices directly from Apple in the past, and have NEVER had a problem. It is ridiculous that I order a supposed authorized refurbished item two different times from TWO different Amazon sellers within a weeks time and BOTH iPads do not work. This time, the device DID power on and go through all the start up and welcome and set up functions, as it is supposed to do. The only problem was HALF of the screen was dim! Exactly half of the screen functioned normally, and the other half was much dimmer. I went through all the set up anyway, thinking maybe it was supposed to look that way. But then I opened Safari and the screen was still half dim.\nI tell you, I'm tired of this. If I could give 0 stars I would. I am now going directly to Apple to purchase one of their refurbished devices. Yes, I will pay a little more, but now I feel it is worth it to get a quality working product. BUYER BEWARE!!!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great refurbished ipad"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I bought this iPad for my sister as her birthday gift. It looks just like a brand new iPad and works great. It has good amount of space to store. It had new charger and lightning cable which I didn't expect. I would definitely buy refurbished apple products again."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great quality"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I'm very happy with the iPad looks like New and works great"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Just like brand new.  Works like a charm!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I bought this used and it works great and there is nothing wrong with it!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "It was a great buy"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "The iPad air has been everything I hoped it would be and more.  Huge boost to my productivity and leisure time!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "As described. Awesome!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "good"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "It's amazing."}
{"rating": 3.0, "product_id": "B00HWMPKJK", "review": "After a week of use for my Square Registet, the iPad Air had several gray lines running thew the screen.  I took it to an Apple store and had the iPad Air replaced.  Luckily it had a warranty."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Defective.  Not refurbished.  Warranty expired.  Bait and switch."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Product was defective. It hardly turned on and when it did had static lines were running through the whole screen.  The charger didn't charge the iPad  either. Very disappointed with the quality."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "touch secreten deos not work"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Came in GREAT shape and very quickly. I love it!"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Ipad stopped working in 2 weeks. Will never buy from this seller again. Worst experiece"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Got it for my wife for Valentine's day. She absolutely loves it. She uses it evryday. She has a MacBook pro so she's all about Mac evrything. It's fast, light and powerful enough that she hasn't had any issues browsing or watching movies or playing games. So glad I got this for her. She loves it so much that I'm thinking of getting one for myself! Get it you'll love it too."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Came in great shape.  Great deal."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Good as a new one and very reasonable. Would do it again"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "perfect! we bought this to replace my sons old ipad."}
{"rating": 3.0, "product_id": "B00HWMPKJK", "review": "Cable and charger were not OEM."}
{"rating": 3.0, "product_id": "B00HWMPKJK", "review": "The only problem I am having is that my iPad Air is using a whole lot of data and I don't know why.\nI plugged it in at 8:00AM and 1 hour later it had used a whole Gigabyte! This put me over my 5 gig limit on my AT&T hotspot and I have to pay an extra $10. (Before that, with my iPad2, I was using about 1 gig a week!)\nProblem is that I don't know how to stop it from doing that.  I just have to keep putting it on Airplane mode until I figure out what is happening."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "You can't tell it's refurbished."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Very good deal!  iPad Air looked brand new and came with new Apple brand charger and cable!  Wouldn't know it was a refurbished iPad if it wasn't labeled that on the box.  Didn't have a single scratch or imperfection on it.  Completely satisfied with my purchase!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I love my iPad.  It arrived a day early and I've had no issues with it"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Bought 2 of this and there is no problem with this product. I was scared at first because it was my first time to order gadget from amazon and with a big amount. But i was relieved upon receiving this ipad with no problem. Thank you so much."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "I'm really enjoying the iPad Air. Works fast. I use it for everything from work email to streaming movies."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I bought this on a whim, to replace my wife's iPad 2 which was running slow. It seems as if it's a brand new iPad! No possible way to tell its refurbished.\n\nIt comes in regular Apple packaging, sealed up and shrink wrapped. I don't think I'll ever buy a \"new\" Apple product again."}
{"rating": 3.0, "product_id": "B00HWMPKJK", "review": "The charger it came with I pad don't charge fast. If I charge all night also it is not 100%"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I received this right on time, and I couldn't even tell it was refurbished. It came in an iPad Air box that was properly wrapped with everything in it! It was easy to set up and works great. I was so happy with finding this product."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Awesome iPAD! Everything came in great shape. There was not a single scratch or defect on my iPad. It shipped very fast as well"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I absolutely love this iPad Air. I have had it for almost one week now and it is already performing much better than my Toshiba satellite laptop that just died. It looks and feels brand new and does everything that I need for graduate school. I can view a PowerPoint in one app while working on a document in another all on the same screen. I was surprised to see that some of the apps that come with the iPhone were missing from the iPad Air including the calculator, weather, stocks and voice memo but I do not have a serious need for any of those and if I did, I could always look them up on Safari or download apps that do the same thing. Based on my use, the battery life is great and it does not need to be charged more than once every two days. Overall, I am very happy that I went with this iPad over a different tablet/laptop and would definitely recommend it!"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "I'm just learning to navigate this iPad but what I see, I like.  I'm currently using the Kindle feature."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Sweet gift! Great product! I wish I had bought a bigger memory option, but not the product or company fault."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great value"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Outstanding customer service and an amazing product you can't even tell it's used it came in at all its  original packaging sealed and certified by Apple"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "The case will not snap together. Not only that but the case does not line up with the volume buttons on the iPad. VERY DISAPPOINTED! TWo days before Christmas and this doesn't fit."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "So far it works perfectly fine. The only thing that I didn't like was that it didn't come in a box, it came wrapped in bubble wrap which was odd. For the most part I'm satisfied."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I got this for college to supplement my laptop while I'm in class. I got the chance to use one for a semester that was provided by the school, but it was the much older iPad 3 and I really loved how easy it was to use since I'm not really savvy with iOS products. The experience convinced me to get my own, but of course the price was pretty high compared to other tablets available, but if you want the iOS platform you have very little choice. I priced both new and used models from several online sources including directly from Apple and found this iPad Air 2 factory refurbished model at a pretty competitive price here on Amazon. I'm quite familiar with factory refurbished items as most manufacturers offer similar deals on electronics so that wasn't a real issue. In fact, that was exactly what I was looking for to get a better price for a factory warranted product that is for all intents a purpose is a brand new device. I came in a factory sealed box with all new accessories just like a new item would. Its much lighter than the iPad 3 I was using before and the quality is second to none for fit, finish, and performance. If you are in the market for an iPad and don't have to have the latest and greatest model out there then this is a very viable option to get one at a deeply discounted price. I've had mine for an entire semester and I use it constantly everyday for hours at a time and I have never had an issue at all."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "So far so good"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Love it"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I absolutely love it so far. It looks brand new. There were no scratches on it. I love it. I just realized though the charger I got isn't charging it. That's a low blow. Had to take this to 4 star."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "The clearest, fastest, lightest iPad yet! I love it!"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "I always loved android until I receive my iPad. FaceTime is amazing on it which is video chatting for some people who don't know. No one has FaceTime but Apple. The FaceTime is so clear compare to Skype, oovoo, tango or and other video calling. I live in Florida and my family is all over the world such as georigia, New York and California. It's nice and clear on FaceTime which is made from Apple on iPad or iPhone. It very light duty unlike other tablets. Pictures and videos are clear And that's great as well. It also has amazing apps as in games, music, and etc. it's easy all the way around. The only problem is the storage not enough space. Get a larger memory. I would recommend it to anyone."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great seller, pad was perfect, fast shipping, my wife loves it"}
{"rating": 2.0, "product_id": "B00HWMPKJK", "review": "The device was scratched & dented in multiple places.  The cable stopped functioning after a couple of weeks.  The device itself rebooted multiple times prior to and after updates.  Continuous random issues...all in all, not a smart purchase."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Everything came as described."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great product"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Looks and operates as if brand new!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "i just got my iPad Air today and it seems in perfect condition and original packaging, for now everything seems so well. It took one week to get here, but I'm happy with my purchase. Is my first time buying a refurbished product, so we'll see."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "very good"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I buy refurbished whenever I want a pricey electronic but don't want to pay full price. This IPad came in its original packaging looking sparkly brand new and functions perfectly.  I saved $300, shipping was fast and I knew if I had any problems with the device I could simply return it for another. Win ! Win!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Awesome"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "exactly what the seller said, beautifully"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Exactly what I was looking for. Shipped quickly. Recommended without reservations. A+"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "No problems with our two iPad Airs.  Both look brand new."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great!!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "All three I purchased for my business came in perfect condition (2 even came in the original boxes). I set all three up immediately without any issues. The iPad Air is still plenty fast, no issue in performance at all. Excellent purchase for the price. Would absolutely buy again."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great iPad.  Refurbished, works like new, and looks new."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Good."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Easy sale. Quick delivery.  So far, so good.  Looking forward to using it."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Worst watch"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great value"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Bought this after my house was burglarized and someone stile my old iPad."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Love it, used daily without problems"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Just as great as hoped.  I wanted an Apple refurbished iPad Air and that is exactly what I received.  I love it."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Delivered on time and works without issue."}
{"rating": 3.0, "product_id": "B00HWMPKJK", "review": "I just want to let you know that with this order #102-9037905-9866661, i notice that the power outlet of the ipads were not the same. In one ipad the power outlet was the small one use on Iphone, and the other had the correct power outlet, plus both Ipads didn't came in the apples original box?\n\nBest regards,\n\nAlessandra Roman"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Product was received in a timely fashion and in perfect order. Item was exactly as described."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "It is an ipad.... Shipping is fast."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "So far so good!  Good as new!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Just received my iPad, but so far no problems. Will update later."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I don't know what I can say about an iPad that hasn't been said 100 times before. I think it's a great product, and the iPad air is especially light which makes it a winner for me."}
{"rating": 3.0, "product_id": "B00HWMPKJK", "review": "My iPad arrived in a cellophane wrapped box without a refurbished sticker. The iPad had been previously used and setup. It was dirty, sticky from some sort of previous labels on the back and the voice over command was turned on along with other utilities making it impossible to just turn on to check to see if it was working properly. I have purchased other refurbished units for my students previously and had the units show up looking truly refurbished, not like they had been returned and then resold. It appears to working fine so far, but now I am concerned that this unit may have unknown issues and does it really have a 1 year warranty???"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I had heard of the IPad, who hasn't, and I decided to buy a refurbished one to help with work.  I had no idea how absolutely amazing they really are, I should have bought one a long time ago. I also am glad I got a refurbished one- this way the people at Apple are working out all the kinks before I get it. The first one I ordered got lost in delivery and it was replaced no questions asked. I could not be more pleased and cannot wait to learn all about it."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "The entire process was extremely smooth and efficient.  Thank you."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Just got an ipad on a box, not the Apple certified."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I love my new iPad...! It looks like brand new and works perfectly. It arrived earlier than expected...which was a nice bonus."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Just as advertised."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Works great"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Nice object....satisfied!"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Was great"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I purchased this as a replacement for my daughter to her very used and abused iPad 2. I was excited at how fast it came with regular shipping (less than a week between order time and arriving). It did not come in apple packaging, but that wasn't expected since its refurbished. There were no scratches, scrapes or anything on the body of the iPad; it looks perfect. It came charged so I was able to do the initial set up and sync to our account. Looking forward to seeing how much my daughter loves it compared to her old one when she opens it up for her birthday."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Qick delivery, love the product, good price...all around plus."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "It was a great buy for a certified refurbished ipad. It was in excellent Condition. I would buy again"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "It is a refurbished model and turns out the audio is not working at all!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Very Good"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Product arrived with a bit of cosmetic damage on the back, but as expected with a refurbished item. I use a case so it's not visible. Product arrived quickly and needed a charge upon opening, but does seem to work as expected. Not being able to afford a brand new device, this purchase was well worth it. Thanks! :)"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "This item is just what I was looking for and the price was wonderful.  I am very happy with my purchase"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Very Happy"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great from great"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Absolutely perfect iPad Air. Looks brand new and works perfectly"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Had it for about one month, looked new."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "loved it"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Perfect condition. Looks like it's brand new."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Very happy with the new iPad. Wasn't sure what to expect after reading all the reviews but I can no way at all tell that the tablet was refurbished. It's just like a brand new one and it's awesome. Came in original packaging too"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great iPad in perfect contions!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great!  Works like its brand new; delivered in a timely manner"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "It is light as expected.  "}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "I have both the iPad Air (or Air 1) and the iPad Air 2. I see no difference in most use between them, except for battery life. It is far better in the Air 1. There are issues with battery life in the Air 2, if all the internet discussion, and my own experience, on this issue is any indication,  The Air 2 is noticeably lighter in weight, and a smidgen thinner than the Air, and, in a very few high-action games, very slightly faster, but certainly not enough you would even notice if you hadn't played the same game on the Air 1 a few minutes earlier. A certified refurbished Air 1 can be had much less expensively here or directly from the Apple Store for far less than the Air 2, with the same guarantee as a new one! And it is eligible for Apple Care if you want it. I think the Air 1 is the best choice between the two, and have recommended it to 2 friends who are very happy with their purchases.\niPad Air pros and cons (compared to iPad Air 2):\nPros\n  Thin enough\n  Light enough\n  Fast enough\n  Cheaper than Air 2\n  Much better battery life than Air 2\nCons\n  No Touch ID (not really very useful on a tablet)"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "This was exactly what I was looking for!  Love the quick delivery...and the price!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Purchased factory refurbished, it's great.  No distinguishable difference from new.  Great product, great deal, great provider/vendor."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I will never buy new again...this refurbished iPad was in perfect condition. I wouldn't have recognized the difference. I'm really enjoying my new product."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "wont go on line anymore"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Love it"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "great deal and my wife loves it."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I'm using it now. I will always by refurbished, what's the difference? $100"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Works as you would expect from Apple... it just works!!"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Arrived on time.  Packaged well in apple packaging with charger.  Turned on normally, then started going to a blue screen, then off, then restarting every 60 seconds.  Will be returning.  Sad."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Love this device!  I use it like a computer with a key board and it works perfect for what I need.  LOVE!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I'll buy again! Thank you!!!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Was Graduation present."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Expected an Apple Certified Refurbished unit.  Received a heavily damaged unit.  All corners dented and scratched.  Two corners so deeply abraded they appeared to have been dragged several feet across concrete. Far beyond what a rational buyer would accept - even as a USED product.  The case on the unit was not suitable for repurchase.\n\nI'd write more details, but they would not make it through the review censor.  So let me just say, buyer beware!  :-)"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "That was a gift for my grandson , and he loves it."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Our iPad arrived on time, in perfect condition, and we have no complaints so far! We haven't had time to use it a lot, but so far everything is great. :)"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "The iPad itself is great and works fantastically. I was disappointed that the cord (USB to lightning) it came with, however, was not a certified Apple cord. On multiple Apple products it gives the warning that the cord is not official and could possibly not work well with the product. It's just an unfortunate oversight."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Arrived quickly.  Works perfectly, without problems.  Glad I bought it."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Thanks"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "My parents love it.  Great condition, not a scratch."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I've always loved Apple products for their performance and reliability. My first tablet was an iPad 3, which still works perfectly fine. However, after quite some years, I wanted to upgrade my device. I was tempted to purchase a Samsung Galaxy Tab, but ended up buying the iPad Air. Overall, I am very pleased with the Air as it feels much lighter in my hands. It also performs much quicker and smoothly when swiping across screens and launching applications. I purchased this device refurbished and it arrived in nearly like new condition. I have had no issues and can say I am even more confident with purchasing refurbished items."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I've only had this for a few days but it is exactly what I expected. It's an Apple Certified refurbished iPad Air that actually has nine months more on its Apple warranty. It looks like new, and functions like a new iPad."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Very pleased with buying experience"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "It's awesome as expected. I love my IPad Air....only I thought it to be the same size of my IPad 2. It's much smaller which is okay too. It did come with a certified refurbish label. Yet I was not happy about what kind of clear plastic to cover the screen. Upon peeling off the clear plastic it left the sticky stuff on the sides and back of the iPad. I was able to remove it but shouldn't have too."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Love it!  Great price!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Very Good. I approved"}
{"rating": 3.0, "product_id": "B00HWMPKJK", "review": "iPad Air arrived today. I was disappointed that the box was unsealed but so far it appears to work like new. I will update before my 90 warranty from seller expires :)"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Came as expected, looks good, will be a gift"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Very much satisfied for the price!"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Fast Delivery, Just what I expected and was a good deal with no problems!"}
{"rating": 3.0, "product_id": "B00HWMPKJK", "review": "The ipad itself works great, like new, however it did not arrive in original box as stated, nor did it come with original charger as stated.  The charger no longer works.  I could've purchased an \"open item\" at best buy and gotten those things for a little more without having to buy a new charger."}
{"rating": 2.0, "product_id": "B00HWMPKJK", "review": "Don't buy Certified Refurbished products. Brought it in Nov 2014 blue screen came up on the ipad in February and now it's totally dead.\nShould have paid the extra $$ and got a new one or just should have been happy with Android..!!! never had any issues..."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Wouldn't even turn on. Enough said. Horrible."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Charging cable suddenly stopped charging device. Device keeps displaying the following: \" This cable or accessory is not certified and may not work reliably with this ipad\". Unable to charge device."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "doesn't work properly and has scratches on screen. Hate"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Bought it for my husband he loves it using it every day."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "The best purchase I made. So far, an excellent choice."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "great"}
{"rating": 3.0, "product_id": "B00HWMPKJK", "review": "This product did not come in an apple box like as advertised.  The iPad itself looks to be in good shape, and has worked well for the few hours I have had it today.  However, there is no mention of any kind of Apple Care one year warranty or any proof that this is an Apple certified product.  This makes me sceptical about whether I am protected on this purchase for a full year or only the 30 day return policy. Next time I have to replace my iPad I will look elsewhere."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Fast shipping and worked as advertised. No issues with this unit what so ever. I highly recommend."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "This is typical high quality from Apple."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Item arrived in non-Apple packaging with no warranty information and an old iPad information card. Checked the serial number on Apple's website and confirmed that the warranty expires in April of this year, so not even close to the 1-year warranty stated. Immediately returning and will not be purchasing from Square Deals again."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "love it!  as advertised and delivered in a jiffy.  bought a Zagg Cover Case bluetooth keyboard to go with it and makes it like a smaller Mackbook Air."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "This refurb ipad air had severe problems with wifi.  Constantly dropping wifi connection and not loading pages.  I contacted Amazon to return item but before sending unit back I contacted Apple Support.  Apple Support re-programmed unit over the internet.  This and a couple of tips from the internet restored wifi to normal function.  Tips included resetting router from 802.11n to 802.11g and setting operating channel  to one clear from any neighboring routers.  With all the problems indicated on internet with Apple OS and wifi, I can't understand why I had to dig so hard for information that finally restored this ipad air to proper functionality."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Works great. Like new"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great buy! Working as advertised. Highly recommend."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Delivered new in box - all good"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Item quit working after 3 weeks. No problem in getting refund back."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "So far so good.  Was a Christmas gift for my husband--his face is in it all the time, haha."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Definitely met my expectations and more! I love it."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Never would have guessed this was a refurb if it didn't say so on the box.  So far no complaints."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "One of the best purchases I've made in a while. Product exactly as described, works very well, and is perfect for reading and note taking in class. Purchased a case with an external bluetooth keyboard to make note-taking easy."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I am amazed of how useful is!!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Arrived on time. Appears and operates as a new unit. No evidence what so ever that the unit has been refurbished. I highly recommend."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I love my new Ipad Air-much easier to stay connected to others instead going to desktop or cumbersome laptop and much easier to view than my Iphone."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Love this!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Even tho purchased as refurbished, it appears and functions as brand new. No problems."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I am a Microsoft man, not an apple guy. With that being said, I purchased this as a gift for my girlfriend with pleasant satisfaction. As she already owned a Macbook and an iPhone it was the obvious choice in tablet, especially after I factored in her work on her graphic design degree.\n\nThe certified refurbished unit came in a brand new box, with factory wrap, and absolutely no nicks or scratches to speak of. There wasn't even a sticker stating it was refurbished. There was no previous owner's files or customization stored anywhere on the device. Apple is so confident in their refurbishment they even included a one-year warranty!\n\nOn to the unit itself. It came charged, she was ready to go out of the box. Initial start-up and syncing to her accounts took about 2 minutes and she was done. The screen is bright, the speakers are sufficient, and the battery life seems to stand up relatively long with constant use for gaming, movies, apps, and reading. The device is very responsive and the processing power seems instant. My only gripe about the unit is it doesn't come with screen protectors or a stylus, yet as they were not advertised as included, I cannot factor that into the score."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Broken on arrival, returned for refund"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "SATISFIED"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "love my ipad, ive had it for about 2 months mow and it works perfect no problems with it. great battery life and looks amazing."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Battery life a litter short. Good otherwise."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "This product was received just as described. Love it!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "The IPad was everything I wanted it to be.  It was in as good as new condition and started woking right out of the box."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "you think your life is complete with a laptop, cell phone and smart tv, but the only true cure for affluenza is an ipad. keeping up with the joneses never looked so good or so streamline. this lil' guy is my new status marker. upper middle class? BOOM! you're there with an ipad air!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great!"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Smaller then I thought it would be. I don't know if I got a tablet or a pad. The measurement was correct. It seems to work good. But the 5 mpixil camera sucks."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I have never had a pad or a tablet that was so fast. Great product,refurbished  is the way to go if u want to save $$$$. Well done"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Seems brand new to me. Great buy!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "very good  for about my pocket"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "great"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Excellent product"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Love it"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Works perfect, no complains at all"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I love it the best one I've had."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Love it!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "good"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I love the IPAD AIR!  So far, so good."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I hate to admit it because I am an Android person - but for a specific application I needed and Ipad. As painful as it is, I must admit it has worked perfectly."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "On time delivery and product was like new. It works perfectly."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Ist here a bad apple product?  I done't think so.  I love everyone I have.  Quality and performance--The Best!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "It was one of the best purchases from Apple that I have made"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "The new IPad Air seems perfect to me-I am really glad that I purchased one with at least 32GB as the new Ios takes up a lot and I think 16 GB is a little light for adding much more apps etc."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Know I'm use it every day"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "My iPad Air is better than I expected.  I love it. I learn something new everyday about it.  The price was awesome."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Arrived at my house sooner than expected. It was packaged in a new box and had all the accessories. It even comes with a one year factory warranty just like a new iPad and costs alot less than retail. I recommend anyone looking to  save a few bucks to buy a refurbished iPad . They work just the same as a new one. It came charged already and used it for a couple of days before I had to recharge it. This was the best price I could find anywhere for an iPad Air with 32 GB.  Priced very fair. I would recommend this to anyone looking for a new iPad and wants to save a few bucks!!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Works great!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Veri satisfied with my new Apple Air iPad. It is the best I have ever had, even comparing with my last 17 inches PC.."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "In beautiful condition, works great.\nBought it on Saturday, it was sitting on my doorstep at 5 am Monday."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Good product"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Works as expected. Love how light it is and how smooth the system runs."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Fantastic. Retina makes a differemce"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Works well. Sometimes it crashes."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "This is NOT the newest iPad Air as the description says. You can get the non refurbished new one from Apple for $399!. So paying $389 for a refurbished one is simply not worth it. Very angry at the deceptive description.  I bought 2 and returned both."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great product at a good price.  I typically like to buy refurbished electronics because it meanb that a person actually looked at it fixed it and checked it out before selling.  I have never regretted buying a refurb and the price is right.  We are new to ipad having used andriod tablets.  it is different but very quick and seems like it will do everything we want it to."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "It's good, but sometimes the screen becomes irresponsible and freezes. Was considering to return it, but then decided to avoid the headache."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "It works perfekt.its a new i pad"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Awesome \"new\" condition! Apple Certified!  Super Fast Shipping!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Item arrived on time, exactly as advertised, in official Apple packaging. Because newer models (and reduced prices on existing models) were announced between the day I ordered my iPad and the day it arrived, getting this refurbished unit was no longer a money saver for me. But that was my mistake. The device has worked flawlessly so far. I'm glad I finally upgraded from my four year old iPad 1."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Very pleased with purchase.  Extremely fast shipping.  Made this purchase for my father, and he couldn't be happier with the item.  Thank you."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I love my new toy"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "I purchased this for a friend.  The refurbished I pad looked and worked just like a new one.  Had no issues."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Shipping was fast and box was sealed and complete ... but unfortunately the iPad did only work for about 20sec then was dead - send back right away and received refund"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Apple sucks"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "This is really great! I love it! though its refurbished,it looks like a brand new!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Certified refurbished is the way to go if you want to save a few dollars.  I can see no difference between this one and the one I previously owned that I bought new from Apple.  Even the boxes are identical with one exception - the word \"refurbished\".  I definitely recommend!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "awesome! I love it, my kids love it..great product!!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Item arrived in perfect condition and just as described. Very quick shipping. Extremely satisfied with this purchase."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "no problems! great!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I love my ipad"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Very happy with this product!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great product"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "shipping was exactly on point and the ipad was in perfect shape. it was a legit apple refurb just as listed and everything was great about the purchase."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great price,  condition is just as new. Would purchase again. Arrived in a timely manner,  ready to use."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "This is my 5th iPad- I will never buy \"new\" again. The iPod Air came in original packaging and had the brand new look and feel. I saved some money and got a great product!! It was in my hands in 2 days from time of order. Excellent buying experience."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "The product was as descripted and works great! Very satisfied with it."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I received the IPAD AIR quickly.  The unit was in pristine condition. I bought this for my wife, replacing an Ipad 2. Cannot say\nenough about this unit. Being a refurbished unit you would never know. I would definitely buy again.  Warranty is the same as a new\nunit.  You cannot go wrong. I also purchased 2 year spills and drop warranty.  She loves it. beautiful screen and what can I say it's\nan apple."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "First one came inop, the capacitance touch screen would not work.  The second one works fine.  Both units looked absolutely new and came in apple factory packaging."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I am pleased with the purchase of the I-Pad-Air. It's light, and the speed is great. I am well pleased with the purchase!"}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "When I received it, it was in perfect condition, like a new one. My only problem is that I can't validate its serial number from Apple warranty check site."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "The IPad Air, refurbished, came packaged as a new ipad.  I am very pleased with it."}
{"rating": 3.0, "product_id": "B00HWMPKJK", "review": "IPad was great, front facing camera didn't work..... I will try refurbished one more time and hopefully there will be no issues...."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "It's really good ... Delivery on time ... I checked everything on I pad and everything is going well"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Love it!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Great price and Fast shipping, Could not tell it was a refurbished product. Looks and feels like new."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Product as expected to be, although refurbished it comes completely with charger, manual and box. The box is a blank box from Apple with no picture on it (as on the original one), but instead it says 'Apple Certified Refurbished'. In my case I just needed a nice-priced iPad and that's what I got, it works great."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "This is my first Apple product. I am very pleased with the speed and how easy it is to use. It is a reconditioned unit but it looks like new. Other members of my family are Apple users so I decided to take their advice and get an IPad."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "The item arrived in perfect condition, worked beautifully, and is a terrific option to purchasing a new iPad air. With the exception of the box marked  \"Apple refurbished,\" (as I assume it must say for legal reasons), it appears exactly as a brand new iPad Air."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "If you are looking for a product and don't want to pay the price of a new one, well a certified refurbished should do. The only concern one may have is the condition that the product may be in when it arrives. This one I purchased was in excellent condition and works just like a new one. I am comparing it to an iPad I bought my son a year ago and his works great. Square Deals is a business I would purchase another iPad from or any other product that I am looking for and if they would be offering it at the right price to suit my pocket. Good job guys keep it up the quality of your work."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "came as promised, and is in perfect condition!!! and less than what the Apple store sells refurbished ipads for."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "excellent value. Even though this is a refurb, it looks and perform as good as a new model."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "It came right on time! And exactly as detailed in the product description.. I've had it for about two weeks n it's been working perfectly.. I must say that the company that sold this item is one of the best that I've have experience! I'll surely be buy from them again!!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "It's apple, its an iPad.  You should expect this product to be great and it is.  I have a number of other tablets (Surface pro 2, Galaxy note ect)  and for simplicity and smoothness as well as easy of use, this is it.  There are some specialized uses that may make you want to look at other options (say if you need a good Wacom stylus), but for the general population this is probably the best tablet you can buy."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "As most already know the apple iPad air is a great device, it's a extremely thin and fast device, beautiful design and good value. But I think most people here will be interested in the condition of these refurbished models. The package arrived quickly and well packaged, upon opening I got a nice box packaged with all the original accessories and the iPad, the condition was almost perfect and the battery life was as new. Very happy, much better choice over buying a new model as you get the same item for far cheaper."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I got this for the office, so i don't need to carry it to the house and back every day. It synced well with all my office computer files, so I can take out on sales calls and visits. I use it for presentations. The ipad works really well, plus it has a great amount of space. for all my files. Definitely worth the price. Thanks for the quick shipment."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I always buy refurbished because the product is usually better than the way it comes from the factory. They work out all the kinks and it works fast and looks brand new. Thank you for the great price. I think I will get another one for my dad."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Awesome product. Ive been using it every day for work, email, and playing games. My sister bought it for me as a gift, and its great. Super crisp and clean display. Thank you for the nice deal, and thanks for shipping in time for my birthday."}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Did work properly when it arrived. Now can't get a refund. They won't return my message."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "arrived on time and exactly as expected. Great experience."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Like everything"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Good value - there were some minor scratches around the charging port but nothing beyond normal use. Came fully reset and ready to go - delivered on time - Id buy another iPad from here."}
{"rating": 4.0, "product_id": "B00HWMPKJK", "review": "Its very slow but what do you expect when you buy used iPods right!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "This apple Ipad Air was ordered to replace an older model used at a photo booth kiosk.  Being used in a public setting, this product has not let me down.  In constant use for several hours almost daily, I have had not had a single issue with it.  The packaging was minimal and wasn't in the original box, but I wasn't expecting that on a refurbished unit.  The packaging was adequate and the free silicone case was an added bonus!  Shipping was faster than expected and I am delighted with my purchase and the seller!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "Love this!"}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "AWESOME PRODUCT!!! Fast Shipping!!!"}
{"rating": 1.0, "product_id": "B00HWMPKJK", "review": "Weve tried everything short of putting a new battery in it. It simply will not hold a charge therefore we are sending it back and purchasing a new iPad Air."}
{"rating": 5.0, "product_id": "B00HWMPKJK", "review": "I love my new iPad.  I love that it is lightweight and runs efficiently.  It was easy for me to set up.  There isn't anything I don't like about it."}
