{"rating": 1.0, "product_id": "B00OTXGLW0", "review": "This is the first Apple tablet I bought. Unlike the iPhone 6 and 6 plus, the fingerprint sensor has been 88% accurate. Even on top of the manufacturer provided screen protector. However, it did not produce any additional value than the computers and devices I already have. With all the buzz and marketing articles, I am surprised to believe that consumers are still buying more tablets than Intel PCs.\n\n iOS 8 as a whole is not comparable to Android 4.4.4. Lots of things on iOS 8 have matched up to the Android version 1 year ago. The iPad mini 3 is comparable to Nexus 7 2013. On the apps side, there are about 5 to 10 times less free apps per category (File management, System tools, keyboards). The Swift key app fails to swype right out of installation and configuration although it worked on iPhone 6, 6 plus. That was frustrating. Nexus 7 2013 has swype right out of the box. The Youtube app proved to get stuck and sticky when you scroll the progress bar. I tested my internet and the same Youtube content on a different device. It was the app's problem but I'm surprised that the app's quality could be this bad. Play store and App store probably have the same amount of apps for users. But in App store, most apps are paid apps (sure, Apple wants your money of 30% cut). I could only find 1 free file manage app that mounts to my Windows share for watching a video. On Android, there are many more free apps but some may have bugs. Apple does not have control over the pricing of the apps but are you really interested in buying into those apps by saving on lunch bills?\n\n I expected the sound volume to be louder than HTC one m8's and my LG G3's. It turned out to be slightly less than LG G3's and a lot less than the boomsound of HTC's. I tested it when I took a shower. I rather just use my LG G3.\n\nFinally it comes down to pricing. Nokia just announced its Intel Atom based N1 tablet ready to ship before end of February 2015. It has similar specifications but priced at $240. Both are manufactured by FoxConn. It's fair to assume Apple took at least $160 from the $400 price tag. So I returned it Apple store and got my $400 + tax back"}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "comes unlocked to any carrier"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "The iPad mini offers you a great option that currently sits between the iPhone 6 Plus and the iPad Air 2 in terms of screen size.  This makes it more portable and easier to hold than the Air 2 but gives you more screen real estate than the 6 Plus.  The one key downfall is that it has the slowest processor of the 3.  However thats not to say that the A7 processor on the Mini 3 is a slouch.  For all intents and purposes, in everyday use, the A7 should fulfill all your tablet computing needs effortlessly.  Having used it myself for the last couple weeks, I don't find myself grinding my teeth due to performance.\n\nNew features added to the Mini 3 are a fingerprint scanner and a new gold color option.  While the new color option is purely aesthetic and a matter of personal taste, the finger print scanner offers some real functional enhancement.  It makes securing and unlocking the device so much easier.  Unlike a passcode, your kids cant just find out what it is and start making in app purchases.  And with the new Apple Pay feature, your purchases will be that much more secure.  Of course if you don't really take your iPad out much and no one else has any access to it, this may not be as important.  Thats not to say there won't be future utilizations of this technology that you may want to use.  But in its current state, its purpose is limited.  Since the iPad doesnt have an NFC chip, you won't be able to use Apple Pay to pay for items in a brick and mortar store using your iPad Mini 3.\nSo, its not necessarily the form factor or the feature of the Mini 3 that holds it back.  Its the value proposition it offers in relationship to the other iPad configurations currently available.\n\nAs mentioned, the only new features of the iPad 3 are a fingerprint scanner and a gold color option.  If those are not on your list of must-haves, there are other options within the iPad family you should consider, especially because the privilege of having those 2 new feature options cost $100.  Thats right, because the exact same tablet without the finger print scanner is available in white or space grey for $100 less and its called the iPad Mini 2.  Its still fully supported by Apple as a current product and it can still run the latest IOS.\n\nSo, lets explore all your options.\n\nThe iPad Mini 3 starting at $399 gets you the finger print scanner and the option to get it in gold.\n\nThe iPad Mini 2 starting at $299 gets you the same processor, support, warranty, screen resolution, and OS, just no finger print scanner and only 2 available color options.\n\nThe iPad Air for the same price of $399 gives you everything the Mini 2 and 3 has except for the fingerprint scanner or gold color option but you get a bigger 9.7 screen.\n\nThe iPad Air 2 for $100 more gets you a larger, higher resolution 9.7 screen, a faster processor, thinner body, faster Wifi and you also still get the Finger Print Scanner and gold color option.\n\nSo using the iPad Mini 2 as a base, here is a layout of the options you get and how much more you would pay for these options.\n$299 base price gets you:\n\n 7.9 Retina display\n A7 Chip w/ 64-bit architecture\n IOS 8\n 5 MP Camera\n\n$50 more gets you: (iPad Mini 2 w/ 32GB)\n\n 32GB of memory vs. 16GB\n\n $100 more gets you either: (iPad Air 1)\n\n Larger 9.7 Retina display with same resolution\n\nOr (iPad Mini 3)\n\n Fingerprint scanner\n Gold color option\n\n$150 gets you: (iPad Air 1 w/ 32GB)\n\n 32GB of memory\n Larger 9.7 Retina screen\n\n$200 gets you either: (iPad Mini 3 w/ 64GB)\n\n Fingerprint scanner\n Gold color option\n 64 GB of memory  (iPad Mini 3 w/ 64GB)\n\nOr (iPad Air 2)\n\n Faster A8X chip with 64-bit processor and M8 Motion coprocessor\n Improved 8MP iSight Camera\n Larger 9.7, higher 2048 x 1536 pixel resolution retina display\n Faster Wifi\n Fingerprint scanner\n gold color option\n\nIts easy to see why many professional reviewers are saying skip the iPad Mini 3 and get either the Mini 2 or the Air 2.\n\nBut why did Apple do it this way?  Personally, I think Apple learned something when they created the Mini 2.  Prior to that model, the Original Mini was based on the specs of the older iPad 2 (not Air) which created a feature gap between that model and their flagship model at the time, the iPad 4.  They sold it for $100 cheaper but it was a step down model so people who really wanted a flagship would have to pay the extra $100.  When they produced the Mini 2, they gave it all the features of the new flagship, the iPad Air, essentially creating 2 flagship models, with one just being $100 cheaper for a more compact screen.  This probably cannibalized sales for the iPad Air.  Many reviewers at the time were saying, just buy the Mini 2 and save yourself $100.  But now that theyve reintroduced the feature gap between the flagship, iPad Air 2 and the new iPad Mini 3, those who were on the fence about form factor but wanted the best features would be more inclined to purchase the more expensive iPad Air 2.\n\nIn conclusion, its up to you whether the value proposition offered by the finger print scanner is worth $100 or if the extra money would be better spent on other features.  If you want to have it all, the iPad Air 2 is the way to go.  If you can sacrifice the finger print scanner and gold color, then the Mini 2 seems like it would be a better value.  Mine will be going back to the store shortly, now that Im comfortable knowing that Ill probably happier using the iPad Air 2.  I might however, trade it in for the Mini 2 so that my family will have a current iPad around to use.  One nice thing about the Mini 2 and 3 being the same is that if I do trade it in, I can keep the case I ordered online for the Mini 3 and use it for the Mini 2."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great buy, no issues and have been using it since Christmas 2017."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "bought the older mini, because it was needed for a specific cradle. nothing wrong with it, came fast and works great"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "nice"}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "I love it. It had no imperfections, looked good as new. I noticed that it charges slow, I'm not sure if it's because of the charger provided or the iPad itself. This is my first apple product so I don't know much about them"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Bought this in the summer and it works great still. Would buy from this company again."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Beautiful device. No issues. Works like a dream, highly recommended!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "GREAT"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I love it! Great product. Apple never disappoints. Its compact but large enough to be very functional. I was skeptical about purchasing a used product but it was very nicely packaged and the condition was so new and pristine. I am very pleased with this product."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love this product so much I am currently writing my review on it. Had this iPad for a few years now and I am loving it. The latest update is causing some little glitches but apart from that the iPad is one of the best inventions. No complaints."}
{"rating": 3.0, "product_id": "B00OTXGLW0", "review": "This iPad Mini 3 was supposed to be refurbished but it has a crack in the top left corner of the screen and the charging cable and charger are not Apple products."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Compairing the Mini 3 to the Air 2 : having the two really makes the union worth considering. They complement each other and the Mini 3 makes traveling easier when navigation and features (builds) familiarity with both devices. The Mini 3 is comfortable to hold and a bit thicker for mobility rather than being too flimsy on the road or out and about,  Pros: dependability, light weight, regardless of phone service, there are free talk and text apps that still make clear,crisp calls. Typing and texting are also a plus which no longer is there true need for a cellphone. Get a good protective case durable for out there and this model is a winner. Flaws: not much, but the Air is faster and even better WiFi speed. The Mini 3 display is much much better than the Air 2 and sound a bit better."}
{"rating": 1.0, "product_id": "B00OTXGLW0", "review": "After 21 months my device stopped working. Don't know the reason. Although it's in a protective case (otter box) I took it out and and after a examining I felt heat coming from the bottom. I'm so disappointed that I won't be able to use my tablet for it's in tented purpose."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Best tablet I've ever had!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "A+++++ !!!!!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Arrived in perfect condition and as described."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Excellent product"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Good quality at a good price"}
{"rating": 1.0, "product_id": "B00OTXGLW0", "review": "No Simm card in the box or in the iPad! Now I have wait for one to be sent to me to use my device. What a pain in the butt."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "good present, my kids love it"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great device for watching youtube videos and reading books. Nice little tablet on the go!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Use this iPad mini almost every day and I love it! I bought it refurbished, but I could not find any signs of use when I first purchased it. It's battery life is wonderful, but it does take a while to get juiced back up to 100%. As a student, I find this a handy gadget when using academic apps like Quizlet, Notability, and more. But if you have larger hands I would recommend getting a regular sized iPad."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Apple always get it right"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I love my iPad Mini 3!  This is my 2nd one.  Only one objection. The earphone jack is hard to find at night."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Simply great"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "This is the version I like the most, so light and easy to handle...my fav."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Help!!!!  not even 2 years old. I pad will not turn on. what can I do?"}
{"rating": 3.0, "product_id": "B00OTXGLW0", "review": "I love it. Although it came a little broken but I didn't complain because it still worked."}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "Works great"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "One more Apple product that will serve me well for years to come. Quality product. I have no discrepancies to report."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Good buy like it a lot,Best Buy that I made this year. Small enough to take along on trips or vacation"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Good"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Just as expected."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "always love Apple!"}
{"rating": 2.0, "product_id": "B00OTXGLW0", "review": "I purchased this product and by March, it no longer worked. It turns on and goes to the Apple screen or charging screen and turns back off. Really disappointed."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "excellent product and great services"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Excellent"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "excelente muchas gracias"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I love this IPad, have had it a couple of years now and haven't had any problems with it."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "love it, perfect for running my business"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I bought my iPad about two weeks ago and am INLOVE. Before buying this one, I previously had the iPad mini first generation. I brought that thing everywhere with me and had it for four years however as new ones came out mine stopped updating which made it hard to continue on certain apps. Also with now attending college 16gb wasn't enough for m to do my research papers exc on it. I was stuck on deciding between the iPad mini 2 and the mini 3. As seen in another comment the 2&3 are identical other than the thumb scanner and the gold casing. That being said I was set on getting the 2 because of the price difference however I stumbled across an iPad mini 3 with 64gb for the same price I would pay for the 2. Despite mine being refurbished, it looks brand new and runs better than ever! I couldn't be happier."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I loved!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great price!"}
{"rating": 1.0, "product_id": "B00OTXGLW0", "review": "First of all let me say that I have a ipod 180gb and had an apple laptop for serveral years so before I say what I am going to say please understand that before this I have had no problems with apple. with that being said I will say that for square register the apple I pad was my only choice if I wanted to use a printer (portable) their is no other software on my ipad because it is far from user friendly the worst apple product I have ever owned.\ngreat for kids as a expensive game toy. but for any really work it leaves much to be desired. I have had it for 1 year and have yet to find anything it is good at besides square. The second square and star micronics makes a bluetooth printer for android I will sell this for $20 on ebay or amazon.\nLoved my ipod. loved my mac book pro. Hate the Ipad. If you are fine with limitations. No storage. lack of serious options. or have no technical skills this is the perfect product for you. Again i'm sorry I am so harsh but I have real work todo and this is not a real work product."}
{"rating": 3.0, "product_id": "B00OTXGLW0", "review": "does it go to IOS 10"}
{"rating": 1.0, "product_id": "B00OTXGLW0", "review": "The iPad worked well until after the 1 year warranty expired.  Unfortunately, the iPad then wouldn't charge and became inoperable.  I was quoted a $299 repair from Apple.  Not purchasing again based on that experience."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great"}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "Apple iPads are so great to use so convenient in this size. I bought one for myself and one for my daughter when we were few thousand miles apart to see my granddaughter. Now we are only nine miles apart but I'm busy working and so is she and I still get to FaceTime with my granddaughter in the evening."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "it is an Ipad."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Brand new just like they said! Runs great, excellent price and was easy to hook up to cellular!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "hours of entertainment at the touch of your finger"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Purchased as a gift for my wife. She had been using a Nexus for the last few years and was frequently frustrated by it. She LOVES the iPad."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "very happy good choice"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love the iPad. Up graded from 1st gen to 3rd gen, like the up grade and more memories."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "There was a small dent in the back, but works great."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "My son loves this! He's been using one since about 2 years old and his old one just didn't have enough memory to store all of his movies on. Since we bought this he has quite a few he is able to watch while we travel in the car."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "As good as the picture show, works great and I look like new"}
{"rating": 1.0, "product_id": "B00OTXGLW0", "review": "Purchased in USA ! Payed $439 and can't charge device!!! Received a European wall plug !!!\nUnbelievable !!!!!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great product"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "espectacular"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "great way better than ipad 2 the camera is a huge upgrade and much quicker and easier to navigate with 2 hands"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Looks brand new and works flawlessly"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "It's A Wonderful device and s o far so good!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Looks and works great!  Just what my husband wanted as he travels all over the world for work."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Thanks! The fact that expected from goods has come"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I have a lot of love for this tablet. To give you background information I am a techie who is cross platform with all the flagship devices. I think the iPad mini 3 is overlooked as a device. The TouchID is all the difference for me when dealing with app downloads and making purchases.\n\nWho Would Benefit From This Device: If you want something to read on that can also do audiobooks and comics, do cross platform readers, shop, and have a rich mobile experience that you can take anywhere with your phone and not notice much of a weight difference that has an extremely long battery life so you go do even more and needs something that charges pretty fast this is your man. Also, Apple struck a deal with Nintendo so there will be lots of fun.\n\nPerks: As long as your slate boots you'll get the newest updates. Cool software on both android and iOS. Can download movies to watch later with Prime. Has night filter. Resale value. Great kids software.\n\nCons: Price for what is offered. If I bought when it came out or didn't get a great deal used I wouldn't have ever gotten this. Ever. The account manager leaves much to be desired. So, if sharing you may not like this.\n\nAudio: The Bluetooth could be better and the audio could be better. Wish it had a DAC.\n\nScreen is not as nice as super amoled or higher resolution screens but it does the job.\n\nPersonal Experience: It lags on some games and is not as fast as other tablets and devices with ram and better cores but it does an okay job trying to keep up. I use for reading, music, low impact games, shopping, writing, reviewing, and keeping with me mobile. It's trustworthy on battery life and performance. It's great for video and photo editing, it's not perfect. No slate is, but it's pretty great. Right now out of all the tiny tablets on the market I choose this for the above tasks. If you need a snappier tablet you might consider a Nexus old gen. They always get updates too. However, could be harder on the eyes than the retina glass.\n\nOf all the tablets I owned I used two the most, IPad 4 and my old HDX Kindle. Weird, considering I'm an android lover right? While my phone was fine for my eyes some of my other tablets we them down. Optical coating is never in the specs but it's more important than you'd think at first.\n\nThere is no real wrong choice in tablet buying, buy for what you need and is most compatible with your other devices and subscriptions. IPad3 does not have compatibility with (Roku) :( or obviously droid watches. Just depends what you're looking for. This will work great for me!!"}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "Nice"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Apple products are awesome. And we got this one delivered on time"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "excellent"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Nice ipad and good price."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "good stuff."}
{"rating": 1.0, "product_id": "B00OTXGLW0", "review": "Absolutely a piece of junk. About a month ago, the ipad locked up and would not allow access. After going through many, many dealings with Apple, today we were notified that ownership could not be established, even though I have the receipt, because Amazon did not record the serial number. Now this ipad is useless to me."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love it!! Easy to set up and small enough to take to work with me and read on my lunch."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Good"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I bought this for the sole purpose of using with my DJI  drone because of the GPS capability and it works great for that."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "As described."}
{"rating": 1.0, "product_id": "B00OTXGLW0", "review": "Upon receipt of the iPad i realized that used meant it looked as thought had been continuously dropped over and over. Refurbished would imply that anything broken would be fixed. Its not a big deal to look as though is has been used. But this iPad had been used without a case and was very very weathered to be nice about it. The touch ID did not work no matter what I did to try and get it to work. I reset it to factory specs as well as make sure that it was it has the most recently up to date iOS that apple had out. But I kept getting the same error. This is the main reason that I wanted a iPad 3 for the touch ID. If the touch ID does not work then it's the same as having a iPad 2. Now that I have had it for a few days longer I realized that it randomly shuts of for no reason apparently."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Perfect"}
{"rating": 3.0, "product_id": "B00OTXGLW0", "review": "It is a good price point product. However, I needed something more."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Works very well, we use it all the time."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great price and I am in love! Works out great as a classroom device."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I love love love my mini and the price."}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "It was god item"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great accessory to use instead of a desktop or laptop."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "was a gift for my brother. He really likes it."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Very nice"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I love my iPad mini 3. It's the greatest."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Wife, loves hers!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Got this Apple iPad Mini for my dad as a gift, package came on time, was a little nervous as I took it out of the shipping package, the white apple box was all dented up, but when I opened the box, to my surprise the iPad was in tack, thank God, cause i was scare for a moment.  Anyway the iPad works really great, setting up was a breeze, cannot wait to see my dad face when he gets it."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Apple iPad mini is great!  Small enough to take anywhere and powerful enough for all my needs."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Amazing!! A+"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "use it constantly and love it!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "completely satisfied"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love it, love it, love it!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Best investment! Best decision! I did the comparison with mini 2 but this was less expensive and equally compatible. It is perfect! In size sound clean clear screen unblemished device easy set up great amount of storage, I highly recommend this device!!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "amazing"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Yes"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Works very well.  Great purchase."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Highly capable, very portable, useful for references and reading, fun for games."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "You honestly cannot tell that this cover is on your iPad. Easy to install with no bubbles. Worth spending the money and buying this over the cheaper competition. Far better.\n\nP.S. There are SO many reviews on Amazon nowadays that people write ONLY because they are compensated in some way for the review. Yes, these are detailed. However they are detailed because of the compensation. I am a REAL reviewer. I write brief but helpful reviews. Hopefully you'll click that my review was helpful so I can maintain this good standing. Thanks all and happy shopping! :)"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "It's just what I wanted"}
{"rating": 1.0, "product_id": "B00OTXGLW0", "review": "This is a sprint model iPad mini. Won't work with other carrier. It's not advertised as such and there is no way to contact the company"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "good"}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "Purchased awhile back but never got around to writing review. I originally purchased iPad for my son and wanted to activate service through Sprint but wasn't able to due to no SIM card. I instead had him use it via wifi only. Which works out just fine."}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "Amazing device only hitch is I am not able use it for  data tethering"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "My son loves it. perfect for him"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I love it. Battery is better than Mini iPad4. It arrived a day late. But we can't control mailing issues. Other than that, it was a brand new wrapped mini iPad 3 and includes the charger of course."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I love it just what I wanted"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "My daughter use it all the time"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Wife loves this especially finger print I'd ."}
{"rating": 3.0, "product_id": "B00OTXGLW0", "review": "good!"}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "great purchase"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I bought the iPad mini 3 for my wife and she loves it. The size is perfect and battery life is exceptional."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Fast shipping. Product as expected"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love it."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Awesome Tablet and love the gold color"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Wife likes it"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Just the right size"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great product, works flawlessly, very fast"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great product"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Thanks"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "good product"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great service and iPad"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I picked up this unit because I was looking to downscale from an iPad Air.  I also didn't need a state of the art device, but I needed better than my first-generation iPad Mini."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great product!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "perfect"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I got this for my birthday and didn't realize that I would be using it as often as I do.  A really great gift idea."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "This was a recent gift for my husband. He's really enjoying it."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great experience"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Perfect, thanks"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "#1`"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love it!"}
{"rating": 2.0, "product_id": "B00OTXGLW0", "review": "I was told by AT&T that I cannot get data plan on the ipad because it doesn't have an IMEI"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I LOVE IT!!!i can go two or three days without charging."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great iPad... I love it... fast shipping..Recommended"}
{"rating": 2.0, "product_id": "B00OTXGLW0", "review": "Why spend $100 or more just for a fingerprint reader and a new color combo?"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Impressed and enjoying it .  It's not so mini but much more small than iPad I had for the last 3 yrs .  Great fast delivery . Love my color choice (white). Volume slightly dull but not always needed ."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "awesome job!!!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "great value, fast shipping, sealed package"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "awesome!!!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great item."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Nice item for the money."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Owning an iPad Mini 3 myself, I decided to include it in contests that I run on my website. Delivery is quick and product as described. I will be ordering again!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I love the Apple iPad mini.  After purchasing the first iPad, I always regretted not getting the WiFi AND Cellular, so when I decided on this purchase, I knew what I wanted - Biggest Capacity and the ability to get away from Wifi if I wanted.  While I love the mini 3, I didn't like the fact that Amazon allowed a seller to advertise and sell a stolen iPad mini 3 to me.  That super sucked.  Even more, they did nothing to ensure the device made it back to the REAL owner.  If I wanted to get my money back, I had to had to mail it back to the bad guy.  I have the mini the five stars because it's wonderful, though."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I love the size of the iPad mini, because the size is not too big, yet you can see everything perfectly. It's nice because you can do a lot of the same things on this as you can do on a computer, which you can't do with other tables. Highly recommend iPads!"}
{"rating": 1.0, "product_id": "B00OTXGLW0", "review": "Just had it for about 5 months and the iPad went out no longer charges and no warranty. Aren't every procedures supposed to have 1 year manufacturer  warranty.? APPLE SUCKS no more apple products for me"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love it!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Very good product! Will buy again."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love my mini iPad..I had the first generation and loved that one but was super heavy..the mini is light and wonderful"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "love it!"}
{"rating": 1.0, "product_id": "B00OTXGLW0", "review": "Suck"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "love our ipad!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "awesome"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Gift to our grand daughter.  She loves it"}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "Good"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Amazing!"}
{"rating": 1.0, "product_id": "B00OTXGLW0", "review": "The product did NOT come with the lightning cable, even though the package says that it should be included. Either someone has intentionally taken in out, or it's an error. Both ways - major product complaint."}
{"rating": 3.0, "product_id": "B00OTXGLW0", "review": "Great but 1 of my products came damaged I now only have 1"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I use this ipad mini everyday best thing I've ever bought on amazon. I don't even use my laptop anymore there's no need! I even bought a keyboard for uni for thus mini and downloaded word for free! Very useful."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "My mom loves her new ipad"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Good product!!"}
{"rating": 2.0, "product_id": "B00OTXGLW0", "review": "This was poorly refurbished. There were obvious deep scratches on the screen, and the aluminum piece on the back was clearly a cheaper, thinner, and more translucent part than is standard for an iPad, and writing on interior parts were visible through the cheap material. Item was returned"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Yes"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Sufficient for the wife to enjoy streaming without anyone else requiring her tablet."}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "It's an iPad. Still wish Apple would fix iOS and allow you to set up video playlists.\n\nGreat, simple device for kids to use. Good parental controls. It's easy to get it setup with all their apps and then lock it down.\n\nGreat seller. Fast delivery. Good price."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "works great"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Good product"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love my iPad Mini 3, it is a perfect size for me and I use it several times a day.  I was happy when I received that package, the iPad was in perfect shape and I received it not long after I placed the order."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Purchased to replace an inoperable Ipad for wife. Great unit & she uses it daily."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Husband loves it !"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "It was a birthday gift for my grandson and he lived it!!!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I was nervous when making this purchase because the price seemed too good to be true. I could not be happier that I took the chance. Product was exactly as described. I didn't have to call to check on mailing etc. I received email updates and product arrived in pristine condition. I use my iPad daily and have no issues. I would buy again from this seller."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "What's not to like. Awesome product! Great price."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great fit well made Thanks"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Put this on my att unlimited data plan and my kid loves it. No problems with latest updates."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Amazing. The product was just as described."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Works just like it should. Use it every day."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I have waited a long time to get one of these. I am so happy with it. Love the gold color."}
{"rating": 3.0, "product_id": "B00OTXGLW0", "review": "the shortcvomings are more my doing"}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "Okay, I can't give five stars because, well, it's five stars, right? I don't know whether I got the best deal EVER on the web, but this purchase (Apple iPad mini 3 MH3M2LL/A 128GB, Wi-Fi + Cellular, Silver 2014 Model) is very satisfactory. Product is packaged as new and works as advertised. I did have a problem when I installed a T-Mobile SIM card and attempted to register it for the advertised T-Mobile \"Free Data for Life\" plan, but it was just a complication of the complicated sign-up instructions, not the iPad Mini 3! (Once I took it to a local T-Mobile store, everything got worked out.) Very happy with seller."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "It arrived exactly as described and on time! A great deal and my wife is very happy with it!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Bought it for my mom she loves it"}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "I needed a new iPad with more storage than the one I had - this one did the trick"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "My Grandson is enjoying it much"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "awesome"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I've had this iPad for over a year and I love it! Perfect size for me, works wonderfully and loads quickly."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I was pleased with my product."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Excellent; better than the one it replaced; extra memory is a bonus."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love the iPad but didn't love the fact that it didn't come with a SIM card.  My son was not able to use his birthday gift until I went to Verizon, bought a SIM card and had them set it up for me. Wish I had know that prior to purchasing so I could have given him a working iPad. I've purchased many iPads from Amazon and never once did I have to buy a SIM card. Product was new and in perfect condition and once it was working, it was a hit with my son."}
{"rating": 2.0, "product_id": "B00OTXGLW0", "review": "Pretty good"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "iPad was as exactly as as described, excellent seller."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Its an ipad, but smaller. I don't feel like reviewing an ipad. So, if you are in the market for an ipad but want something a bit smaller, here you go!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Exactly what I expected, great product"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "First Apple tablet that I've owned. The price and features with the 4G makes this tablet a cut above everything else."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I purchased a refurbished with 64GB, the box came dirty in the outside and when I saw it, I thought oh Jesus!!!... But I was wrong, the iPad inside looks in prestine condition... Not a single scratch, functioning as designed!!!!"}
{"rating": 1.0, "product_id": "B00OTXGLW0", "review": "0 star, Could not find any place for this 64 Gold iPad and there is no information for you to search for repairs, Just FYI I have to send it to electronic junkyard."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love this thing, the fingerprint ID is immensely useful. I use complex passwords and I have a hard time with the screen keyboard - thank you to all the app makers who support this option (still waiting for you to adopt it Wells Fargo...)."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love it!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great item for a great price"}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "Not as good as expected"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I have had a 32- 64- and now a 128Gb iPad mini. The value is totally worth the price for all the media I can carry with me."}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "received on time,product in good condition was received. price was super\namazing low."}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "The only negative is that it is a little smaller than I anticipated. My own error in researching"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "My new best friend!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Perfect"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "What else can I it's an iPad Mini, was a perfect birthday present for my son's grandpa.  He always wanted one and loved it when he unwrapped it!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I absolutely love my iPad. All features work as expected. The battery life lasts 11 hours, less if you are streaming movies with the brightness turned up. But I can still get a lot of movie time in.\n\nThe finger print scanner works great. Works much like the iPhone,which is to be expected. It feels lightweight in the hand.\n\nI haven't had any issue with crashing or anything. I am very happy with this purchase."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I have been using apple products since they first came out with the first iPhone. I have the iPad 3 original one, it was a little to big for everyday use. I bought the iPad mini 3 it's the best tablet out there. Easy to use fast great for movies, emails, games and more. I do currently use a keyboard case and makes typing so much easier."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Prompt delivery. Works fine"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love it!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love my mini ipad.  I am a first time user and it is simple and worth the price."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Excelent Product"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Until recently, I have been an \"Android\" girl. Last year I bought a 'brand name' (name withheld) tablet. And it was okay, at least I thought I liked it a lot, but then, I bought my daughter and husband, who are iOS users, iPads for Christmas. They used them for pictures, and videos, and many other things. The same as I did, but my pictures were grainy, and not clear compared to theirs. My videos next to their stunning videos, were laggy and jerky, and just not great quality, even though the one thing I really liked was the MicroSD card storage slot in the Android. Since then, I upgraded to my iPad mini and am LOVING the large 128GB storage, the crystal clear pictures and video that it takes, and the added security of the thumbprint scanner. I am now an iOS girl, just like the rest of my family."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "It's good working right now I am very happy to use this Product.its awesome\"its still working very great and well.i am very thankful to again  Amazon,they send me very wonderful product. Amazon such a very very great Inc.i love it \"Nusrat Nasim. Thanks again."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great Apple product at a great price. Shipped quickly and arrived with no problem."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Working very well for great price. My wifi  speed is up to 140mb/s, faster than my iPad Pro (90mb/s) and iPhone 6 Plus (80mb/s)"}
{"rating": 1.0, "product_id": "B00OTXGLW0", "review": "We got a dummy iPad where the serial number is a fraud. Whatever information we put in the iPad can't get retrieved."}
{"rating": 1.0, "product_id": "B00OTXGLW0", "review": "I received the iPad on March 8th and connected it to my apple computer which was fine.  A couple days later there was a new was a new iOS update.  Soon after the update the touch screen stopped working.  I took the iPad to the Apple Store in my area last night March 25th.  After further review the issue was with the iPad.  They changed it for me without incident.  I love Apple and my mini is perfect for my Zumba classes."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "enjoying it very well"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Amazing deal on a wonderful product! Totally recomend!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Daughter had a mini 4 but got water damage, didn't want to spend $$$ on another one so got this mini 3 that works as great, however since this mini 3 differs from mini 4, I had to buy a differnt pad case. Delivery was quick."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Very happy with purchase."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great IPad purchase!  Love it!  Top rate seller, thanks for answering my communications!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great product. Fast shipping my daughter loves it. Great price I looked around and did my research I would buy another one from them if I needed it"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "My husband does not ever use his regular ipad any more.  Just the MINI"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Nice tablet like the size can use in car"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Exactly as described! I am replacing an iPad mini 2 with 16 GB and I am in GB Heaven!! Would recommend to anyone."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "great deal great service and fast delivery thank you"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Terrific!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "love it"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Son loves it!"}
{"rating": 3.0, "product_id": "B00OTXGLW0", "review": "The iPad works great. But when I tried to activate the wireless wifi at Verizon it only worked for a day and then said no sim. Hopefully apple will be able to help."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I liked it"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I received my iPad on the day it said it would come which made me very happy and pleased! This iPad is amazing and came brand new sealed in the original packaging! I love it, totally worth to buy!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "The best Tab for pilots."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Exactly what I was expecting it to be. Been an apple user for the last few years and turns out you get what you expect from them."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "very good"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Very good"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "http://www.amazon.com/gp/product/B00OTXIVLO?redirect=true&ref_=cm_cr_ryp_prd_ttl_sol_4''\n\nI purchased this iPad as a gift for my seven year old. Her old iPad had a very little data and I am so glad I was able to get one with 128GB for a great price. I can store her favorite movies and all of her apps with room to spare.\n\nThe best thing is that she loves the size and says that it is just her size. This was the perfect gift for a perfect little girl."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great product,Very very low price. Get them while supplies last."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "What can I say, I love my iPad mini. Someone had stated in a review the mini came with a cover, it does/did not. Apple is not that generous."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great Ipad"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Excellent tablet"}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "I am satisfied. I got the wrong one at the first time then they changed it for me. It looks good and works well."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I love it !"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love this came in the original packaging could not tell it was remanufactured, with all accessories. No sim so be prepared to go to your carrier to activate. Would definitely buy another if I need one."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "It was in perfect condition thank you I really love it!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "iPad works great. I have the wifi + cellular and I took it to Verizon with no issues. They added their SIM card and now I'm connected. It had an apple SIM card in it so you should be able to take it to any carrier."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "It works perfectly for what I needed it for. The only thing I wasn't aware of when purchasing is that it would come with no English instructions and an international plug  for charging. Other than that it works perfectly fine and I can always get instructions online and buy a new charger."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Perfect size! I love it"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "i love"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Good things for the gift!!"}
{"rating": 1.0, "product_id": "B00OTXGLW0", "review": "iPad mini came with pad shape and lot of scratches. The home button didn't work probably. Stuck most of the time."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Exactly what I needed for a gift!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Nice iPad. We're using it in an office with a visitor badging/sign-in system."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great product and price!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "The device is excellent!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great n excellent."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Good"}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "All good"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "a+ Awesome"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Luv it, thanx, fast delivery"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "bought for my daughter - excellent delivery service to Hawaii, works well and we are skyping loads using it so that I can enjoy daily doses of my granddaughter on the other side of the world."}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "I was very skeptical when ordering this. I wanted an iPad that was wifi and cellular.. And I asked several times if it was wifi only or both and I got a different answer each time.. Ordered it anyways. Luckily is is both or I would have returned it. It's in perfect condition. I would recommend this product as long as you don't have questions for the seller. Giving it 4 stars only because of all the confusion. Otherwise it would have been a 5."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Finally a perfect sized tablet"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Bought a used one for my wife for Christmas. It was in pristine condition. Works perfectly. She loves it. I would recommend buying a used iProduct if going full retail isn't an option. I do also recommend doing you research and making sure you are buying a working product from a reputable source. I spent about 2 months prior to pulling the trigger making sure I got the best deal that wouldn't cause headaches later on."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "very good"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I love the I pad I'm very pleased"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Quick ship! My first Apple product. Love it!"}
{"rating": 1.0, "product_id": "B00OTXGLW0", "review": "This iPad was advertised as having a SIM CARD INCLUDED. NOT ONLY WAS IT NOT INCLUDED IT WAS IMPOSSIBLE TO INSTALL AS THERE WAS NO SIM CARD FRAME WITHIN THE IPAD. I have no way of knowing who is at fault. I just know that I have not received what I purchased!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "What can I say? It's an iPad and I love it. No complaints lol"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love my new iPad mini 3. Great speed. Super easy set-up. Highly recommend."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "This Apple ipad was a Birthday gift for my grand daughter and she loves it. Great price and was delivered with in two days."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I bought it 2014 and it still works perfectly and the charger is still working as well."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great product kids loved it and if you're wonder it's on iOS 8.4.1.(jailbreakable)"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Faster shipping, nice packaging and product is working fine......i wolud rate 5/5"}
{"rating": 1.0, "product_id": "B00OTXGLW0", "review": "I bought this for the memory..128. I don't have the cellular service yet but it is working just fine for my purposes which is mainly books and games for my Granddaughter. It was easy to register and I am very happy with my purchase so far.\n\nUPDATE: WELL IT IS BROKEN. I SENT IT IN FOR REPAIR AND $250.00 LATER IT WORKED FOR A FEW DAYS AND HAS QUIT THE SAME EXACT WAY IT DID BEFORE. i AM KINDA MAD NOW."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I upgraded to this and gave my previous one to my grandson.  A win-win all around. Perfect size!  Most people hold their phone all the time. I hold my iPad mini.  Great buy. Love it!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Super awesome tablet!! Outstanding delivery "}
{"rating": 1.0, "product_id": "B00OTXGLW0", "review": "Returned"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I am in love with this tiny iPad ,my 4 years boy with DS really enjoying it. I was so worried after I ordered it, after seeing other 1 stars reviews but when I opened my order I am so happy that it is brand new. Thanks a lot"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "so far its great"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I love it! Graphics are fantastic. I used to play a CSI game on my phone but it was hard to see the detail in the scenes and it took up too much space on my phone. I now play it on my iPad and the detail is astounding."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Item as described, Fast Shipping. Great Seller! Would shop again! A++++"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I was skeptical to purchase something like this off of Amazon, but it came as described and I have had no problems with it since I purchased it! Would definitely recommend!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "favorite christmas gift!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "It's perfect! I am not clear about the SIM card. Is it built in? I had expected to have or get an \"Apple SIM card\" Clerk in Apple Store told me I do not need a card. Message keeps appearing \"No SIM\" I would like to be able to connect when I don't have WiFi."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Bought this as a gift for my niece. She absolutely loves it! Is able to play all her games and watch videos with no problem."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love it!!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Still working perfectly!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Stepdaughter loves it.  Great product and timely shipping."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great. It was cleaner than expected."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Fast delivery. Good condition. Excellent quality"}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "Ok"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I can't give a very detailed review because I haven't been able to tear it out of my 12-year old's hands since it was purchased. Suffice to say, she is quite pleased..."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Brought it for my 5 yr old daughter and she loves everything about it. She used to have the regular ipad 2nd generation, but this was an awesome upgrade for her. She really likes that it's smaller and much easy to handle. We bought her an awesome case to go with it, and now she won't even look twice at her old ipad.\n\nLink for kid's case:\nhttp://www.amazon.com/gp/product/B00GAT1540?psc=1&redirect=true&ref_=oh_aui_detailpage_o00_s00"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Very nice Items. Fits my needs and very fast shipping.  A++++ Seller."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I bought as a gift & decided to purchased one for myself shortly after. Feedback - not too big & not too small. Just right! It's also very light & to go into detail about it would be exhausting. Ha... Several other reviews were spot on. My only problem is with the newer iPad Mini 3, FaceTime nor iMessage will work if you use a newer Apple ID. It did not work for my brother & after countless attempts at getting it to work failed I told him to try an old Apple ID of mine. It worked! If you run into this problem try using an older email address/ID to log in. That's if you have one."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Works great! It came a lot earlier than expected."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "My teen grandson has been using the iPad for a year, mostly for games every day. He likes it and has had no problems."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Still the best tablet!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "My all-time friend! The best item I have ever got in my life! I use it for reading, studying, browsing, playing and watching movies! It never let me down."}
{"rating": 1.0, "product_id": "B00OTXGLW0", "review": "Get the 64gig ipad. This one comes with nearly 5 gigs of BS pre loaded leaving hardly any room for anything new to be added to it."}
{"rating": 1.0, "product_id": "B00OTXGLW0", "review": "Received my iPad and it was dented in the back and the home button isn't working.  Didn't expect this, I paid over 300 dollars for a damaged device. The package was fine but the ipad wasnt."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Good pricing! Best product every"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "very easy to use; all apps I had on the old iPad loaded on this easily through ITunes; don't feel like I lost any viewing field from the original iPad compared to the mini although the screen is physically smaller; loaded Ios-8 on without a hitch.  No problems to date with the refurbished unit.  Very satisfied."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Excellent!!!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Awesome product"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Fantastic.  Husband loves it"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "It is a powerhouse device in a small package.  Very nice and usable with a great look!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Perfect, fast delivery and exactly as advertised"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "It is Ok"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "excellent product great price"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Came just as described"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love my iPad! So much you can do with it. It's great that I was able to get it for $100+ less than what I would pay at the Apple Store."}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "Nice size ...great picture,...easy to use ...what can I say its an Apple product .....their great !"}
{"rating": 2.0, "product_id": "B00OTXGLW0", "review": "I LOVED THIS IPAD. LASTED A  MONTH EVEN WITH METICULOUS CARE. THANK GOD FOR AMAZON RETURN POLICIES."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Perfect for everything"}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "I really like my iPad mini... its just that sometimes it keeps glitching and that sort of annoys me, but otherwise its okay."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "brand new and as described"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Very nice iPad.  Maybe not as fast as I expected but it does the job and I prefer the mini as it's light and easy to put into my briefcase."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Just got it on 15th December 2015. It's functioning alright. I have it to sync with other devices, take photos, listen to music, surf the web..."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "good."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love it and use everyday."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I needed one to save battles with my 4-yo over his one.\nThis was 2nd hand, but looks like new, and at a great price."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Original and perfect."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "well it was in great condition when it arrived and I turned it on and it looks really good."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I love this, except the finger scan DOES NOT WORK.  Neither does the Sari unless you have cellular on all the time which ups the data usage."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "All is Ok"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "so easy to use!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "This iPad is amazing I have had it awhile and thought it needed another awsome review! This iPad is perfect for me to watch movies and play games. It has just enough storage capacity for me to have all my music, movies, books, photos, and apps! I HIGHLY recommend this iPad!"}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "Very Satisfied with the choice I need"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "VERY VERY GOOD.THANK YOU."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Exactly as was described. Though I wanted wifi and cecullar but was not patient to read description so I got the wrong one that wifi only. Honestly this is my first IPad purchase and I feel I got a good bargain. Everything bout this product is great and I wonder what world I had been living in without one. Fast delivery and nicely packaged. Impressive and highly recommended."}
{"rating": 1.0, "product_id": "B00OTXGLW0", "review": "Not even 3 months and this iPad mini 3 completely crashed. Can not get it to turn on at all.\nI was a huge Apple fan until this, very disappointed."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I previously wrote a negative review on this, but recently found out I can print my own receipt by going to my orders link.  The reason I wrote the negative review was because I couldn't get a receipt.  So now that I have the receipt, I am very happy with my product."}
{"rating": 1.0, "product_id": "B00OTXGLW0", "review": "sadly it was defect"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Exactly as described.  Good price and fast shipping."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I'm Happy with my iPad mini 3."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "This user is slow in discovering its features so there is not much positive feedback that can be provided."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "It was a perfect purchase with quick turnaround time."}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "good one"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Excellent product and good price compared to other providers.  Extremely pleased."}
{"rating": 1.0, "product_id": "B00OTXGLW0", "review": "It simply stopped working after less than a year...."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great deal very good condition"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Work great , very happy with the product,"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "just what I needed and love the memory it holds."}
{"rating": 1.0, "product_id": "B00OTXGLW0", "review": "I took it to the shop and there was 16 screws missing on the inside. The shop also said that the home button was super glued. I had to over $100 to get it fixed."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Looks brand new and works perfectly. The box was dirty and worn but the charger, cable, and ipad are great."}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "A step up from my ipod touch. It is very satisfactory."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Item came in as described. Shipping on time."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Fine"}
{"rating": 1.0, "product_id": "B00OTXGLW0", "review": "IT WAS A GIFT"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "It great prices"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "My daughter loves it!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Everything ok!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Its cute small and you can take it anywhere. Easy to conmect to wifi. I use this for school when I don't feel like taking my laptop. I have this ipad linked to my iphone and mac..Really great device for someone's first ipad."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "good price for mini3 and the quality is prefect!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "My granddaughter loves her new iPad!  received item as promised!"}
{"rating": 1.0, "product_id": "B00OTXGLW0", "review": "I am so incredibly disappointed with this tablet. I had an iPad three for a few years and liked it well enough. I wanted something smaller so I decided to get this one. I've had it for like a month and now it has a mind of its own. If I use it for an extended period of time the screens just switch on their own. The apps go in and out, I have to turn it off. I mostly use this as an e-reader so obviously I mean to use it for a while. I've researched and it apparently is an issue with iPad minis. Now I'm frustrated no stuck its this tablet that irks when it feels like it"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love the mini 3 IPad. Perfect for projects than need a little bigger screen."}
{"rating": 3.0, "product_id": "B00OTXGLW0", "review": "i really don't understand what all the hub bub is about. i prefer the samsung."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Awesome buy"}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "Works as a portable word processor, iTunes music player or game player when you can't lug a larger laptop around."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Good product,  fast delivery"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "The best small tablet period."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love it!!!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Good"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "AAA+++++"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Works great! Love my mini!!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Got this for my daughter as she is going on a trip to Asia and she can download pictures and videos and keep in touch with us on wi fi."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "The perfect solution for my purposes"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love it!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I Like It"}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "Perfect except for the cord which didn't work for some reason..."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Everything I expect from an Apple product.  Works great and the processing speed is very good."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Super device---exactly as describes, shipped immediately!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "item received in time and as expected."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Working very well, especially for a learner like me."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love this little mini. Very easy to set up and operate."}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "Charger was iffy working"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Exactly what I expected!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Very good"}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "Great product, have had good success with Amazon and electronics!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I am thrilled.  I have owned and do own several other apple products and I went back and forth between this and a Kindle Fire but the reviews for the iPad are substantially better than the Kindle so I went for it,  Higher cost and all.  I am so not disappointed.  It took only 24 hours to get here(thanks Amazon shipping) and I started loading it and messing around with it immediately.  I wanted to give it a few days before I wrote my review and am even more pleased with it now than I was the day it got here.  And believe me when I say I have put this device through it's paces in just 3 days.  To be fair I have only own one other tablet like this device.  It was an unbranded Android waste of plastic and metal the same size as the iPad mini 3 so to be absolutely clear perhaps my standards are lower than some other reviewers???  Maybe not though.\n\nUpsides?\n\nThere are many.\n-It's fast. The first day I had a little concern because the TV shows I was adding were taking well over an hour to load each 1 hour episode but turns out it was my internet that was the problem as it has run as smooth as a baby's bottom ever since.\n-It's light.  I have a big new 6 lb HP laptop that's great but that 6 lbs gets HEAVY after a couple hours.  The thin and light iPad mini 3 is compact and light and when used with one of those cases that stands it up it is awesome.\n-easy access to iTunes and syncing with all Apple devices.  This is maybe my favorite aspect other than the performance.  ALL my devices are connected now.\n\nDownsides?\n\n-No sd card port without buying the separate adaptor.  Good move Steve Jobs.  You have to buy the device the the most space available that you'll need and use or buy an adaptor to use an sd card with it but I hear those are not very reliable plus the added issues of the bulkiness of the adaptor.  More money for Apple I guess. I got the 64 gb version.  Plenty room enough for me.\n-The cost is almost double what the Kindle Fire of similar design and capability costs but I think for quality you must pay more.  So the cost may actually be more of an upside?? due to the performance.\n-Not being able to download entertainment files from amazon prime. -that is the biggy downside for me.  I am a die hard Amazon Prime user and the app does not support downloads from Amazon at this time so unless you add it thru itunes or buy direct from the tunes store you can't download movies, etc.. from Prime.  That is the only real bummer for me.  But not enough to take away a star.  Itunes has more than enough goodies for the avid user..\n\nTo summarize, this was a great purchase and I would be more than happy to recommend an iPad mini 3 to my family and friends."}
{"rating": 1.0, "product_id": "B00OTXGLW0", "review": "This product does not work!!  the small low button is Break!. I need to replace.\n\nEste producto vino defectuoso. No funciona el botn inferior del Mini Ipad.\nTrate de retornarlo, pero me dice que ya expir el tiempo.\nNecesito cambiarlo."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "NIce"}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "I had issues with Facetime and iMessage, though, this is new ipad. For some reason, the battery doesn't last long at all..This is my 3rd ipad mini and first time encountered such weird issues."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love it!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great product !!!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Couldn't wait to get it. Finally got here. Very pleased with it. A struggle for me to get it set up, not the iPad, it was me. I'm not particularly good at the technical stuff but if a 76 year old can do it, I think anyone can!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Excellent product worth the price amazon is selling"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I received my iPad just as was stated when I placed my order. Everything was carefully package, when I opened the box my beautiful gold iPad shining and new put a smile on my face. Thank you."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Perfect !!! It's the same product you would buy at the Apple Store but the price is less at Amazon. :) So far it has been working amazingly and I don't see anything wrong with it. I would highly recommend this to all of my friends to buy !!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Beautiful and good quality case!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "best price"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "The product is absolutely good and service is also really good!!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Very satisfied"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "A bit of a learning curve from the kindle but it meets all expectations."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Nice product"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great! I love it"}
{"rating": 1.0, "product_id": "B00OTXGLW0", "review": "Didn't know it was refurbished and it's still defected!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I must say, this item came quickly and on time! I love it! I could not be any happier! I have nothing awful to say about this product! Another Great item sold on Amazon! Go purchase!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Received ipad on time, sealed in factory box, and was very satisfied with purchase."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I just received my items yesterday & I am very satisfied. The products arrived on time. The case is so cute & fits the mini perfectly. I am so happy that I selected these items. Thank you for outstanding service I will definitely by from this vendor again."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I love love love love love my iPad mini. Although, it would've been nice to have known that Apple was going to discontinue the iPad mini 3 back when I originally purchased this in July. However, I'm still happy with it. It works very well as expected from an Apple product. I purchased the mini 3 because it was basically the same price (at the time) as the new (condition) iPad mini 2. Why buy the new 2 when you can get the new 3 for the same price, right? The Touch ID is pretty handy when you don't want to keep typing in your passcode."}
{"rating": 3.0, "product_id": "B00OTXGLW0", "review": "A week later the price dropped and this was discontinued"}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "Very good product"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "good"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Everything OK"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Perfect condition! arrived on time & securely, very happy"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Arrived when said,, and was very satisfied with the purchase."}
{"rating": 2.0, "product_id": "B00OTXGLW0", "review": "The screen text sizes are so small that this is almost worthless compared to a say 2008 Mac Book 13\" despite retina display, etc. Buyers Beware!\nI'd far rather have a old bigger machine with a keyboard and the smaller size is vastly overrated! I own a LOT of Mac Book Pros. This mini is a VERY questionable device. Also the learning curve is STUPID!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great tablet. I'm an Android guy, but the price for this made it such a better deal than comparable Android tablets, I had to get it. I'm not going to go into the Android versus IOS debate. The only reason I docked my review a star is I have more app crashes than I ever did with various Android tablets (Nexus 7 2012 and 2013, Galaxy Tab S). This is likely a software issue. Hardware wise, you c sant beat the build quality of this tablet."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I bought this as a video monitor for my drone - fantastic screen that you can read clearly in strong light - probably the best size for daily use"}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "We use it for a drone monitor and app.  It works great for that.  It was the same as new"}
{"rating": 1.0, "product_id": "B00OTXGLW0", "review": "The iPad I purchased as new came preloaded with Version cellular, which I can not activate, so I paid extra for wi-fi and cellular and I can only use wi-fi"}
{"rating": 2.0, "product_id": "B00OTXGLW0", "review": "I bought this about a week ago and enjoyed it up until today when I turned it on & I couldn't get it to do anything!  I can't slide from one screen to another like I do on my full size I-Pad, I can't get any of the icons open.  I've tried plugging it back in even though it was not low on battery but that didn't help.  It seemed like as I used it this past week, it got harder & harder to get the icons to open.  If anyone has any suggestions, please HELP!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Just got my iPad mini 3 in today! This is my first Apple product. The gold color is gorgeous. Definitely have a lot of use for this. Works fast and smoothly. No compliments so far. Really really happy with this buy! :) :)"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Amazing!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great product,"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great device. Works perfect!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "nice"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Very nice ipad, great condition, came super fast............Overall, Amazing!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "This is the greatest thing since sliced bread! My new job will not allow me to access email on the road nor to upload my music and games. I'd be lost without this now. I use it every day."}
{"rating": 1.0, "product_id": "B00OTXGLW0", "review": "I bought one back in December of last year and received and iPad mini original instead of an iPad mini 3!!!! So I paid full\nPrice for new hardware when I could have paid way less. I thought maybe it was a 2 because when I got it I knew it lacked Touch ID. Amazon refunded me for that and I went about my way. The devices are very similar but I realized it when iOS 9 came out and there was no split view. Now I feel like not only did I STILL over pay but I got slightly older hardware than I wanted. Love my iPad mini 1 TBH but really disappointed that I paid what I did for it."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Enjoying my lightweight iPad mini. Perfect go traveling.  Put in my bag and go."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I haven`t had it for so long but I am very happy with this mini. Easy to use bigger than my phone and everything seems to be so much clearer when being viewed."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great product. Excellent."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love it! And fast shipping!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great price fast shipping"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great gift for my mother!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I love mine! Couldn't be more pleased with it."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "LOVE, LOVE, LOVE my new iPad mini 3! It's beautiful, powerful, and just WONDERFUL!!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "It's an iPad. What can I say? If you don't have one yet, what are you waiting for? Easy to operate and so much storage! Very satisfied."}
{"rating": 1.0, "product_id": "B00OTXGLW0", "review": "Product wasn't a apple original. Touch ID never worked and then the iPad wouldn't update...took it to my local repair guy, he told me that it is refurbished and apple puts a break on products from updating if there was a 3rd party fix. Nothing in the description said anything about it being refurbished or previously used...very annoying inconvenience to return this product...this is my first negative experience using Amazon Prime."}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "Perfect size for reading, surfing the internet, or watching movies on the go. The camera takes pictures a little grainy in low light, but in bright light it works well. Super easy to use if you are used to the iphone."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "128gig model hits the spot, great picture, the wifi is truly better and I can stream movies at certain places others cannot through wifi. Love it. And I see zero difference with the ipad mini 4 except price."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Same day delivery!!  Love my new Applie IPad Mini!!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I recently purchased the gold iPad Mini 3.  I purchased the iPad mainly for schoolwork and educational purposes.  It has incredible speed and a wonderfully clear display.  This iPad is offered in three colors: Silver, Gold, and Space Gray.  There are also three different storage levels to choose from: 16 GB, 64 GB, and 128 GB.  Though these options depend on what you prefer, I personally bought the gold, 64 GB because I save numerous amounts of homework assignments and download class notes onto my iPad.  You may want to choose a smaller or larger amount of storage if that suits you best.\n\nIdeal User\nThe iPad Mini is ideal for a student  looking for a handheld tablet that is fast, sleek, has most of the capabilities of a computer, at a minimal weight and size.  This iPad is easily portable and extremely light: weighing in at less than a pound.  Compared to having the constant weight of a computer in your bag, you will hardly notice the iPad is there.  An iPad can do almost every day-to-day task that you would usually use a computer for, such as search the web, write notes, check your e-mail, the list goes on.\n\nFeatures\nThe newest feature to the iPad Mini is the fingerprint sensor, which works amazingly.  I have had little to no problems with the fingerprint sensor and it always unlocks for me on either the first or second try.  This feature is a convenient way to keep your iPad locked and safe from people trying to access your iPad without your permission.\n\nI use my iPad primarily for searching the web and checking on online assignments.  While in class, I like to download the class notes onto my iPad, so I can have my own set of notes right in front of me.  You can also download apps to take notes on your iPad in word documents, on Adobe, or make a PowerPoint presentation.\n\nI also use the Calendar and Reminders apps that are already pre-installed on your iPad to list homework assignments, exam dates, and due dates for projects if I forget about them that week.  This is especially handy if you have an iPhone because the apps sync together so you can have access on both devices.\n\nOverall, this product is extremely useful for students and has many capabilities.  I hope this review was helpful in your decision of purchasing the iPad mini 3."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Users\nThe iPad minis ideal user is a student or professional who can utilize the device in their professional and personal life. A user should be able to maximize the devices capability and they should expect that it can fulfill their needs of a small technological tool to advance daily and work tasks. For example, some great uses are taking notes, checking email, light web surfing, google applications, calendar, and many more.\nCriteria\nIn order to sufficiently evaluate this product, I have examined its convenience and portability, user friendliness, and battery life. In regards to convenience, this device is very transportable because of the compact size. It is light and easy to slip into a purse, backpack or even a large coat pocket. Apple does a great job making their devices user friendly and this iPad mini is no exception. You will be able to navigate this device very smoothly because of clear instructions and display details. Although it is not a retina display, I did not find this to hinder the ability to fully function the device. As for the battery life, it can last up to a couple days therefore the device is even more reliable.\nProductivity\nOne of the greatest aspects about the iPad mini is how productive it allows you to be. You can have multiple Gmail accounts or other emails and it smoothly switches back and forth between them. Although typing long email messages on this device is not advised, you can still keep updated with messages and respond if it is brief. There are also many applications that you can install on your device for free: Notability, Google apps, Nook, Netflix, and social media outlets. These are great resources and tools to enhance your studying, work, or to just simply relax.\nBenefits\nThe benefit of having an iPad mini is that you have a small but effective technological device. It is portable and sufficient for assisting with the efficiency or completion of tasks. The iPad mini is a great tablet where you can send short emails, text messages, check social media, schedule meetings on the calendar, read a book, or be productive studying. This tablet would be a confident purchase for a consumer who wants to enhance their life with technology."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Well i bought the ipad 4 with 128gbs ,new in box here on Amazon for a great price. So i wanted something i can grab and go with. So i grab the Ipad mini 3 128gb here on Amazon too, New in box.. The mini fulls the bill great can't be the price and it goes where i go. if you want a min the mini 3 is the way to go and its not going to last any where and thats from apple !!! Get the Mini 3 128 why you can. Love it.  Amazon has the best price."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "It's easy to use and sinks up to my iPhone.  Small enough to fit in my handbag."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love it!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Everything was advertised, iit works superbly!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I got this for my father, so I can't say much except that I haven't gotten any complaints from him. He seems happy with it."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I bought this for my mom as an early xmas present! She said \" this is Beautiful! Item just as described! Takes wonderful pictures! Internet speed is fast, couldn't be more pleased!!\""}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "On time delivery  product delivered as stated."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "So far so good.  I've not had an Apple product in some time.  I've purchased all Android phones and tablets in the past few years but, I must say, \" I'm really enjoying my new iPad Mini 3.\" I was disappointed with the delivery delay due to weather but, UPS worked to get my package to me a day later.  I paid for one day shipping but, got it in two days instead, not bad."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "It's good!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Awesome product!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Bought for my husband . It's the second one in the house. Good size. Easy to use."}
{"rating": 3.0, "product_id": "B00OTXGLW0", "review": "Not a big fan of Apple products, they are too expensive and no manual to get started if you have not used there products before."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "great pad easy to use"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "The iPad was shipped very quickly and it is great to have a new, up to date iPad tablet.  Love it!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Yes I just love it. My I pad is everything I wanted in an I pad.\n  Barbara Burnette"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I love this. Very fast shipping and packed very nice."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I ordered this device for my wife.  Last Christmas I purchased the 16GB iPad mini for her but it could only hold a couple of movies.  I was trying to find the best price for a used 128GB but I thought I just spend the extra money for a brand new one.  The iPad came brand new in the box.  My wife is very pleased with this one.  Another reason I bought this model is they have great resale value.  Should my wife want to move to a newer version that comes out we could certainly put the sale of this one towards a newer one."}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "Looks good. But somehow the operating speed is kinda slow."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Perfect!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "IPAD works perfectly & was in original packaging.  Fast shipment."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Thank you, yes I received the IPAD and it was exactly what I wanted"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Arrived as promised. Great product!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love it!!!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I like the smaller size, fits the hand much better."}
{"rating": 1.0, "product_id": "B00OTXGLW0", "review": "All of a sudden my Ipad is not turning on and I can not find out how to contact you!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "It's nice so far"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love it came with everything brand new and one year warranty"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Good product"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Arrived in very good condition, came exactly as was described. i like the sensor part for the pass code. Very convenient to use, I adore it. I would recommend others to buy this ipad."}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "all right"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "It arrived on time and so far is working fine."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I have a regular iPad and got this to use with a Drone.  I figured I wouldn't use it much beyond controlling the drone, but honestly... I love it!  It's small enough to fit into a smallish purse, and it's big enough to read and write on.  It has pretty much completely replaced my larger iPad.  Plus I LOVE the gold color!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great price! Fast shipping!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "My girl loves it!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Arrived boxed in pristine condition, boxed, new within a few days, as advertised. Excellent."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "All good"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Hi, it is my first IPad, that is a great device, it works pretty nice."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Good and delivery was on tome"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "gave it to my niece for a birthday gift she loves it"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Works great, very fast process speed"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Awsum"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I live it.  It fits in my pocketbook and also takes fantastic pictures.  Plan on using it on my upcoming River Boat Cruise."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Very good"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "The extra $100 for Mini 3 is not worth it, but I give it a 5-star rating anyway."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "This Ipad mini is an Amazing yet. I love this Ipad as it was described. It's New and the only thing I missed in this ipad's box is Headphone, but the Amazon gave me partial refund for that, I am glad with that. It came in sealed packed as same as when you buy it from Apple retailer store. \"Nothing's difference than that\" 16 GB gold with Fingerprint sensor, I love it. I am giving 5 Star for this item."}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "good !"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "My first impression after comparing specs, was to select this model as a gift for my wife's birthday. After she received it, examined it, she was immediately taken by its simplicity and features! However, she desired one (if possible) thinner and with a larger screen. So, I am returning the mini 3 for the mini 2 air 64gb. Both models are an excellent choice and I look forward for OUR enjoyment!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love it"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "It does everything my i pad did and more.  Love it"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Awesomely fast, great display!  Battery life is great too..."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "It came in shrink wrap in brand new condition as promised."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "This is my first ever I Pad and I am so much enjoying it! Thank you to the Apple for such an amazing product!!!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Awesome!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Received quickly and extra bonus had a screen protector included.. Love it"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Awesome!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great Product! As described."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I just bought one and I REALLY LIKE IT. 64 gigs is plenty--I have a 128 gig Iphone for music. I also have an Air, but it's only 16 gig and I had to delete apps to keep it from maxing out. Also, the size of the mini is perfect. Get an Otterbox Defender case and you're totally good to go."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Box was a little dented on all four corners but no damage and the iPad works perfect! Thanks again!!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love this iPad"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Got here when it was supposed to. Was brand new and works great!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Awesome!!! Thanks!!"}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "Received well"}
{"rating": 1.0, "product_id": "B00OTXGLW0", "review": "I put a protector sheet over the screen, before I used the ipad.  Discovered the screen had problems after turning the ipad on to use for the first time.  The screen protector cost $45.00.  I returned the ipad. Out $45"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Came in a very timely manner and great product"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love the mini size.  And functions beautifully.  Will never use any non-Apple tablets."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Product arrived quickly. Was new in original packaging and operates well.  I am very pleased with this vendor."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Fed-X shipping was HORRID!!!! But the actual ipad is great!!!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great price and I love it."}
{"rating": 3.0, "product_id": "B00OTXGLW0", "review": "CPU on this is much slower than iPhone 6, iOS 8.3 visibly stutters in UI interactions."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "It's an Ipad, How can you go wrong!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Excellent seller love my ipad!"}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "Like this but 16gb is useless. Wish I had opted for more memory."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "good"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "As advertised"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Here very quick and perfect"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Excellent!"}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "I like it, but I find that it is easier to use my PC in handling attachments and forwarding received Emails."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "good product!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Good"}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "It works very well, just as new, without any problem, yet it did not come with a Sim card for the device. I went to a Verizon store and the sales representative  told me that I need to create an account for a new Sim card."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "great arrived on time"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I really like this. I like the Gold color."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "pricey, but doing great"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "iPad-mini arrived quickly, as described.  Screen clarity is much better than original version."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great Product"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "excellent product, the ultimate in technology"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I really the Apple products, I am very pleased with my iPad mini purchase"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Good!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Man, this is the best present that I've ever given myself. It came well packaged, quickly and it's mine ...all mine."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I really enjoy how light & compact it is."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Hubby loves it"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Satisfied"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love this little iPad. I have a regular iPad Air and this is just a wonderful little thing.  I listen to books.. it is fantastic just like the larger size.\nI am in favor of Apple putting more memories in all the iPads.. the one i purchased has 64G and I think that is the thing of the future."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Just what I needed"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I already had an I-Pad but this one is much nicer.  It came quickly also.\n\n  Thanks"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love it"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Exellent tablet"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "very nice--I was considering getting the bigger one as that is what my last one was but I am very pleased with the smaller size!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Nice service, excellent quality."}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "Great!!!! The reason I give 4 stars is the audio does seem to be low even though it was max out compare to iPad mini 2. Other than that everything seem to work fine. Shipping is quick."}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "I purchased this mini Ipad for someone in the family. I have not had a chance to use it because they won't let me. As far as I can tell this mini Ipad tablet looks nice, attractive, slimmed design and has more screen space. It came with standard accessories. Everything looks and works good except the USB charger cable. The cable found to be bad out of box. The cable is not the same as cable from Iphone, it is thicker and pretty stiff and does not charging the ipad. I reported the defects on cable and they said they will send a replacement cable, but have not received it yet. The cable costs no more than five bucks."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Fantastic"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Quick, perfect size,beautiful color"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love apple n all their products"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "excellent"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I Love the price and the profession way that the item was sold. I would  do business again with the company and recommend it to friends and family"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Amazing!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Good:)"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Excellent."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Wrong Order?? Hopefully you will see this (pls get back to me)"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "This iPad is awesome and the seller was great!!! Very helpful!!!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I love my iPad mini 3!  I have another tablet but this one if far better. It's easy to use."}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "I like it so far, I only use it to run my Drone."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I bought this for my son to use at college.  It is light weight and perfect for an Apple product addict.  I also bought a wireless keyboard and it comes in handy for long papers."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Perfect condition!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love it! iPad came on time and in mint condition. Setup was easy and swift. :)"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Just love it.  Ordered it at 9 pm and had it the next day.  Awesome"}
{"rating": 3.0, "product_id": "B00OTXGLW0", "review": "Flaw : I purchased a gold iPad mini not a silver iPad mini\nPro: it just looks awesome"}
{"rating": 1.0, "product_id": "B00OTXGLW0", "review": "About three-four months after buying it, a line appeared on the side of the screen. That line has been growing gradually and now is almost an inch wide. We are past the return/repair window, so we are basically stuck with a substandard item."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "So happy that I waited to find a good deal. I got the 64GB version cheaper than the 16 retails for."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great"}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "I like it, it arrived on time but it hangs sometimes especially when i'm playing games"}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "The size is good for people who like to read or surf and play the occasional game. The hardware is not great I hear but it'll do just fine for the occasional reading and surfing. I'd wait for a newer version with updated hardware specs."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "So far this is working great, I do wish it had more GB"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Very impressive"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Prefect"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Fast delivery, arrived brand new just as stated, great product !"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love it!!!  Better than any Kindle.."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Brand New iPad as described!!! Amazing seller!!!!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "The best 7' inch tablet ever so far!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "gift for my grandson, his father was happy, he was happy and so am i...great item, great price, wonderful delivery service..."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "It is better to buy iPad Mini 3 Wi-Fi with Cellular directly from Apple Store Online, because guarantee it will work! It comes installed with Apple Sim Card, it will work on all U.S. carriers, except Verizon. You have to go to Verizon for sim card. Apple offers free engraving, but apparently any ipads with engraving has to come from China, it will cause delay in delivery. I got my mini 3 with cell,  from Apple Store Online with engraving, I love it!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great buy! Brand new and would absolutely recommend"}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "I'm obsessed with what people think of me. Not a second goes by that I am not considering what other people think about my appearance, my worth or my image. I base my own self worth on what people think of me, so naturally I got an Apple. It isn't the best technology, the most customizeable, or the most affordable, but nothing when placed in your hand works faster at making people around you think more of you as a person."}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "Nice!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "very good"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Brand new! Excellnet"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "My first iPad and it's great"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great we love it. Fast shipping and a great product."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Gift"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Wonderful! The world in the palm of your hands."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "wife thinks its great"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I spend a lot of time in the bus and now I can use this time for reading :-)"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love this ipad it might be the same as ipad mini 2 but seriusly the touch id is perfect for an ipad. Gold = perfection."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Excellent product, delivered as promised."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great job all around."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "This product is absolutely wonderful. The iPad mini is the perfect size to pack up and take to class or on vacation. Not big or bulky like the iPad 2 I had prior. The metal casing has the quality feel that I expect of Apple's premium image. Everything works as it should and that's what I value with Apple products."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Amazing it does everything my computer can do love it. Got here quick and in one piece. Love it!!!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "An iPad has been on my wish list for a long time. I am very please with my purchase.  I have been a lifetime PC person so it is a slow learning curve.  The product arrive almost overnight.  In perfect condition.  I am very pleased."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Perfect!  Love it better than my android tablets.  Longer battery life, better screen, lighter, bigger keyboard pops up for typing.\nThis was my first apple product.\nI now have an iPhone too now.\nWish I had purchased Apple sooner."}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "For my first Amazon purchase, everything went well and quickly. The iPad mini is exactly what I need for my long flight to Hawaii. Excellent device and service!!!!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Wonderful, everything worked! I will purchase from this seller again! iPad was legit !"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Ordered for my grandson and he is very happy so far. Came on time and as indicated."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Excellent"}
{"rating": 1.0, "product_id": "B00OTXGLW0", "review": "Never by this item"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I'm very happy with this purchase."}
{"rating": 1.0, "product_id": "B00OTXGLW0", "review": "The Ipad was owned by some one before and I can't unlock it or use it!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Goes great with my new I-Pad. I highly recommend it."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "The best"}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "Handy product - vert versatile"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love it"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love it I can download lots of movies.exelent"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Enjoying as we speak"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I love my ipad mini 3.  I have an iphone and a kindle fire, and I was on the fence about getting an ipad.  I am so glad I did.  I love it!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "excellent"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Brand new, exactly as described, and a great price.  I appreciate these folks from Utah."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "great"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Fast shipping super price"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love it"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I think this iPad mini with 128 GB it's The way to go. I would recommend this to family or friends."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I love it !!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I love this iPad mini 3"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Good one"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "This is a wonderful device!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Freaking fantastic. Obviously smaller than the regular iPad or the IPad Air but it's better to carry. Nice job"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Fast delivery and good deal!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Very sleek and buttons are easily accessible.  The screen is very clear and the perfect mini size that I was looking for.  At first, using the fingerprint reader to set up was a little difficult, but once you figure out the same position your fingerprint will be it's a piece of cake! The thinness of the iPad mini 3 is the perfect size to fit into your purse or backpack.  The ios system is exactly like the iPhone, so this is perfect for Apple Product lovers!  The only thing I wasn't really impressed with is the picture quality with both the rear and front camera lenses. I feel like the photo quality is pixelated and fuzzy.  The screen is not too touch sensitive but not hard to swipe and switch screens either; perfect balance!  I would highly recommend this iPad Mini 3, especially to use with a cellular SIM."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "It was just as described"}
{"rating": 3.0, "product_id": "B00OTXGLW0", "review": "It arrived in a sealed box but there was a defect.  The Ipad mini would not delete photos.  The program kept crashing.  We brought it to an Apple store and  since they could not fix it, they replaced it."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "My precious!!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Awesome it work Great!!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "This iPad is perfect for my needs, the gold color looks great too !!"}
{"rating": 2.0, "product_id": "B00OTXGLW0", "review": "I would advise buying it directly from Apple because my experience hasn't been good. The device has been heating a lot and when I contacted the seller, I was told to contact Apple."}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "Good one"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Perfect!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Perfect! I love Apple phones and pads. I wish that I could afford one of their laptops"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love it!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Awesome iPad!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Got this just for reading books and news, check email and schedule. Works just fine and easier to hold than iPad Air 2 but for document editing and writing, I go to the iPad."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love this! I have had a few iPads, but I mainly use them for work. The iPad mini is perfect for home use, travel, etc. I almost got a different type of tablet or e-reader, but I am glad I went with this instead."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Works great; great size.  I am enjoying it."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "My product arrived on time and in great condition.  It works great and my niece was thrilled with her birthday present.  Thank you."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "This was for my granddaughter, she loves it."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Absolutely love it"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "What can you say it's Apple"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Apple Mini IPad is best"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Thanks you. Its good product !!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love it"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Wonderful iPad mini!"}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "The quality and the gold color is beautiful"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Got it on time and the wife likes it."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Perfect I love it !"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love it!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love it! Works well and I love the size"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Excelent!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love my ipad mini 3 with Touch ID"}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "Everything as expected. A few light screen scratches."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I love it!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Item was just as described brand new in box I love it in fact that's what I'm writing this review on a+a+a+"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Have iPad Air and iPhone 6. Didn't think I needed the mini but I use it a lot. Especially great with my DJI Phantom 3"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "My Wife loved her anniversary gift. It was exactly perfect."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "perfect process"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Totally love this! iPad cannot be beat, the mini is perfect for portability, I use it for work and personal tasks, reading, notes, absolutely everything. You cannot go wrong with the iPad mini."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Excellent delivery and product"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "great tablet - why buy anything else - this one is is the best"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "This was a gift for my granddaughter's 13th birthday and it was the hit of the night and she was able to purchase the case of her choice which made me the Grandma of the year.  Thank you"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I love the mini size of this ipad! It is perfect for traveling and carrying around."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Absolutely love! I used to own a full size iPad, the iPad 2 and I find this one MUCH more convenient."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Thank s very quick shipment and good price"}
{"rating": 1.0, "product_id": "B00OTXGLW0", "review": "Don't buy this is you are a Verizon customer - it is NOT compatible with Verizon."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love it!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I love my iPad. I use it everyday."}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "I changed from a 4th gen iPad, I really like the size and extra space on this unit"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Good quality of course and shipped fast."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I like it. It is very good."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Amazing!!!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I LOVE IT"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Purchased for my 8 1/2 year old grandson to replace another tablet that he received from Santa.  He absolutely loves it!  It's kid friendly and simple to navigate.  Basically works the same as an iphone.  Love, love, love it!  Can't wait to get one for myself."}
{"rating": 2.0, "product_id": "B00OTXGLW0", "review": "It works fine. It is not the gold and I don't know if it is the newest version. In any event it is not what I ordered"}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "Good price.  Does the job."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Bought this as a gift for my brother in law. They love it."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great product. Arrived as described."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Received the product before expected. Nephew loves it!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I went back and forth for months as to if I really wanted to buy it, and I'm so glad I finally did. It makes things like playing games, watching videos and shopping online so much easier and I can do it all without having texts pop up or even while using my phone at the same time.  Can't imagine life without it now!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "as expected"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Exactly as expected. Arrived quickly."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I usually use it for game. It is a nice iPad."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Good"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Excellent, I put iNAV navigation software on it and I currently using it for yacht deliveries and training."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "is everything you expect from any apple product\nworks swiftly and the retina display is something you think you don't need and think why paying more for it, but when you have it you know you did good\nsomething i love is the buffering capacity, it loads videos so fast and without lagging even in the crappy networks we have here in Venezuela"}
{"rating": 3.0, "product_id": "B00OTXGLW0", "review": "wonderful"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "It was great"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "It is really very good"}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "Nice"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Item as advertised... Very fast shipped ng"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Very handy!!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I am SO glad I opted to spend the extra and get the 128GB.  I have plenty of room to store everything.  Games, music, photos, videos.  It's great.  I do think that the forward facing camera lacks the crispness that i get with my iPod touch 5th gen.  I was a little disappointed in that.  I love the touch id.  Awesome feature.  the button feels a bit tough to push at first, but after using it is now easier and it is very responsive.  This iPad mini is  a great investment.  Perfect size tablet take on the go (It fits in my purse!!)  A+++ on this product."}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "Love it.  Have kindlefire and laptop; this beats them both.  Now I need iPhone!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I had a iPad 2 that just got old so I started shopping for a new Mini. this price was the best I could find anywhere at $317, no regrets."}
{"rating": 1.0, "product_id": "B00OTXGLW0", "review": "I opened my iPad and noticed the back was dented.  I turn it on and go thought the set up.  Create an apple ID, set up my email, and notice the screen seems to have lines in it.  I turn it off and turn it back on and it's freezing and the screen is shaking.  What the heck,? Returning and purchasing from Apple instead."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "fast shipping, great product"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "A++"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "This was a Mothers Day gift for my wife and she loves it. She still has a first generation iPad, but this latest generation mini is perfect because it fits easily in her purse for traveling and Fintie keypad that I ordered separately protects the front as well. Very light and the WiFi is very fast compared to the older models. Great resolution pictures and video also."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Like the size"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "This is the Apple product that I have personally owned. I do like it for the purpose that it was purchased for. There is a learning curve for me. It is a very sweet tablet."}
{"rating": 1.0, "product_id": "B00OTXGLW0", "review": "Not worth the price of a premium device, because the lift side of the screen does not register the touches and that makes sliding to go back in Safari for example impossible (you have to use the arrows instead) and you can't move icons from one page to another in the springboard\n\nAnd if that not bad enough, the iOS 8 has so many bugs, now I can't download updates of my Apps for some reason\n\nIt is a shame that Apple's quality have degraded like this"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Good"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Have got the speaker issue solved, needed to go to music and turn up there, did try at the settings. Wish these things had directions. The unit is very nice now that I can hear the tunes..But are there outside speakers that work with IPAD as the Ipod works with a round speaker that was 30$..but this Ipad will not connect."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love it; very convenient"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love my iPad.  This was my second (the first is with my son who is now in an iPad class at school).  I like the new features specifically unlock with fingerprint.  The gold is fine, not my favorite but it was the cheapest..... my cover hides it almost completely.  This fits quite nicely in my purse so I can take it everywhere.  I use it for most of my Apple needs since my iPhone doesn't have much memory."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Arrived on Time!  Best purchase ever!!!"}
{"rating": 3.0, "product_id": "B00OTXGLW0", "review": "too hot for summer,especially on right top half ."}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "Very good device"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "we absolutely love it!"}
{"rating": 1.0, "product_id": "B00OTXGLW0", "review": "Was not at all happy that this came as an opened items by previous purchaser. And not factory sealed by Apple. Did not state in in item description"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "EVERYTHING IT STATED THAT IT IS ABLE TO DO.  VERY FAST, AND I AM STILL LEARNING HOW TO USE IT."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Very very good after-sales service. Thanks."}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "Bought it for my mother as a present. She says she loves it"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Work great"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "As I'm sure you will soon realise this is not a technical review.\n\nI'm not a technical person, I can do what I need to do and that's it but I'm happy with that, I've never had or wanted a laptop I was more than happy with my iPhone until the first time I used an iPad and then I was in love, for me it was perfect, well nearly the only problem was the size, while I loved having the large screen it made it less portable and since its where I keep all my photos I end up taking it nearly everywhere with me.\nWhile this is my third iPad it's my first new one, my first one was my husbands old one when he upgraded and my second was my sons from a scheme at school which he didn't use, preferring his phone! and yes I've loved both but I felt a mini would suit me better and it does.\nI love it, the size is great, yes I can't argue there are times I miss the larger screen but not only does this fit into my bag it's so much lighter and easier to type on, the keyboard is just perfect and while I didn't realise it at the time the previous one had been a little too big.\nI can't not mention the screen the image is very sharp the pixel ratio must be good.\nKindle:\nLike all iPads it's fully compatible and that's one of the reasons when I was originally looking for an eReader I went with the kindle I liked the idea of being able to read a book on all my devices and have it sync and I use this more than I ever imagined I would, the kindle is always my first choice I find it's a lot better than the backlit screens but I like that I can pick up my iPad or iPhone and just continue reading exactly where I left off.\nWhile I'm on the subject of my kindle I use my iPad to keep it manageable, my previous kindle was slow and sluggish which was probably a result of holding over 3500 books so now I try to keep my kindle under 500 books and use my iPad for the rest. I use my iPad to browse and check Amazon, ordering and downloading books, it's all so easy, any book I want I send wherever I want it, my kindle, phone, iPad, cloud, my oldest kindle which I've given to my dad or my other kindle my daughter is using. As I've already said this is not a technical review and I'm sure you can do this on other tablets, I don't know but I love that you can do this.\niMessage:\nI use my iPad way more than my phone it's so much easier to type on so I iMessage from this, I have 3 friends that can't receive messages this way so if it's short I type it into my phone if it's a long message I type it into my iPad, message myself and forward it on, there's probably a much easier way of doing this but like I said I'm not technical and it works for me.\nFaceTime and Skype:\nI use FaceTime particularly when we're on holiday, since our children are older we often leave them at home and FaceTime means we can talk face to face as often as we like with no cost which is great.\nI have to mention the fingerprint id, I just love not having to type a code in every time.\n\nThe main thing I like about the iPad is it's easy to use, that's the most important thing for me any idiot can use it and yes, I'm including myself in this, I can even print from my iPad which I love and trust me it must be easy if I can do it.\nIt's compatibility is second and then reliability, I've never had any issue with any of my iPads, they just work and work well the first iPad, bought back in April 2010 is still going strong, my daughter uses it now.\nWhile this wasn't cheap I'm a great believer that you get what you pay for and I consider this money well spent I did upgrade the capacity as well going for 64GB since my previous one only had 16GB which ran out quickly, if you're thinking of buying one I'd seriously consider the size I know the price really jumps up but since you can't add more later it's important to consider it before you buy."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Arrived quickly and in perfect condition.  I've owned a few iPads in my life and this iPad has worked perfectly since day one so far.  I'm happy with my iPad and with my purchase from this Seller.  Thank you so much."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Amazing. It was incredible fast, and a great product quality.\nI would buy something again with this seller without any doubt.\nThe best buying experience I have had since I use Amazon.com"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "This latest version iPad mini 3 is a replacement for my original iPad mini. The speed, memory size, and particularly the Retina display are incredible improvments over what I had been used to with my old iPad. Highly recommended!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Help apps nutrition and health cooking recipe health network"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Just like the iPad Air 2 but in a smaller package"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great birthday gift!  Birthday girl really is enjoying the super clear display and easy use."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I'm very happy with my apple ipad mini 3."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great Deal Thanks!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I have had this iPad mini for about a month now and still love it:) Before I had the iPad mini 1 and it was great and still is but after seeing this (iPad mini 3 on craigslist) for only $200.00 with a keyboard and and lighting cable to usb I had to buy it. Keep in mind I bought this off craigslist.org so if Amazon says this is a unverified purchase thats why. I really like using the iPad mini with the keyboard its very nice and looks like a high priced machine. The keyboard is a little small so typing does take a lil getting use to. Before when I use to use my iPad mini 1 it was fast and just overall fulid, sure it lagged sometimes but the hardware inside is about 4 maybe 5 years old (hardware was first used in iPad 2 which came out 2011) but ever since I used my new iPad mini 3 you can tell a huge difference in speed performance and it does not have to reload apps as much as the iPad mini 1 does. With the iPad mini 1 I noticed I can have about 2 maybe 3 things open without having to refesh apps depending on what it was but with the iPad mini 3 I can have about 5 to 6 things open depending on what it is. One other thing I like about this iPad mini is how thin it is even though it is a little thicker then the iPad mini 1 it is still very thin and extremely light. Touch I.D. works everytime I have never had a problem with it. Logging in with touch I.D. is very convenient. I have the 16 GB model which is ok because I don't plan on having many songs and don't plan on putting movies on it. Out of the box I have about 12 GB. If you need more then 12 GB go for the 64GB! Because once you buy it you CANT upgrade the storage memory. Overall if you are looking for a tablet that works very fast that looks sexy and just overall feels premium go for this! But if you need to have the ability to get to the battery or upgrade the storage capacity then don't waste your time with this tablet. I have seen some people give this a bad review because it does not have high end specs like other Android tablets or does not allow you to upgrade the storage memory. The thing I have to say about that is don't listen to those people they are die hard android fanboys. They will make Apple sound bad just because they don't like Apple. If you like using a iPhone or the normal sized iPad then you will love the iPad mini. Also I don't recomend spending $400.00 for the 16 GB iPad mini 3 if your tight on money but want a iPad mini go for the iPad mini 2 it has the same exact specs as the 3 and its $100.00 cheaper. The only thing the iPad mini 3 has is the touch I.D. I got the iPad mini 3 for a amazing price ( $200.00 off craigslist with a keyboard and lighting cable to usb ) If you read this review and have any questions or comments please feel free to leave a comment:)"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "good product...good service by seller..."}
{"rating": 3.0, "product_id": "B00OTXGLW0", "review": "The time of delivery was fast.  The product was as I ordered it.  However, it actually looked like it was used because the box was marked up, with dents on the sides of the box.  When I opened it and looked at the ipad, the plastic protective sheets on the ipad looked all dirty and sticky.  It looks like it was used and returned.  It seems to work fine right now, but I am disappointed in its presentation as NEW because this was a gift.  I was embarrassed to say the least1"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great product."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love it"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "ILoveit!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "AAAA++++"}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "Wider and slightly heavier than the Samsung plus, but no complaints.  Like with any apple product, pricier, but what i like it the apple support.  Samsung products notoriously bad for customer and product support in the long haul."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "My girlfriend loves this little thing"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "So nice, my sister loved it !!!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Gift for my daughter and she loves it."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I bought it for my friend's mother, she is happy with it.\n\nThank you for amazon's good express and I got it in only three days, amazing."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love it!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I got this iPad as a gift for someone.  They love it.\n\nPersonally, I don't own any Apple products, and don't want to do.  But, the user reports that it has good battery life, nice size and weight and all the features of the larger iPad."}
{"rating": 1.0, "product_id": "B00OTXGLW0", "review": "I bought an Ipad with 64 gb but I received an Ipad with 16 gb,I need to fix it as soon as possible."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I've had it for a week now. So far so good! I mostly use it for gaming, very little work. It's the perfect size between the iPhone 5s and the full size iPad Air which is too big for me.\n\nI love it!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Loving my new iPad. I had a 32gb iPad 2 that passed away, so it was time to get a new one. I wanted something smaller, so this iPad mini 3 was perfect. 64gb is even double than what I had before too, so YAY!!!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Showed up just as estimated, great condition, I love it! Works very good with my online courses. Thank you!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Awesome!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "This is the perfect, perfect size for an iPad addicted woman on the go. It has 3G, it fits in your purse and yet it is easier to use the keyboard than on your iPhone."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Perfect."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Have no idea why a previous reviewer stated that the Mini 2 only went up to 64gb. I have both a Mini 2 128Gb wifi model and a 128gb cellular model for another family member. Just purchased  a 128gb mini 3 for another family member.\n\nWe all love our IPad Minis."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "This is a really nice and cheap place to buy an ipad mini I recommend it :)"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I love my I pad mini..... I'm getting used to it. I love my kindle fire better, or maybe I'm used to it..ill work with it for awhile and see how it goes...."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "It's an Apple mini iPad 3.  It's great.  I love Amazon reviews, but not sure what anyone would want to see in a review here."}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "Very good"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I don't think there is anything negative that you can say about an iPad.  Hubby loves it!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Excellent"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "The name Apple Ipad Mini speaks for it's self. Excellent product and no complaints here. Very pleased as usual with my product."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Excellent product and outstanding service!!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I have the Ipad mini 2 and it is great. I also have the mini 3. reason being I needed that 128gb. something the two doesn't have. it only goes up to 64gb. I need more space for movies games exe."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "light weight love it"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Our granddaughter just turned 18 and we asked her what she would like for her birthday.  She responded that she would love to have the Apple iPad thinking that it cost too much.  Much to her surprise, we got it for her.  After all you only turn 18 once!  I can see how much fun she is having with it now.  Especially the way she can use her artistic side as she deforms the faces in her photos.  She is living with this iPad in her hand!  Thank you Apple!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Goooooood"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love it!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Use very good"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Its an Ipad mini.  The thing is superglued to my hand.......enough said"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "The boys really seemed to like them."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I love it! My mother feel in love with it also! I had to purchase one for her."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Absolutely love the new iPad mini 3 - perfect for meetings and working remotely. I highly recommend this seller - super fast delivery and product as described. Thank you"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "This is just the kind of review I needed to read! I've been a lifelong Mac user, but never stepped into the tablet world. Making it clear that they only difference between the iPad Mini 2 and 3 is the 'touch' feature, I can definitely do without that and save a buck to boot. Thanks for this very informative, detailed review as it helped me make my decision!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Is very good"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "It's really good!!!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Excellent product. I love the large GB- I can store all my videos and power points for the classes I teach right to the ipad- eliminating the need for internet during presentations. The size and weight make it so usable and comfortable. I purchased a cover that allows it to stand up in either portrait or landscape."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I am TOTALLY pleased with my new mini iPad!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Perfect for a college"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love the iPad Mini!  Upgraded from an iPad 2.  Processor Much faster."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Excellent iPad. I actually was going to buy the air 2, saw a friend with this and liked it better than other friends iPad Air 2s. Having a ball with everything this slightly smaller workhorse can do."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Excelent"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I have been very happy with my mini iPad 3.  It's been great to access my mail, messages and searching the internet.  Still lots to learn. This is a transition for me for switching from android to Apple platform.  I'm looking forward to getting a new iPhone 6."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Never been a very big fan of Apple.  Prefer Android for my phones.  But this tablet is great.  Very nice display,  good size.  Runs fast.  Very impressed."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Everything is OK good and serious buyer"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great iPad"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "grandson says it works perfectly no problems. great price for grandparents. we paid about 370.00"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Good price"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "its an ipad, nothing else to say....shipping was fast"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "im loving my iPad mini 3."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Everything I wanted,"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "My mom has wished to buy a iPad since iPhone 4S was out, she is really happy with this new iPad mini 3! >w<"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "As described. In the original box. In perfect condition"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Ok"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "love it very much"}
{"rating": 3.0, "product_id": "B00OTXGLW0", "review": "The Mini3 replaced my original iPad.  Using the new iOS version is a challenge.  I would have thought Safari web page load speed would be faster.  However, I have not experienced any web page crashes because of the numerous numerous adware and scripts on webpages now.  This was a huge problem on my original iPad."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "What can I say that everyone else hasn't already. I was so happy when Apple started releasing products in GOLD :) I purchased this to match my Gold iphone and I'm not dissapointed. The retina screen display is crystal clear and I will say with this most recent release, the battery life is amazing! I can constantly play/use my ipad for most of a day and the battery doesn't die - i'd say it's several 6-9 hours+ worth of use! Only thing is with that, it does take a while to charge then. Not dissapointed at all - the product is exactly what it should be and works great - it's lightweight as well and I'm very happy with it!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "My wife loves it"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "This is my 5th purchase of this item and I am not an Apple product regular but the minis are an outstanding product"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "wonderful tablet !!!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great Product."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love my iPad!  I had maxed out the memory on my previous one so upgraded.  The size of the mini is better for me because I can pop it right in my purse yet it's easier to keep my To Do and grocery lists on than my iPhone."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Received early than stated date, brand new, great product, good buy love my iPad mini3!!!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Excellent."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I love my iPad Mini. It's easy to use and syncs apps with my iPhone which is awesome."}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "nice"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Thanks so much great product great price fast shipping recommend to anyone A+++"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Excellent"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Apple rocks.  Incredible performance, ease of use, and sleek design.  We have 3 iPads and this is our first mini - LOVE THE MINI!!!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love it"}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "Is very good"}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "It works great except for one recurring problem I am having where the wireless will not connect to certain routers, which makes it a bit frustrating when I am unable to use the wifi. Otherwise, it is wonderful. The picture is clear and crisp, it is more than fast enough, and I have no issues with lag. Other than problem with the wireless, I am very happy."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Exactly what was advertised couldn't ask for a better deal. Thanks....."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "good"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Excellent!!!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Good recommend"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Brand new!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great buy"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "excelente producto"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Just purchased and is the best tablet I've owned. Beautiful display as usual and the size feels so comfortable on any hand. Totally recommend it."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Always wanted an Ipad and this one rocks! Love how pretty and light it is. Now just have to buy a leather case to keep it safe and pretty. Offers tons of features, but actually bought it for the ebooks to replace my old Nook!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I love this device.  It makes my work so much easier, and it's so much more convenient than lugging around my Macbook Pro (when I intend to use the internet for leisure).  Touch ID is important to me because it's quick to turn on my display when I'm using the iPad to look at references.  I can describe the gold as looking very sophisticated, which is a relief because I was afraid it would look gaudy.  Overall, I am very happy."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "No problems-"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "A++++++++++ item.so good."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great product.  Just what I wanted."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I'm very happy with this purchase.  It arrived arrived well packaged and on time.  I'm enjoying all its features and useful apps."}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "I purchase apple for the longest time but this Ipad fell from my nightstand and I guess hit a sweet spot! Because it shattered a corner in such way that can't be repaired! I had it with cover and tempered glass screen protector!  I have drop by accident my phones and my older Ipad but this guy wow super delicate or simple bad luck!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Fantastic product from a great seller"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Another great product from Apple. I love it! I needed another E reader when my nook started acting up. I don't feel you can beat the quality that Apple puts into their products. I used a nook app to transfer all my books to this and even downloaded the kindle app. It can't be beat. Now I can search Ibooks, Nook, and Kindle to get the best price for any book I want. Plus the battery life is great and games and Netflix work amazing on it! Stop buying a product that frustrates you with problems, and spend the extra money for peace of mind and quality."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "This is my second Apple mini i-Pad, I will only buy APPLE products."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Always great to have a new apple product"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I use it for travel entertainment and light duty work such as note taking and working with Office applications (I did purchase the snugg).  Now I never leave home for work or vacation without it.  The battery lasts 10+ hours if continuous downloaded /6 hours streamed movie watching.  The battery has lasted 6 days on standby.  Even with the addition of the snugg keyboard cover, it is feather weight compared to other mini tablets.  The retina display is like looking at 3D graphics full time.  My only complaint is the speaker quality.  You will want good earbuds or Bluetooth speakers to compensate."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Apple fan... don't ask!!!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "My daughter loves this!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "My daughter won't put it down. My 2 year old grandson loves it too!!!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great product! Exactly what I wanted!"}
{"rating": 1.0, "product_id": "B00OTXGLW0", "review": "I found this information on MacRumors itselft.\n\nAccording to AnandTech review:\nThe iPad mini with Retina Display has the same color gamut as the standard iPad mini, which is narrower than the iPad Air and less than the sRGB coverage we normally look for. The biggest issue here is that there are other smaller tablets in this price range that do offer sRGB coverage (e.g. Nexus 7, Kindle Fire HDX 8.9).\n\nAnd the display expert Ray Soneira of DisplayMate Technologies: the iPad mini 3's display is a \"major disappointment\", and as a result, the tablet itself is \"embarrassingly mediocre and way overpriced\" at $100 more than the iPad mini 2.\nWith respect to the iPad Air, it has only 62% color gamut and it doesn't have either the anti reflective coating or the bonded cover glass. So in addition to washed out, under saturated and distorted colors (red tomatoes, fire trucks, and Coke cans look a bit orange rather than deep red, for example) it continues with a moderately high screen Reflectance of 6.5 percent, much higher than other tablets, which further washes out its image colors in ambient light."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Perfect"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "It's my oversize iPhone without a cellular connection. And I love my iPhone!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "excellent price and delivered right on time.  Would buy again without hesitation"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "#Very slick #NeverBoredAgain #JustWorthIt #MakesReadingEasier #WhatMoreCanYouAskFor"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Cheaper than Apple retail. Sealed well"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "It's everybit as good as my IPad2 ..."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I absolutely love my IPad mini.  It is the perfect size to hold. Not as heavy to hold as the larger size IPad. The screens clarity is amazing"}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "Own and iPad and now a mini, I'm hooked"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "it came on time my grandson loved it."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Ever Quick Service & A Nice IPad"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Well what can I say, it is an iPad! Perfect price and delivered on time!"}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "great price"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I already have the iPad 2 and loved that but I'm a commuter on a train during the week and this iPad Mini 3 is a wonderfully transportable size.  The display is crisp and I love the thumbprint technology just like on the iPhones.  Highly recommend this product!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Nothing to complain."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Happy so far.  Same as the old one, just needed more memory.  Shipped fast and very happy with this purchase."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "LOVE IT!!!!!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Excellent...!!!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "One word: Excellent. The person to who it was gifted to is almost inseparable from the product! :-)"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Works perfectly, very fast shipping! I love it!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Awesome product. Fast delivery."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "My Granddaughter was very pleased and she just loves it."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Got it as a gift! Perfect size. Great in every way."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "nice"}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "it does not come with headset!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I love it... I'm still learning how to use it.... my daughter  is the pro and love apple products.  when I have a question she helps me."}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "My wife is happy......."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Exceptional."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I ordered this a gift for my husband for Christmas and just getting around to writing a review.  He was super impressed with the new graphics and how fast this little monster works.  He was still using the original IPad from when they just came out 7 or 8 years ago (we gave this one to our 3 year old)  He also likes the surplus of cases and accessories that are available to choose from."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "My sister love her mini pad."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Excellent"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great product. Perfect packaging"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Christmas gift!"}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "Only wish it would allow you to sent and receive regular text msg's. As it stands now you can only send and receive im messages. looking for an app for a work around. Would have given it 5 stars otherwise."}
{"rating": 2.0, "product_id": "B00OTXGLW0", "review": "need more especifications for de celular use. i can not  use de celular calls. iam disapoinment very upset"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "good"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great product!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "A great item at a good price, thanks"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Bought as used at significant discount, but came nearly perfect condition. Even Apple's warranty status shows that product was only a couple weeks old."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "My daughter love it and it works very well."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Bought this item for my husband and I don't think he's put it down since it has arrived. Item was received on time and in perfect condition. Would definitely buy this again."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love this ipad mini 3, very happy with this product. I always wanted one of these and finally have it!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I am enjoying so far.  Looks and feels great."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Thoroughly enjoy this ipad"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "love it , nothing compares to ipad  ."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Perfect - great size, not too small and not too big to carry or to view.  Take beautiful pictures....  It is very easy to use (not all of apps) for grandma, too."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Arrived on time, as expected in OEM packaging. I prefer the mini over the bigger sized iPads for reading, watching videos, web browsing, playing games, etc. My younger kids seem to like them better as well. Overall good experience with the seller too."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Grate"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Enjoying my iPad. Perfect for me"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "so fast and it is very good."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Best mini on the market"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I love my Apple iPad mini 3, we have a regular iPad tablet and this is just my size."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Perfect in all ways. The handiest size for a tablet with a magnificent display."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Excellent product. Upgraded from a iPad 2 and this has features the other one lacked. The size is just right."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love this iPad mini. 3.  It is a perfect size for me.\nSpecs:\nHeight: 7.87 inches (200 mm)\nWidth: 5.3 inches (134.7 mm)\nDepth: 0.29 inch (7.5 mm)\nWeight: 0.73 pound (331 g)\n\nRetina display\n7.9-inch (diagonal) LED-backlit Multi-Touch display with IPS technology\n2048-by-1536 resolution at 326 pixels per inch (ppi)\nFingerprint-resistant oleophobic coating\n\nA7 chip with 64bit architecture\nM7 motion coprocessor\n\niSight Camera\n5MP iSight camera\nAutofocus\nFace detection\nBackside illumination\nFive-element lens\nHybrid IR lter\n/2.4 aperture\nTap to focus video or still images\nTap to control exposure for video or still images\nPhoto and video geotagging\nHDR photos\nTimer mode\nPanorama\n\nTouch ID: Fingerprint identity sensor built into the Home button\n\nWiFi (802.11a/b/g/n); dual channel (2.4GHz and 5GHz) and MIMO\nBluetooth 4.0 technology\n\nLocation: WiFi\nDigital compass\niBeacon microlocation\n\nFaceTime video\niPad mini to any FaceTime-enabled device over WiFi\n\nFaceTime audio\niPad mini to any FaceTime-enabled device over WiFi\n\nFrequency response: 20Hz to 20,000Hz\nAudio formats supported: AAC (8 to 320 Kbps), Protected AAC (from iTunes Store), HE-AAC, MP3 (8 to 320 Kbps), MP3 VBR, Audible (formats 2, 3, 4, Audible Enhanced Audio, AAX, and AAX+), Apple Lossless, AIFF, and WAV\nUser-congurable maximum volume limit\n\nAirPlay Mirroring, photos, audio, and video out to Apple TV (2nd generation or later)\nVideo mirroring and video out support: Up to 1080p through Lightning Digital AV Adapter and Lightning to VGA Adapter (adapters sold separately)\nVideo formats supported: H.264 video up to 1080p, 60 frames per second, High Prole level 4.2 with AAC-LC audio up to 160 Kbps, 48kHz, stereo audio in .m4v, .mp4, and .mov le formats; MPEG-4 video up to 2.5 Mbps, 640 by 480 pixels, 30 frames per second, Simple Prole with AAC-LC audio up to 160 Kbps per channel, 48kHz, stereo audio in .m4v, .mp4, and .mov le formats; Motion JPEG (M-JPEG) up to 35 Mbps, 1280 by 720 pixels, 30 frames per second, audio in ulaw, PCM stereo audio in .avi le format\n\nSiri  Use your voice to send messages, set reminders, and more\nUse hands-free\nListen and identify songs\nBuilt-in 23.8-watt-hour rechargeable lithium-polymer battery\nUp to 10 hours of surng the web on WiFi, watching video, or listening to music\nCharging via power adapter or USB to computer system\n\nTouch ID\nThree-axis gyro\nAccelerometer\nAmbient light sensor\n\niOS 8\nWith amazing new capabilities and updates to features you use every day, iOS 8 is the biggest iOS release ever. Learn more about iOS 8\n\niOS 8 includes:\n\nAirDrop\nAirPlay\nControl Center\nFamily Sharing\n\niCloud Drive\niTunes Radio\nMultitasking\nNotication Center\n\nQuickType keyboard\nSiri\nSpotlight Search\n\nViewable document types\n.jpg, .ti, .gif (images); .doc and .docx (Microsoft Word); .htm and .html (web pages); .key (Keynote); .numbers (Numbers); .pages (Pages); .pdf (Preview and Adobe Acrobat); .ppt and .pptx (Microsoft PowerPoint); .txt (text); .rtf (rich text format); .vcf (contact information); .xls and .xlsx (Microsoft Excel); .zip; .ics\n\nApple ID (required for some features)\nInternet access9\n\nSyncing with iTunes on a Mac or PC requires:\nMac: OS X v10.6.8 or later\nPC: Windows 8; Windows 7; Windows Vista; or Windows XP Home or Professional with Service Pack 3 or later\niTunes (free download from www.itunes.com/download)\n\nOperating ambient temperature: 32 to 95 F (0 to 35 C)\nNonoperating temperature: -4 to 113 F (-20 to 45 C)\nRelative humidity: 5% to 95% noncondensing\nOperating altitude: tested up to 10,000 feet (3000 m)"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "My husband surprised me with this. What a man!  He has been helping me to load it up and learn the features. It's just the right size for me. I would recommend to any who are considering."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "A gift for my wife and she thinks it is great!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Arrived early on day of delivery. Good product."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Chffh"}
{"rating": 1.0, "product_id": "B00OTXGLW0", "review": "Was suppose to recieve silver recieve space grey in shipment."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love, love, love"}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "There are still a few things that I do not understand"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "No surprise Apple product."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Perfect"}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "Its an awesome Device for college work. Beats bringing my laptop. To bad it doesn't come with the 32G, as 16G gets filled up pretty quick with software and such. The 64 is too expensive, I feel 32G is just right.\nOnly downside is It doesn't come with Earphones and a cleaning cloth.\nBattery Life last a very long time in the beginning, but then you see its retaining power decrease."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I LOVE this iPad. I am an owner of an iPhone 6, and I love it.  The iPad mini 3 is just like a giant iPhone.  You can do a lot more on the iPad than you can do on the iPhone"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Its awesome my 4 year old loves it.."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great price.  Fast shipping.  Love the mini more than the regular-sized iPad."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "The iPad mini continues to be an excellent, albeit pricey, tablet.  The screen resolution is fantastic."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Awesome!!!..Love it"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "It was received fast and I love it"}
{"rating": 1.0, "product_id": "B00OTXGLW0", "review": "Screen damaged and I have to pay for shipping back because I am in Canada."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Easy to handle lightweight!"}
{"rating": 1.0, "product_id": "B00OTXGLW0", "review": "It has been a big disappointment!  NO INSTRUCTION MANUAL THEREFORE THERE THERE IS VERY LITTLE BENEFITS FOR ME. (AGE 81)"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I like the small size. I am enjoying it."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "This replaced a earlier model with less storage capability. The larger storage with the new, brighter screen is worth it's price."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Excellent"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I bought my wife this iPad for Xmas. She loves it. In fact it has difficult to get her to put it down. She is a Pinterest junkie and this iPad is the perfect size for her."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "The gold iPad Mini 3 is perfect and I love it! It fits in my purse and it's awesome! I received the item very fast! Great purchase!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "It's like a miniature Ipad!!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Such an awesome machine. It's for my son, but I really want one now. :( It's the perfect size. A relative got the ipad air 2 at the same time, and i think it's too big. The mini size is just right at almost 8 inches."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "The I pad arrived on time and it was perfect. I love it"}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "All in all I like the iPad mini, the size is perfect for reading books.  That is the primary reason I bought it plus I use it for Facetime with my grandchildren.  The thing I don't like about it is scrolling from page to page online.  It is cumbersome to go back and find a page I was on before.  I find having to shut off apps manually is a chore.  I would prefer the app to close automatically when I stop using it.  I think if it were not for Facetime I would prefer a tablet that has a stylus like my Galaxy Note phone has.  I am still figuring out how to use the tablet though and might enjoy using it more as I become more familiar with it."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "This was a gift to my son who loves it! He had an iPad and upgraded to the new mini. No complaints, is super happy with it."}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "Really happy with the product. Fast delivery."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I bought this for my mom who is not computer savvy.  She loves it!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "The iPad is good, all meet my expectations."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great Products"}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "Real ool"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "as always apple is the best !!!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I have had Apple iPad mini with retina display 32gb which I gave to my dad (coz it's amazing). And now I got 128gb iPad mini 3 and the goodness continues!"}
{"rating": 3.0, "product_id": "B00OTXGLW0", "review": "Tgoo tiny of a screen."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Delivery was on time and as expected. It's an iPad!  There's very little bad to say about them! Good price on Amazon!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "This is so light weight., intuitive, easy to get going. All my Kindle library easy to access. Came very quickly.  I am no geek but find this is a bonus to use for email, text, news, internet, etc."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Got it for my wife for Christmas and it's a big hit!"}
{"rating": 1.0, "product_id": "B00OTXGLW0", "review": "The box of the iPad arrived opened. It does not have the original wrapped plastic. Did not have any at all which means the box was opened before delivery."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I love my ipad mini!. It meets all of my expectations and more . It was due to arrive after Christmas howwever it arrived the day before and I was so happy because it was for me. It was a very Merry Christmas!"}
{"rating": 3.0, "product_id": "B00OTXGLW0", "review": "He loved it"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Nice"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Perfect size for me, great screen and long battery life.  What is not to like!  The fingerprint scanner is great, just seems weird to have to use scanner and password for free apps from Apple Store.  Come on Apple, do you really need two levels of security for FREE apps?  I take this thing almost everywhere with me, very pleased."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Fast delivery good item I love it!!!!!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Nice!!!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I purchased this for my husband for Christmas. He is a very happy man."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "This was a gift but my daughter loved it & we received in a time that was a shock. I ordered it a one day & had it the next. Awesome!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Reads large PDF files in the iBooks app...very smoothly ? Great for school! SUPER FLUID EXPERIENCE."}
{"rating": 2.0, "product_id": "B00OTXGLW0", "review": "The seller sold as cellular; But every time I power up or change anything I get  an error message that says no sims card installed. I have some working knowledge of computers but I admit that the problem could be me, However I have attempted to contact the seller on two occassions and all I got was an automated response saying he got my email. That is what bothers me."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I just got this puppy two days ago, after my boyfriend dropped my mini 2 in the tub (don't ask, I still don't know).  Anyway, obviously the best feature about this is the 128GB.  Just adding 75 movies and still having space for music and other stuff made my day!  Then again, you'll have to pry my 160 GB iPod classic out of my cold, dead hands!  I'm not totally crazy with the silver/white and really wish they had it in black like my old mini (yes, I am a racist).  Overall, I loved my old mini and fully expect to love this one just as much!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love it!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Excellent"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Came on time & in perfect condition. Works great & no issues at all! Thanks!!!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Apple is the best"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "LOVE!!! LOVE!!! LOVE!!!!! It does everything the regular mini ipad does but better! Love the size and all the features! Just perfect :) My son has the first ever mini ipad and begs to play on mine. Sorry son lol"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I bought this for my daughter.  She loves this IPad Mini.  I wasn't going to purchase the IPad Mini 3 and had planned on purchasing the IPad Mini 2 as the only difference is the addition of the fingerprint scanner in the IPad Mini 3.  My daughter likes having this feature.  I found this particular item at a very competitive price, so I opted for this version."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I love it!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Awesome product!"}
{"rating": 3.0, "product_id": "B00OTXGLW0", "review": "Brand new, love the touch ID, and the sleekness of the device. Facetime is much clearer than on my iphone5. One thing I dislike about this product is the audio. It does not project nearly half as high as my iphone 5. It beinga newer version of technology since the iphone 5, I assumed the audio would be better. Unfortunately not; maybe it's just a flawed one."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "All that i think"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I just gave my iPad Mini to my husband (first version) and got this gold one for myself as an upgrade. I loved my first mini and presently my husband is watching a movie on it as I write this. He loves his \"hand me down.\" This new gold one is out of this world though. I am an artist so the visual clarity and beauty in this newest version is beyond compare. It is just breathtaking.\n\nI have two regular iPads (versions one and two) plus a Mac Air. I love the Mac Air and almost found the regular iPad too close to the Mac Air (I got the Mac Air after the iPads). The Mac Air with the iPad Mini, newest version, is the best combo. There are simply things I cannot do on an iPad that I need the Mac Air for. For example, I do a lot of complicated things in Keynote and Pixelmator. The iPads have their own great versions of those programs but when I need to do something complex, only the Air will do. So when I want to relax with something truly light, portable, fits in my purse, or even in a holder around my neck, I switch to my mini. Those two cover everything I do. I still use my other iPads but not as much. It is the perfect size for doctor's offices, hospitals, restaurants, rec centers, coffee shops, for showing friends things, and so forth. So this is now my top recommendation. Get a Mac Air and an iPad Mini.\n\nI originally for the first mini got only the 16G. For this newest version I got the 128GB as I don't want to be bothered with worrying if I have enough room left on it. I only get the WiFi enabled because everywhere I go has WiFi. I also got the Apple warranty.\n\nI only have one cautionary note. Apple will no longer let you use someone else's connectors. So you must continually get all your cords and chargers from Apple or you'll get an annoying sign that says it is not Apple compliant. On every Apple product I've owned, these cords do not hold up. It has now gotten to the point that my husband has decided he is duct taping them industrially from the moment they first come in the house. I finally agreed with him today as my Mac Air cord split. These cords are not cheap either.  That is my only criticism of Apple. It makes terrible cords for all of its products. So go out and buy yourself some industrial tape for taping it up at its weakest point.\n\nI switched to Apple from PCs for Xmas of 2006 and have never looked back. My husband followed me. We are both seniors and use technology all of the time.\n\nI got the zoogue thin case to go with the mini. i've tried just about every case and the zoogues always win hands down."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Delivered on time, perfect. This was a new iPad to replace my original."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Very happy, will buy again!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "The iPad is very good"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Nice!!!!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "works great"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I purchased this item for my grand-son who is extremely happy with it."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "This was a gift to my husband. He loves it. I may have to sue now for alienation of affection. Sigh. ;-}"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Item as described. Delivered when promised. Love it!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Amazing,perfect!!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "very good"}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "Sleek. Fast. Smart. I think this is the perfect tablet size. Small enough to be portable but big enough to allow easy Web browsing and pleasant video viewing. Not many cases are availible in my area."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Definitely my daughter's FAVORITE Christmas gift!  You should have heard her scream when she saw it Christmas morning!  She sounded like she'd won an Oscar!  Happy New Year!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Excellent, arrived on time."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "This was a great purchase!  I like the size of the screen, and it is a lot more manageable than the full size ipad."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "The best tablet ever"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Fast shipping. Everything was Ok."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Believe the hype. Best Ipad yet."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "My wife is very happy with her new I Pad mini, and I liked the deal and service"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Excellent"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Excellent"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Bought it as a Christmas present for my daughter. Its easy to carry around, yet not as small as I thought. What I understand the mini 3 is the same as the mini 2 but has the Touch ID. If you are looking to save and don't mind not having the touch ID than get the mini 2. Yet the Touch ID is convenient."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "This I Pad Mini met my expectations!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Bought it for my husband.  He loves it."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Amazing perfect small but useful!"}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "For only $100 more, might as well get the Air 2"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "showed up on time and was brand new. I got to take the plastic off the box and everything."}
{"rating": 1.0, "product_id": "B00OTXGLW0", "review": "It worked for an hour, then stopped working! This needs to be replaced. What is the procedure?"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I love it's convenience and bright screen!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Very good"}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "I gave it as a gift and she loves it."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "It was great and arrived all the way to Guam very quickly. Had to cancel Best buy as they sent for a christmas present on the slow boat.  Thanks again. I would buy this again."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Gave it to my wife and she loved it!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Nice"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Fast and accurate."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great product."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Excellent!"}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "Functionally everything I expected, but a little on the expensive sid."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great tablet!  Easy to use"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I love it"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Excelent!!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "So cool. I love it so much !it is so much fun!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "So far this small I pad is fantastic works like a charm. Very happy with this purchase."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Amazing size. I'm a woman and I find it much more convenient than the iPad 3 that I had before. Love love love the fingerprint scanner! Finally!!! WouLd recommend. Also, this seller got it to me way sooner than expected. Very nice perk!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "As all Apple products, It simply works as advertised. No crashes, reboots, hangups, etc. As a former android and Microsoft user, Apple's reliability is a welcome change."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I am so happy to have this iPad mini."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "It's newer, faster, and smaller than your old iPad.  Now with finger print dohicky."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Love it!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "A gift for my 11 year old grandson.  He absolutely loves it!"}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "It's a very good iPad. Bought it for my grandson"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Good Price, Fast Shipping"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I love this this little iPad. Very clear screen, long battery life. The bonus was that it was the best price on the internet."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "I actually downgraded from the iPad Air (not the 2) but upgraded from 16 gb to 64 gb and im so glad i did.  I can now keep all my pictures and videos and games on the ipad without having to delete or move them somewhere else. This ipad also has no trouble running tons of apps at once,  and is very responsive. The gold finish is incredible and sleek. Excellent device."}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "Pros:-\n\nMetal unibody, 7.5mm slim, 331g of weight\nOptional LTE connectivity (Cat. 4, 150Mbps downlink)\n7.9\" 1,536 x 2,048 LED-backlit IPS LCD with 324 ppi pixel density\nApple iOS 8\nDual-core 1.3 GHz Apple A7 chipset, M7 motion co-processor, PowerVR GX6430 GPU, 1GB of RAM\n5MP autofocus camera, 1080p@30fps, 1.2MP front-facing camera\n16/64/128GB of built-in storage\nTouch ID fingerprint sensor built into the Home button\n6,471 mAh battery\n\nCons:-\n\nNo microSD slot\nPricey memory upgrades, 32GB version should have been standard\nNo NFC connectivity, Apple Pay has limited functionality\nApple iOS 8 still relies on iTunes for music and file transfers"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Cool"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "The iPad mini came in perfect shape. Almost brand new. I'm totally loving it!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "i love it"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "If you're thinking about buying an iPad Mini, you should strongly consider buying last year's model (the 2013 iPad Mini 2, formerly called iPad Mini with Retina Display) instead of the iPad Mini 3 that came out in Fall 2014.\n\nThey are almost identical: EXACT same processor, EXACT same display, EXACT same battery life, EXACT same hardware and dimensions, and they run all the same apps EQUALLY well. The only thing you get with a 2014 Mini 3 that was not on the 2013 Mini 2 is the fingerprint sensor (and a new color option: white front with gold back).\n\nThis fingerprint sensor is the same one that's on the iPhone 5S and later models. It has limited usefulness on the iPad; it's more useful on phones, since more and more transactions will be done using phones instead of actual credit cards.\n\nSo, if the Mini 3 and the Mini 2 are virtually identical, why buy the 2? Because it's cheaper. Apple still sells the 2 for $100 less than a comparably configured 3. But you can save even more than $100 if you shop around, because many retailers are clearancing their inventory of last year's Mini 2. Two weeks ago, I found a Mini 2 with cellular and 64gb at B.B. for $150 less than a comparably configured Mini 3. I bought two--one for myself and one for a family member for Christmas. Unless you really want the fingerprint sensor or the new white/gold color combo, skip the Mini 3 and save yourself $100 or more by purchasing a Mini 2 instead.\n\n*** iPad Mini compared to iPad Air ***\n\nI bought an iPad Air when it came out in Fall 2013 and love it. It's extremely fast and the thin/light form factor is amazing, especially compared to earlier full-sized iPads. I know the 2014 iPad Air 2 is even better in some ways: a bit thinner, a faster processor, better cameras, and a new display that according to iLounge is slightly improved. But the 2013 iPad Air is so great that this is the first time I've not felt compelled to upgrade.\n\nThe iPad Mini 2 (formerly called \"iPad Mini with Retina Display\") came out last year about the same time as the iPad Air. Unlike the original iPad Mini from 2012, the 2013 Mini 2 is not a crippled iPad; it is virtually as powerful as the 2013 Air. It's essentially a 2013 iPad Air in a smaller package.\n\nWhile the Air is amazingly thin and light for a 10\" tablet, the Mini 2 is noticeably smaller and lighter, which makes it easier to hold in one hand for long periods of time and also much easier to travel with. There are times when the Air's larger screen is important--for example if I'm reading a textbook or a large-format magazine on the device, or editing a giant Excel spreadsheet. But most of the time, I'm equally happy with the Mini's 8\" Retina display. The Mini 2 runs processor-intensive games and apps virtually as well as the Air, which is to say very well indeed.\n\n*** iPad Mini compared to Android and Amazon tablets ***\n\nIt's true, you can get a 7\" or 8\" tablet for less money than an iPad Mini. Amazon's own 7\" Kindle Fire HDX is very good and much less expensive, as are some Android tablets.\n\nA good Android tablet can do most everything an iPad can do, or even more. While each operating system has its loyal fans, in fact Android and iOS are both very good and, at this point, very mature operating systems with a large catalog of apps. Android OS is much more customizable than Apple's iOS, which is important to many Android fans.\n\nI kind of don't recommend Amazon's own Fire tablets. They are essentially Android tablets with some of the Android features stripped away in order to keep Amazon content in front of the customer. If that doesn't bother you, Amazon Fire tables are very good and affordable, so they are worth your consideration.\n\nI am fortunate that I can afford to spend more to get the device I really want. And to me, it's worth paying more for Apple devices. I prefer iOS to Android and I like the hardware Apple uses and the build quality of iPads. But others prefer Android devices and I can't tell you my opinion is more valid than theirs.\n\nIf you decide to buy an iPad, you almost certainly will be happy with your purchase. iPads have a very high owner satisfaction rate and a very low defect rate. Apple customer service is absolutely excellent. The hardware and software are great. The only remaining decision you have is: which iPad?\n\nFor me, the iPad Mini 2 is the best choice for the reasons I gave above. It's very powerful and fast, the Retina display is great, the 8\" size is light and super convenient, and best of all it's much cheaper than the new Mini 3 despite being virtually the same."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "The iPad Mini is incredible. You can use it for anything, from gaming to financial purposes. You can also add various fingerprints. It is also crazy fast and amazingly thin. There are also several camera options, including Panorama and slow motion. Probably in my opinion the best Apple product."}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "I like it .It is best and working fine .."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "thx"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Excelente condicin!!!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Arrived very quick. iPad was as advertised. Even got a brand new lightning cable that won't fray where Apple cables usually fray. A+ product and service."}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Great product, delivered on time, in nearly perfect condition. IPad works great, I am very happy with this purchase!"}
{"rating": 1.0, "product_id": "B00OTXGLW0", "review": "The iPad came with dents and scratches on three corners.  No where does the description say refurbished.  I will be returning this iPad!"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "nice!"}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "It works"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Fantastic device! It's a great size for viewing streaming TV or video, yet small enough to travel well. I have become so much more productive having the iPad Mini. Lots of great photo apps to make posting my Etsy shop items to social media outlets much easier."}
{"rating": 4.0, "product_id": "B00OTXGLW0", "review": "Absolutely love this"}
{"rating": 5.0, "product_id": "B00OTXGLW0", "review": "Came as described. A couple tiny scratches on the surface. Works great!"}
