{"rating": 2.0, "product_id": "B00OSKREVG", "review": "I bought the. NEW iPad air2.  I love Apple products,  but this one is very flawed. Apple support does not help.  They are in denial that the air2 has  major flaws.  It will not hold a wifi connection.  Constantly dropping the signal.  The problem is not my router.  The problem is with the iPad.  I have 2 routers.  I have to bounce from one to the other every minute or so.  Ridiculous.  Also, the screen freezes ever so often requiring a reboot.  I am mad and frustrated.  How can Apple sell this product with such flaws.  When are they going to send out patches?  How come I haven't seen this in the news?\n  Update- Apple has released an update to iOS 8.  It helps with these issues.  I would wait until they update again before buying."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "This is a brief review assuming you're already familiar with ipads. I've owned a first gen mini, second gen mini, and IPad air 1 but this is definitely the best yet. Its really thin and apps load fast. We also have 2gb of ram, so apps like safari don't have to reload tabs. You can actually switch between apps without having to Wait for them to reload. The 1gb in other Apple products may be enough, but they won't be for future iOS updates whereas this iPad will handle the updates better making this kind of future proof.\n\nThe Touch ID is another stand out addition. It's great and also makes using passwords so much quicker. It's actually quicker to use Touch ID to unlock your iPad than to not have a password and swipe to unlock. The cameras are \"better\" but I personally don't care for such things. The battery life is on par with other iPads. Expect 10 hours.\n\nOne annoying thing is that the speakers vibrate (Especially when it comes to bass) the whole iPad because it's so thin. If you use headphones, nevermind but otherwise be aware of that. Lastly, the anti-reflective screen doesn't help reflections as well as I thought it would. It also seems harder to clean.  Overall a wonderful and actually \"future proof\" iPad.\n\nPros: lighter, faster, more ram, better cameras\nCons: the speakers are \"all about that bass\", antiglare  screen is a smudge magnet"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "<div id=\"video-block-R1N5Z8P16H54WC\" class=\"a-section a-spacing-small a-spacing-top-mini video-block\"></div><input type=\"hidden\" name=\"\" value=\"https://images-na.ssl-images-amazon.com/images/I/F1YvEgNJDhS.mp4\" class=\"video-url\"><input type=\"hidden\" name=\"\" value=\"https://images-na.ssl-images-amazon.com/images/I/716aeMok45S.png\" class=\"video-slate-img-url\">We own 4 generations of the Apple iPad devices.  They are the iPad 2, the iPad3, the iPad Air and the iPad Air 2.  We each use the tablets about 8 hours per day for photography editing, video taking and editing and working on the internet.  I am extremely familiar with the products and we own a total of 16 tablets using Apple, HP and Android technologies.\n\nIn my attached video I have tried to do a comparison between several of the product generations and the overall performance.  Physically the iPad Air 2 is about the same, appearance wise, to the iPad Air.  If you look closely you will see some differences.\n* The iPad Air 2 is 18% thinner and a little lighter in weight.\n* The Retina display is better as it is thinner and the colors and clarity is much better to my eyes.  The parallax side views are clearer and the colors are deeper and more realistic.  It still has 2564 pixels per inch and it is an excellent video device.\n* The iPad Air 2 has the newer finger print sensor on the home button.\n* The rear facing camera is in a different location on the back of the tablet and so your iPad Air cases will not work as they will interfere with your taking photos.\n* The microphone ports on the tablet have moved and I show the new locations in my video.\n* The portal holes for the stereo speakers are just one row now and larger and the speakers are louder sounding.  Not a major difference but it is noticeable.\n* The slide switch on the side of the tablet for the mute/screen lock rotate is gone now.  You have to make those adjustments in the operating system of the tablet now or use the sound volume switches.\n\nThe major differences in the tablet are the ones regarding performance.  The CPU and GPU in the iPad Air are just very powerful.  In my benchmarking I found the iPad Air 2 to be 56 %  faster in performing standard tasks and the GPU graphics speed is 2.5 times faster.  The 3D GPU test on the iPad Air 2 was 24157 versus 9051 for the iPad Air which is 2.69 times better.  In using a bench marking software the iPad Air was 40129 as a benchmarks and the iPad Air 2 was 62482 which is a major improvement.  You can see it in using the tablet, loading apps, browsing the internet and editing videos.  My wife's older iPad 2 was only benchmarked at 15010 so the iPad Air 2 is 4.16 times faster and more powerful.  That is a dramatic improvement in only a few years.\n\nThe camera on the front and the back of the tablet are improved.  The rear facing camera is now an 8 Mega Pixel camera with improved signal processing.  The photos are 3264 by 2448 pixels in resolution and the video is 1080P HD.  You can take time lapse video, have exposure control, take slow motion video at 120 fps, bust mode photographs, timer mode photos and high resolution panorama shots.\n\nBrowsing on the internet is faster and pulling up web sites and videos on the internet is just smooth and fast.  The signal is stronger for the WIFI and things just pull up faster.  Even syncing with iTunes is faster.\n\nThis is an excellent product and my wife loves hers which was a surprise gift from me.  I had it engraved for her to make sure that I didn't take it and claim it was mine.\n\nI own 16 different tablets and have extensively used them all.  When it comes to getting a top quality tablet you cannot go wrong with the Apple iPad Air 2.  I rated it at 5 stars.\n\nIf you have any questions please contact me and I will try to help answer your question if I can."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "<div id=\"video-block-R32Y1JIDTS3U8Y\" class=\"a-section a-spacing-small a-spacing-top-mini video-block\"></div><input type=\"hidden\" name=\"\" value=\"https://images-na.ssl-images-amazon.com/images/I/F1WscbFKx8S.mp4\" class=\"video-url\"><input type=\"hidden\" name=\"\" value=\"https://images-na.ssl-images-amazon.com/images/I/716aeMok45S.png\" class=\"video-slate-img-url\">&nbsp;We own 4 generations of the Apple iPad devices.  They are the iPad 2, the iPad3, the iPad Air and the iPad Air 2.  We each use the tablets about 8 hours per day for photography editing, video taking and editing and working on the internet.  I am extremely familiar with the products and we own a total of 16 tablets using Apple, HP and Android technologies.\n\nIn my attached video I have tried to do a comparison between several of the product generations and the overall performance.  Physically the iPad Air 2 is about the same, appearance wise, to the iPad Air.  If you look closely you will see some differences.\n* The iPad Air 2 is 18% thinner and a little lighter in weight.\n* The Retina display is better as it is thinner and the colors and clarity is much better to my eyes.  The parallax side views are clearer and the colors are deeper and more realistic.  It still has 264 pixels per inch and it is an excellent video device.\n* The iPad Air 2 has the newer finger print sensor on the home button.\n* The rear facing camera is in a different location on the back of the tablet and so your iPad Air cases will not work as they will interfere with your taking photos.\n* The microphone ports on the tablet have moved and I show the new locations in my video.\n* The portal holes for the stereo speakers are just one row now and larger and the speakers are louder sounding.  Not a major difference but it is noticeable.\n* The slide switch on the side of the tablet for the mute/screen lock rotate is gone now.  You have to make those adjustments in the operating system of the tablet now or use the sound volume switches.\n\nThe major differences in the tablet are the ones regarding performance.  The CPU and GPU in the iPad Air are just very powerful.  In my benchmarking I found the iPad Air 2 to be 56 %  faster in performing standard tasks and the GPU graphics speed is 2.5 times faster.  The 3D GPU test on the iPad Air 2 was 24157 versus 9051 for the iPad Air which is 2.69 times better.  In using a bench marking software the iPad Air was 40129 as a benchmarks and the iPad Air 2 was 62482 which is a major improvement.  You can see it in using the tablet, loading apps, browsing the internet and editing videos.  My wife's older iPad 2 was only benchmarked at 15010 so the iPad Air 2 is 4.16 times faster and more powerful.  That is a dramatic improvement in only a few years.\n\nThe camera on the front and the back of the tablet are improved.  The rear facing camera is now an 8 Mega Pixel camera with improved signal processing.  The photos are 3264 by 2448 pixels in resolution and the video is 1080P HD.  You can take time lapse video, have exposure control, take slow motion video at 120 fps, bust mode photographs, timer mode photos and high resolution panorama shots.\n\nBrowsing on the internet is faster and pulling up web sites and videos on the internet is just smooth and fast.  The signal is stronger for the WIFI and things just pull up faster.  Even syncing with iTunes is faster.\n\nThis is an excellent product and my wife loves hers which was a surprise gift from me.  I had it engraved for her to make sure that I didn't take it and claim it was mine.\n\nI own 16 different tablets and have extensively used them all.  When it comes to getting a top quality tablet you cannot go wrong with the Apple iPad Air 2.  I rated it at 5 stars.\n\nIf you have any questions please contact me and I will try to help answer your question if I can.\n\nSeveral people have asked me in comments and also via email if I recommend a nice iPad Air 2 case. I really like the ZooGue magnetic tilt case.  It is highly protective of your tablet and it is by far the best tilting tablet case I have used on any iPad. Here is a link to that product.\n\n<a data-hook=\"product-link-linked\" class=\"a-link-normal\" href=\"/Best-iPad-Air-2-Case-Prodigy-Elite-By-ZooGue/dp/B00PIDJA6O/ref=cm_cr_arp_d_rvw_txt?ie=UTF8\">Best iPad Air 2 Case Prodigy Elite By ZooGue</a>"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I picked up the iPad Air 2 locally as soon as it was available.  I have owned tons of tablets and convertibles laptops.  i owned both the iPad 1 and iPad 2. Below are some of my thoughts on the iPad Air 2 and how it compares to the competition.\n\n PROS:\n\n- A thin, light design\n- A great HD display\n- Faster than its predecessors\n- Among the best cameras you will find in a tablet\n- The best ecosystem of any mobile platform\n- Often enjoys better enterprise support than other tablets\n- iOS 8 Continuity features such as Handoff, Phone Calling, Instant Hotspot, and SMS\n- Touch ID works 99% of the time\n\n CONS:\n\n- No SD Card Slot\n- No USB or HDMI ports, although lightning cable adapters are available\n- A tad big if portability is a requirement\n- More expensive than comparable tablets, including the iPad Air 1\n- Lower capacity battery than the iPad Air 1\n- Marginal update over the $100 cheaper iPad Air 1\n\n IPAD AIR 2 vs NEXUS 9\n\nNeither the iPad Air 2 nor the Nexus 9 (nor the SAMSUNG GALAXY TAB S) offers much to convince you to switch platforms.  If you are undecided on the platform to choose, choose the iPad if you want the best ecosystem, better tablet centric experience, ease of use for non-sophisticated users, and better enterprise support.  Choose the Nexus 9 for a customizable OS, a more techie centric OS, widgets (come on, Apple!!!), or if you make great use of Google Apps.  And as much as I like the Apple Siri App, I much prefer Google Now.\n\nBasically, if Im buying a tablet for me or my techie little brother, Im buying an Android Tablet.  For my parents, my grandparents, or my kids Im buying an iPad... or a Kindle. ;-)\n\n IPAD AIR 2 vs WINDOWS TABLETS\n\nUnless you need to run desktop apps on your tablet, you will be happier with an iPad over any Windows Tablet.  The iPad has a much better tablet centric experience at this point.  Perhaps Windows 10 will change that.  For now, Windows Tablets currently see a big gap in terms of usability, available tablet apps, and price/performance ratios.\n\n IPAD AIR 2 vs KINDLE FIRE HDX 8.9\n\nIPad users enjoy probably the best ecosystem of apps, accessories, and exclusive content.  Niche apps are often made first for, or are exclusive to iOS.  iPads have seen more support in the enterprise and in educational institutions.  In addition to all of this, iPads are also great devices.  If you have a Mac, use an iPhone, require apps or content exclusive to iOS, are already invested in iTunes purchases, or any combination of the above, you are probably better off getting an iPad.\n\nHowever, if you are open to considering another device, the Amazon Kindle Fire HDX 8.9 should be at the top of your list.  Its a great device, its cheaper than a new iPad, and offers a lot in terms of ecosystem and optional benefits.\n\nUltimately, I chose the HDX 8.9 over the iPad because Im an Amazon Prime Member and I enjoy having access to so much free content.\n\n IPAD AIR 2 vs IPAD AIR 1\n\nThe iPad Air 2 is the best iPad ever.  Its faster, thinner, has more ram, and has a better camera than the iPad Air 1.  It also has Touch ID which, to me, is the biggest enhancement the Air 2 has over the Air 1.\n\nIm not certain that the iPad Air 2 is $100 better than the iPad Air 1, however.\n\nThe iPad Air 1 is also a great device.  For many people, Id recommend getting an iPad Air 1 32GB and save $50 over getting the iPad Air 2 16GB.  If you have an iPad 3, you should probably keep using it until the iPad Air 3 comes out.  Other than guys I know who are willing to pay for the latest and greatest gadget, I don't know for who I would recommend the Air 2 over Air 1.\n\n BOTTOM LINE\n\nAs I said above, the iPad Air 2 is the best iPad ever.  I just have a hard time recommending it over the $100 cheaper iPad Air 1.  Touch ID and the improved camera are great.  But are they $100 great?  Answer that and youll be able to decide which among them you will choose.  Yes, Air 2 is faster but most people won't notice the difference.\n\nIll be re-gifting my iPad Air 3 (I planned to do this before buying it).  I have a loved-one that will appreciate having the latest and greatest iThing.  For me, I still prefer Android over iOS.  The 4th gen Kindle Fire HDX 8.9, coupled with an Amazon Prime subscription, is still my top tablet choice.  The Nexus 9 and Galaxy Tab 4 S would be next on the list.\n\nThe nice thing is, whether you choose an iPad, Kindle, Nexus, or Galaxy Tab, you are going to get a great device!  Leave the tablet wars to the fan boys and enjoy which ever tablet you choose."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Couldn't wait to upgrade to the iPad Air 2.\n\nOur old iPad was the iPad 2nd generation. So, it's quite a leap for us getting the iPad Air 2.\n\n-- Form ---\n\nThe first thing we noticed was how light and thin it is. Then you turn on the screen, and wow. The retina display is amazing, especially since we've come from the iPad 2nd gen which did not have the retina display.\n\n-- The difference --\n\nAside from it was time to upgrade for us, one of the biggest attractors is TouchID. Touch ID on the iPhone is amazing. It's the perfect blend of security and usability.\n\nNow TouchID comes to the iPad, and it's even better. The TouchID button feels solid. The silver ring (or gold if you get the gold) around the touch plate is distinctive and elegant.\n\n-- The color --\n\nSo with the iPad Air, you have the color options (Silver, Gold, Space Gray).\n\nWe'd never tried the other colors before (there was only white and black back when we got our old iPad).\n\nThe reason we got the Silver is because that's all they had at the store. A silver and a gold. Gold seemed a little much for us, and we would have been happy with the Space gray, but we've come to really like the white front and silver edges of the silver.\n\nI thought the back of the iPad would be the same brilliant silver color, but it's actually only on the TouchID, the edges of the iPad, and the Apple logo on the back. The rest of the back casing is the finely brushed aluminum.\n\n-- Drawbacks? --\n\nDrawbacks is too strong a word when dealing with such an elegant piece, but there are a few wrinkles that we encountered when first using the iPad Air 2.\n\n1. Form Factor\n\nThe edges are more narrow, this is not new to the iPad Air 2, but upgrading from the 2nd gen iPad, it's been an adjustment of how to hold it without fear of dropping. On the iPad 2nd gen, there was plenty of space on the side for your thumb to hold on to. Now that space is smaller, and has taken more adjustment than we thought.\n\n2. Where did the Sound go?\n\nSomehow along the way, we locked the sound. Some apps just wouldn't produce sound, and the keyboard and the sleep button wouldn't give their little clicks.\n\nWe thought something was wrong with it. We adjusted the volume up. Checked the settings.\n\nTurns out there's no silence button like on the iPad 2nd gen.\n\nHowever, there is a button (we discovered) if you swipe up from the bottom of the screen that has a bell on it. It's the mute button.\n\nSomehow, I must have hit that button, and it caused most of the apps to go silent.\n\n3. iCould Restore\n\nI used an iCloud backup of our old iPad, and then used that to restore to the new one saving (we had hoped) our settings from our apps and such.\n\nThe restore did help to save our old iPad settings, backdrop, and apps, but a few apps lost their history/data. Not a big deal, but definitely an inconvenience when game data was lost. Maybe that's the apps fault for not storing their data in the right place.\n\nThe restore put back the apps we had on our old iPad, except for the apps made by Apple such as Pages, Numbers, Keynote. Those ones took the longest to get on the iPad, and I had to go to the purchases section and download them. Weird.\n\nThe other question we had after the restore was where was the Passbook app?\n\nWe set up Apple Pay, and knew that it used Passbook, but where was the app (like the iPhone has)?\n\nI thought that maybe our restore kicked out some of the default apps, but after a lot of searching (ain't searching the internet hard work?), I found out that there is no Passbook App, or Health App, or Voice Memo App that comes with the iPad Air 2 (at least as of this writing).\n\nI thought it would have the new stock apps that come with the new iPhones, but it doesn't have them (health, passbook, even weather). So that took a little bit of searching to figure out.\n\nThe process of the restore itself was easy (minus those questions). It said it could take 6 hours, but it doesn't tie up the iPad for all that time. It restores settings, then lets you use the iPad while the apps are downloaded.\n\n-- Final Thoughts --\n\nThe iPad Air 2 is light. It's thin, and it's oh so beautiful.\n\nThe ease of the Touch ID makes it worth it as security that most of us use for the 4 digit pass codes doesn't help much when someone is looking over your shoulder. The Touch ID makes it so easy, and if you don't have an iPhone 6, you can use Apple Pay with the iPad. More and more retailers are accepting Apple Pay for web payments too.\n\nIt's a great iPad. You will love it."}
{"rating": 2.0, "product_id": "B00OSKREVG", "review": "I was so excited to get this.  In fact, I sold my Kindle Fire HDX, because I have always had Ipads and just like the layout better.  I wish I'd known then what I know now, because the Amazon never gave me any trouble at all and worked flawlessly.\n\nI got the Ipad Air 2, gold, 64 gb.  It's beautiful.  The screen in beautiful.  I also own an Ipad mini.  The trouble first started when the two synced.  All of a sudden nothing worked on both, including all my passwords and the icloud.  After a nightmare of two days, it works if I don't use the icloud.  Apple support couldn't help me.  Now, it's freezing on both units.  When I go to Safari to tap on a link, nothing happens.  Boot, reboot.  Over and over again.  Apple support can't help again.  It's tied into ios8 and Apple hasn't fixed it and probably doesn't care enough to fix it.  So, I am thinking of returning it.  If you want an Ipad Air2, wait til or if they fix the bugs.  I am beyond disgusted.  My friend bought one the same day and she is having the same problems."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I bought this directly from Apple. There is such a long list of things that I could write about, and even though I came from last year's iPad Air I would never go back. It is unbelievably thin and so light and comfortable to hold. Touch ID is great, and adds an elegant look to the front panel. The mute switch on the left side is gone, but there is a prominent virtual mute switch  in the control center, which can be accessed by swiping up from the bottom of any screen."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Review update from the original post\n\nAs far as cases go, I was going to initially try out the Apple SmartCase, but for $80, I thought I should at least check out what else was available.  I found this case that was similar in design but a bit more stylish and a lot cheaper.  Actually I was a little worried about it being so cheap on Amazon, but the reviews were good so I figured I'd give it a shot.  Turns out I had nothing to worry about.  Case seems to function just as well as Apples and it actually seems a bit sturdier.  It's made from synthetic materials instead of leather like the Apple case, but I like it even better.  Seems like it would be easier to clean (especially handy for when my kids get their hands on it) and just feels easier to grip for me.  At least that's my opinion.  You should check it out.\n\nhttp://www.amazon.com/iPad-Air-Case-Landscape-Generation/dp/B00OKUBFNC/ref=sr_1_1?s=electronics&ie=UTF8&qid=1415224806&sr=1-1&keywords=roocase+optigon+air+2\n\nThough it's only been a week since my initial review, I've been taking the iPad Air 2 to test out its capabilities further, much to the dismay of my family.  But as I mentioned earlier, I do have a windows tablet (8\" version) that I had been using as a supplement to my work computer.  I sometimes need to view spreadsheets, powerpoints or word docs away from the office and if it's just to check something or make a minor edit, it can be a major pain to pull out my full, work issued laptop.  I thought having full windows in a portable, as-needed, format was convenient.  But since I've been reading that the iPad is more productivity oriented in its present form, I had to see how it compared.  Especially since, I would have the convenience of the other tablet strengths of the iPad to boot.\n\nSo far I'm impressed.  I've been using MS Office for iPad and I have to say that in many ways, it's even better than Office is on a small windows tablet.  I think the iPad version is more suited to a touch screen whereas the windows version still feels like they expect you to use a mouse.  I think the key is having the right Bluetooth keyboard and a good stand case for the iPad Air 2, especially when it comes to editing a complicated formula in an excel file.\n\nFor the time being, I've been using a no-name, compact keyboard I had originally bought for the old iPad 2.  It came built into a case but of course that case doesn't fit the new iPad.  But luckily, the keyboard portion was removable.  I never liked having the keyboard attached when I wasn't using it anyway.  I will continue to try to find a better one as this one just feels a little too mushy for me.\n\nSo far the iPad Air 2 is exceeding my expectations.  I just figured the old iPad we had was getting too old and needed replacing.  But, I'm quickly discovering that all the incremental improvements made between each generation has added up to a device that is pushing new ground for what a tablet is meant to be.  Like I mentioned in my review, I've tried a lot of different tablets, including Asus Transformer Pad with keyboards.  Even my older iPad didn't cut it as a productivity device.  But this new iPad is just faster and smoother making trying to get a little work done a lot less frustrating without giving up on anything that has made the iPad so convenient.\n\n-------------\n\nOriginal Post\n\nI've tried many different tablets including iPads, various Android tablets from older 10.1\" Honeycomb versions to the most recent Nexus 7 and even a Windows 8.1 tablet.  I originally started with the iPad 2 and it was the device that convinced me that tablets were worth the investment and served a useful purpose.  From there I tried several Android tablets.  It actually took that platform quite a while to catch up to the benchmark the iPad had set.  I started with a honeycomb tablet that required a lot of patience as bugs were worked out.  I ended up having to root it and try some custom roms to get the tablet to work the way I expected it to and even then it wasn't uncommon for the device to crash on me.  But eventually, Google was able to improve the OS and by the time the second generation Nexus 7 came out, they had finally achieved a truly usable device.\n\nAs for Windows tablets, I don't really see them as an iPad competitor.  They are more like a miniature version of your PC you can take along with you in place of a full size laptop.  Sure the Metro interface does make it more tablet-like, but the lack of apps and reliance on the desktop screen keeps it from being that \"even a child can figure it out,\" used by everybody in that family, zero learning curve device.\n\nSo while I've gone back and forth with devices, being the gadget geek that I am, my family and I have always had an iPad around when we wanted to quickly play a game, use an app or watch a video.  So when the new iPad Air 2 came out, I decided it was time bring home a new iPad.\n\nThe thing I love most about the iPad is that it is so simple to use and no matter what you want to do, there is probably an app for it.  As fine a job Android has done playing catch up, there has never been an app that I wanted that I couldn't find in the App Store.  This used to be especially true for apps that gave you access to accounts you might have with a broker, an institution or a company.  It's not too much of an issue anymore since most companies now release both IOS and Android apps simultaneously.  I've even seen a few Android apps come out before the IOS version, but this wasn't always the case.  I think there are still a few companies that will still put more effort into their IOS release than they do Android.\n\nHolding the new iPad Air 2 in my hand I can see that Apple still sets the standard for the category of device they invented.  You might even say that the interface hasn't changed much from the original device they launched in 2010.  Sure there have been a lot of incremental improvements like the pull down notifications, additional gestures, and the ability to create folders to clean up the pages.  But, there was never a need for Apple to have a Project Butter initiative to improve the smoothness of how the device functioned because Apple had gotten it right from the start.  Each incremental improvement Apple has introduced has merely brought a very good system closer to perfection.\n\nI think they even got the screen size right.  Though the first iPad was a bit weighty, the 9.7\" screen size has always been perfect. While Android and other have set 10.1\" with a wide screen ratio as their standard and dabbled with even larger screen sizes, I have always found the 9.7\" 4:3 ratio to be the perfect portable size for a tablet.  Even when you compare a 10.1\" Android tablet next to the iPad, though there isn't much of a difference in screen size, the iPad seems much more portable while still giving the illusion that the screen is just as big if not bigger.  Now that they have reduce the size of the bezel further and increased the resolution, the current screen is absolutely stunning.  Going in the other direction, while I've never owned the iPad Mini myself, the 7.9\" screen with the 4:3 ratio to me just seems to be a lot easier to read from than the smaller 7\" screens with a 16:9 ratio that have become the standard for smaller Android tablets.\n\nAs for the weight and thinness of the current iPad, it is just unbelievable.  Comparing the new iPad to some of the older devices I have lying around is like comparing a Macbook Air or Ultrabook to the old HP laptops I use to have to carry around.  Honestly, picking up my backpack, I have to double check that I packed my iPad because there is no way I can tell by the weight whether it's in there or not.\n\nThe interface is so much smoother now with the faster chip.  There is never even a hint of lag and pages load instantaneously.\nAs the iPads wider ecosystem has evolved, it has even become capable of some limited productivity.  Add a Bluetooth keyboard and attach a nice stand case and you can actually do some work.  Microsoft Office Apps and iMovie have given it the ability to create documents, spreadsheets and videos.\n\nNot that the iPad is perfect.  The device seems to vibrate when you put it on maximum volume.  It's still not as customizable as the Android interface.  But it's still the closest I've seen so far to the perfect tablet experience."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Best yet"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "best bye ever"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love it"}
{"rating": 2.0, "product_id": "B00OSKREVG", "review": "The IPad was not new."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Bought to replace 2012 iPad 3 which stopped updates with v. 9.3.5. This used iPad Air 2 arrived looking like new in original box;  my seller even included a very nice Moshi cover. Its all set up for a specific family member and everything seems to be working fine.\n\nBased on some of the very few negative reviews here where buyers basically feel they got a bricked device, I feel fortunate to have purchased from an  ethical seller who communicated with me quickly and politely to help me through an initial setup hurdle. Turned out, the iPad was linked to iCloud account of another member of sellers family; once that was removed by seller, I was no longer stopped by the activation lock, and from there setup was a breeze.  Highly recommend contacting your seller if you buy a used and have similar problems - if they are honest like my seller, it could be a simple overlooked thing thats easily resolved. (So give benefit of doubt and be nice!)\n\nPro: According to Livewire, the iPad Air 2 should be in great working order for some time and should have (as of February 2018) over a year before you will really feel the need to upgrade.\n\nPro: Current iOS for the iPad Air 2 is 11.4.1, released 9 July 2018.\n\nCon: I discovered, in setting iPad up for new user, that a lot of the apps that were on their old iPad are now obsolete for this one. However...\n\nPro: No biggie since plenty older apps still work fine, and now, theyll be able to download newer apps that wouldnt work on their old device. So its a bit of a trade off, but totally worth it."}
{"rating": 2.0, "product_id": "B00OSKREVG", "review": "I really loved it at first but in just 2 yrs it died. I'm guessing its the battery. I charged it, it registered 100%, but after I put in my passcode and starting using it, it quit.  When I tried turning on again it said the battery was dead. Oh and several months before that FaceTime and iMessage stopped working.  What a hassle!! So frustrating.  I want to get another one but wary."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Came dead. Over all nice my daughter likes it! Nice picture"}
{"rating": 2.0, "product_id": "B00OSKREVG", "review": "Although this iPad seems to work (tho I didn't bother setting it up), the advertisement on condition was \"new\". Seeing the scratches and wear, it is clearly NOT new. With the price nearly that of an actual NEW iPad, this is terrible false advertising. Just shameful."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I've had this iPad for over 2 years. I watch videos everyday for hours. It still runs like the day it was new and has held up great. The battery lasts just as long as it did when brand new. I've always had a mixed opinion on iPhones but this ipad is awesome."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "iPad Air 2 works great.  I love it and use it for quite a few things just like my computers."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "great product"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Very easy to use, very fast.\nThumb's up for the senior technical support from Apple , very helpfull."}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "Ipad is dead! Woke up and it won't turn on. Can not find the order for it on Amazon. I know it cost over $500 and I would like info on warranty if one exists."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I love it so far.  I am still figuring out how to do everything.  It works well so far.  It came very well packaged."}
{"rating": 3.0, "product_id": "B00OSKREVG", "review": "I've haven't had this 2 years and it quit working.  Called Apple Store & it will cost me more to repair, then to buy a new one.  It came apart on the left side of the screen.  I've got it in a case & never have dropped it.  Not Happy :("}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Very very reliable. Updated regularly and it's extremely rare to stick or freeze. I gave owned mine since 2015 and I froze on me one or twice. Lightening speed and has been faithful till today. Battery lasts over a day. I'm totally satisfied."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Bought one refurbished with American Express points for my wife, I thought. She adores it. I find myself using it too. The picture quality is great and the sound is remarkable. Touch screen can be iffy for big fingers. Google seems to work less well than my desktop, but it goes everywhere doing so much so well that I am reeeeally impressed. Refurbished - smurbished it's a great tool. Buy one, but don't blame me if you are using it all night."}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "When I got this IPad it was already scratched up on the screen plus it has scratches on the back. When I turned it on it was obvious that it was previously owned. Also it keeps saying software update but doesnt download. Im very disappointed in this purchase especially cause my grandma bought it for me as a gift. The apps also do not work"}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "nice"}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "I got an empty packet and nothing in inside. Be careful."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Got it as a gift."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "awesome thank you"}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "iPad was okay, charger was a general one which is useless!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "My daughter loves it!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "G R E A T."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I am beyond satisfied with this purchase. The iPad was used, listed as in good condition, but arrived and appeared as brand new with no noticeable issues. I would definitely recommend this, Im typing this on my iPad Air 2 now."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great gift for my mom :)"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I just realized I have had this for three years, and it is still going strong.  Battery life is excellent and it works perfectly."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "The price of market is going down. But I love the purchase. Ever since iPad with me, I bring it every where there is wi-fi. Record information, get online, track all my internet related apps and sales. Super convenient. Size is perfect and I will never retire it."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I've had this tablet for over two years now and (knock on wood), not one problem with it. I had tried a Galaxy Tab 3 first and never quite bonded with it.\n\nSince I also have an iPhone (the now antique 6), the two talk to each other.  I get texts coming through on the iPad while the phone is upstairs.  And, I also can take calls on the iPad Air 2 speaker phone from the iPhone.  Very convenient when you don't have the iPhone by your side."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Perfect! Highly recommend!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Worked Great, Thank You."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "This is a great deal! I enjoy this ipad air 2. My iPad Air 2 came in excellent condition. I am very pleased with my IPad, and with the seller.  This one is like new and in excellent condition. I love it! I bought it for school for my masters program at my university."}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "I bought it one and half years ago as gift for my wife and is still working smoothly. My wife just loves it. The size is just perfect for handbag and she finds it easy for reading purpose!"}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "Not new.  Defective.  Came 50% charged.  Was suspicious of packaging.  Didn't boot up properly to start page.  After I had set it up manually, it  proceeded to lose all charge it had.  Battery appeared drained.  Refused to recharge.  Returned.  Ordered different item from another seller.  Beware this product and this seller."}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "for the first time\nI will present my problem here\nI purchased a tablet from this merchant\nAfter the arrival of the device I placed on the charger and discovered that it is very hot\nI immediately notified the seller who never cared about this problem\nAfter a day and during my use of the device I and my baby exploded the tablet battery and were hit\nI also told Amazon and the seller, but I did not find any interest\nLet me know that I do not return the device"}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "Battery dies within 1 hr!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "A great i pad, present for my wife."}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "Do Not buy from this seller. I payed for a brand new iPad Air 2  128GB. The iPad that was sent to me was positively not new. The iPad has numerous problems with sound, with Facebook, the keyboard gets stuck all the time. The home button is pushed in. Thats something that happens when users take thousands screenshots. I have five other iPads so I should know that this iPad was one that was refurbished and sold as brand new. Another problem with it is when on youtube the video quality is very dark and when u pause on any youtube video it gets even darker. Never had this problem or any of the other problems I mentioned, I tried from the beginning to contact this seller and never could get through to them. I will be calling Amazon and explaining in detail all the problems associated with this item."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Of course, Apple is amazing. I recommend the 128GB because the more storage you have the faster your Ipad will be for longer."}
{"rating": 2.0, "product_id": "B00OSKREVG", "review": "The battery is no good constantly I have to keep charging"}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "when this ipad was pictured and I placed the order it was a apple iPad Air 2, what arrived was an iPad Fifth Generation, which is less expensive and would not fit in the otter box case that I already had.\n\nAmazon was a big help in resolving this, however, I would really liked to have what I believed i had purchased."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "What a deal, buy this right now!"}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "Good product over priced"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Very easy to Handel and very clear picture ."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Excellent buy"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Very good product, meets expectations, arrived without problem, recommended"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "came brand new in a box Just as I expected"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "So glad I bought online. Great product!"}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "I purchased this as a gift for my mom for Christmas in 2016. Now, it won't hold past 2% charge. She took it to the Apple store and was told it cannot be replaced or fixed. The employee said she can purchase a new one for $328--well yeah, no crap, but we JUST bought this less 16 months ago. Is there anything we can do to get this replaced or fixed for free? I am so over Apple products; so expensive and do not last, terrible customer service. I will not be buying anything from them again."}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "Never worked from the day I got it and now I am having problems getting a replacement."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "My wife doesn't know how she survived without one!!!! Will be looking to add another soon!!!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I did a lot of research on this iPad before buying it. It is 2018 and this product came out in 2014.\n\nThis iPad can run iOS 11 with a slight stutter that is barely noticeable. There is no Apple Pencil support and the specs in this machine is still strong. An 8X Tri cored processor 1.4ghz and 2gb of ram still make this a strong product in 2018. This screen have anti reflective coating and iliminated display which the iPad 2017 and 2018 does not have. I use this product for reading and browsing the web which is better than my laptop and iPhone. I also use this in college for taking notes and reading pdf files. The iPad Air 2 is still good in 2018, but if you want a future proof iPad go for the iPad and go for the Air 2 if you are in a budget."}
{"rating": 3.0, "product_id": "B00OSKREVG", "review": "it is just fine but none of the lightening av adapters work on it."}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "Still working solid after 2.5 years."}
{"rating": 3.0, "product_id": "B00OSKREVG", "review": "Great quality materials (as usual with Apple) but I have been experienced some issues with wifi connection. Sometimes it stays thinking so I have to close wifi and reconnect, then it takes the signal again."}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "IOS is fast, love the light weight and how loud the ipad is."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love my iPad"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Still haven't had much time to play on this as yet, but I love it.  So glad I bought this.\nHad an issue with charging,  but soon learnt that it charges better if you use the plug supplied."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "A gift for my grandson and he loved it. He is a disc jockey on the side and was not able to use a PC he had by Apple worked great"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "This product has been great! The iPad is so easy to use and I can make it work with my iPhone easily. I can have games going on my phone and then move seamlessly to the iPad. I didn't realize until purchasing it that I can pick up phone calls on it, which is really handy. I have no complaints whatsoever and I have not had any problems with it at all.\n\nI am glad that I saved a little bit of money by not purchasing the data coverage and I don't miss it at all."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love it."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love it"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "great !!!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "So far I've been very pleased with this iPad"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "works perfect great product, love it.."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "What a great tablet to have."}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "I received my iPad as expected, but I would give this a 0 star rating! As soon as I opened the box, I knew it was the wrong iPad version. I ordered an IPad Air 2, but I received an IPad 2017, which is a huge difference. I wouldnt have mind it if they wouldve gave a deduction from the price since its so expensive for an iPad, but that isn't the case. Im very disappointed in JDE Distributors for giving me the wrong iPad; you have gave me stress I don't need. So Im refunding this and instead paying extra at Best Buy. I would change the review if given the actual iPad Air 2 i wanted."}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "DO NOT BUY! I only used this Ipad for 2 weeks and it died and will no longer charge. I am not even sure how I'm even going to delete all my data off it before I return this tablet because it is completely dead. DO NOT WASTE YOUR MONEY ON THIS PIECE OF JUNK."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Awesome deal!!!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Works great"}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "I asked for a 32gb and got a 16. Really annoyed."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "very great"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love my iPad. Especially love the 64GB."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I bought this for my business to run credit card transactions, then discovered that we use it for so much more. My wife takes in on our road trips to watch movies, and I love the included Garage Band app. Beats android by a mile."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "No issues at all. Looked brand new. So far it's been a great first iPad. I'm very Appy with my purchase.  ;-)"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Apple IPad Air 2 is perfect for me. Size is handy to carry anywhere. Light weight & fits in a large purse easily."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Excellent buy."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "as promised and great transaction"}
{"rating": 2.0, "product_id": "B00OSKREVG", "review": "Physically this product was in good condition. Unfortunately the wireless card didn't work right from the start. I've done multiple factory resets, the wireless card on this device randomly fails. I'm returning this item, this is the 2nd used ipad I tried to buy off of amazon and it has had problems. I'm just going to buy new from apple to avoid the unknown history of the device."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "It a good equip. Good For read eBook. Good couleur and deffinition. The volumen is low."}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "iPad arrived and would not stay connected to wifi. After spending $150 on technicians trying to help item was returned as no one could make it work."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "My son lives in this. Videos, games, surfing all look great and it lasts a long time."}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "The apps , are hard to find what you want."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Can't beat it. It does everything I need and more. It never ceases to amaze me."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Used this item for 2 years already. No problems so far"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "bought this for my wife .if I buy another would be like this"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I was a bit skeptical about purchasing this tablet at first. I had my eyes set on another similar one that was newly refurbished until I realized how low the ratings were. Not only that, but shipping was also a concern. To my surprise, my package was shipped the exact day I ordered it and arrived promptly. Upon opening the package and also examining my tablet, everything seemed to be in perfect and working order. It was packaged very well and therefore was without any scratches, smudges or dings. The overal functionality of my tablet was just fine as well. I am definitely glad that I purchased this item!"}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "Display has Burn-In effect. Thats not a minor issue for refurbished product. Disappointed."}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "I got it damp now it don't work a wasn't over money"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love this gadget!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "No problem at all. Easy to use."}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "good all around"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Works very well! I love it! It makes work so much easier!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Bought this iPad a year ago and still use it every single day for work!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Bought this for my husband for Christmas 2016. Been a great buy and still works nice."}
{"rating": 2.0, "product_id": "B00OSKREVG", "review": "The iPad was nice, however the apps that came with the tablet would not work. After trying to figure out why the apps would not work I gave up. I have video that I have with the app that didn't work for me. So I sent it back."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Bought this for my wife to replace her old one which was on its way out. She is very pleased with it and uses it all the time."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Beautiful iPad in top quality condition which was very appreciated given that it was a secondhand device.  Super grateful :-)  Highly recommend this supplier."}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "The product worked great for 65 days then went dead. Of course the guarantee was only good for 60 days. More my fault for not checking out the number of days of the guarantee.\n\nThe item was listed as \"new\", When i took it to an Apple store they said it was definitely refurbished with non-Apple parts. So there was nothing they could do for me.\n\nTook it to a local Apple repairer and they said it would cost more to fix than what it's worth. So now it's merely a paper weight on my desk\n\nSo any future buyers beware of this Amazon 3rd party seller"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "It works just fine. "}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Brand new!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "it was a gift and she cant put it down"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Excellent product!!!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Have had a few iPads before & this one works as good if not better than the previous ones. Love it"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Works great"}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "Got it as a Christmas gift for my 14 year old son.\nHe loves it. Only problem was that the charger didn't work. Luckily I had one that worked at home so he was able to enjoy his Christmas gift."}
{"rating": 3.0, "product_id": "B00OSKREVG", "review": "Item was delivered on a timely basis.  It was not clear to me before the purchase that device did not have cellular capability.  That was disappointing but the end user would have seldom used that feature."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "What a fantastic product, very thin, super fast, runs around 9 hours for surfing the net. Seller provided product as described. Very happy"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Not a bad thing to say. Love it."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Very pleased. Would order again and again."}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "when i received the ipad it had issues with the processer and took it to the apple store and they said that there isn't a valid warranty for the product so was very disappointed but received refund for the product with no hassle"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "nice"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I bought this for my wife and she absolutely loves it!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "good product"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "We love it.  works well, gave us more capacity"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Even tho it's refurbished. You would never tell the difference."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "basically brand new"}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "Totally dissatisfied. The ad info on this item has no indication it is refurbished, discontinued and will  have no future Apple update support. Im getting a refund upon return. Im p*ssed."}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "I have had an iPad for some time but they were always a little glitchy. My son had a fever so I gave him the iPad to watch iTunes and it would not let him watch the movie until I put in my credit card information. Worked for about 30 second until it asked me to put it in again. I would give in 1 star"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "This iPad air works like a charm! It's great, slim, light-weight, and most of all very powerful. It doesn't overheat, and we use it daily from watching YouTube videos to doing sales. It's highly reliable as an Apple product, and so far hasn't failed in any single way.\n\nIf you're considering a tablet, definitely consider this one. It's not too big, the price is just about right, the battery lasts a long time, and the picture quality is very good! Once you go iPad, it's hard to go back to Samsung tablets."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Of course my wife loves it! Who wouldn't!  She ran out of memory on her old 16 GB iPad 2, so I got her the 32 this time, and it weighs a pound less.  It also has a better camera."}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "iPad is in decent shape. The description said it was \"Used-Like New\" but there is a very noticeable scratch toward the bottom part of the screen that I saw as soon as I opened it up. It works well but the scratch drives me nuts!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "iPad worked great. Came in very good condition and great deal. 5 out of 5"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Bought this as a gift for our daughter.  She loves i!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Thank you"}
{"rating": 2.0, "product_id": "B00OSKREVG", "review": "Well, after about 18 months, my iPad Air 2 will not work unless it is plugged in. Now, after 2 years, the front screen area is coming loose from the body of the iPad. Terrible for something that cost nearly $500.00"}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "Like several of the other 1 star reviews, we got a regular Ipad vs the Ipad Air 2.  Seems to be a trend with this seller and probably several buyers that never notice as you really cant until you look at the model number or go to put it in a case made for the Air 2.  BEWARE!!!!"}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "Not very durable. Only lasted 6 months of normal usage and then screen started to malfunction."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Ive enjoyed my I-Pad as soon I opened the box! I ordered it during Thanksgiving holiday and my I-Pad was delivered a day earlier! Thanks!"}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "I bought this product and it had a hardware failure after only 2.5 years. This was a brand new Apple product and the hardware failure occurred 6 months after the 2 yr protection I bought expired. I expected MUCH better from Apple. This was my first purchase of an iPad and it may be my last."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "This was perfect!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Received item quickly! Awesome product!"}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "Some New things I hace yo learn"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "don't no how to use it yet but it works real good so far, my wife loves playing games on it.  Michael and sharon"}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "I ordered the iPad Air 2 and received the iPad. This was very disappointing as I already bought all the accessories for the iPad Air 2 which cannot be used for the iPad. I am from the Caribbean and ordered it as a Christmas present so returning it was not an option for me. It is indeed false advertising."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love this tablet.  It seems to have everything that was described when I ordered it.  I shouldve spent the money and ordered it with the calling features. Still, I would not give it up."}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "Went to activate and it was locked due to the fact that it was still associated witj the previous owner. Considering that I paid for something BRAND NEW, there should not have been a previous owner. Now I can't do anything about it and have to go get a new iPad. Ridiculous."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "It is a great product!  No complaints."}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "We still cannot get the airpad 2 to work.  We went to Apple support and were going to ask for help and then when we saw 654 other people have had the same problem,  we are upset that 654 people plus have the same issue and Apple did not fix a simple sign in problem.  Problem is if 6 attempts are made to sign in with a wrong password, the airpad becomes inoperable, its own description.  It just will not even turn on.  The repair solution is that you hook it up to a computer and download iTunes and start all over.  Anything you have on it is gone.  We have not been able to download iTunes successfully.  Recommend if you purchase this piece of crap you lock it up if you have grandkids come over.  We are going to return it if we cant fix it this week.  Apple support really is terrible."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "good!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Excelente producto, me aguanto algunas cadas antes de morir"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "It was delivered on time, and exactly as described. Its a perfect Apple product in original carton with all accessories. This is my second iPad per Amazon the first was refurbished, both are working fine."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Use it every day."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Excelente ipad"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "This is a gift for our event, lol......"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Just got it! If you buy the warranty, note it comes via email. If you have product shipped economy it comes shipped in a sleeve: We were worried about the device at first because it wasn't well packed, but it seems to be ok. Still exploring all the functions and capabilities. It's much faster than the aged device we replaced, Apple iPad. Will update review in a month."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Absolutely love my iPad! It arrived in the estimated time and was damage free!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "love it"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Seller delivered product as described and just on time. Very good!"}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "This is not a full review...but buyer beware..this is advertised as an ipad air 2....and it is clearly not...i am replace an ipad air 2 16 because of low memory...and this ipad is much thicker\nI have also ordered a keyboard that i will have to now return because it is specifically for an ipad air 2 and this ipad is too thick to fit. So sick of people misrepresenting things they are selling on the internet...i guess because you cant punch them in the nose for lying!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I love it!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Slim and fast. Gets warm faster than my older thicker iPad."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "absolutely love it"}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "Kept freezing on me. Annoying because I spent all this time download things on it, just to return it."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "No issues! Worked as expected"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Perfeito!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "as advertised.. fast shipment."}
{"rating": 2.0, "product_id": "B00OSKREVG", "review": "I bought this iPad for my daughter for Christmas 2016 and today is November 15, 2017 and the iPad won't charge.  Now I have to spend more money to get it repair if it is repairable at the apple store.  Not very happy."}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "Screen damaged you can see shade of blue. Save your money buy new iPad for same price"}
{"rating": 2.0, "product_id": "B00OSKREVG", "review": "Screen has visibility issues, won't buy again"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "The condition is fantastic. I love it."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Better than I thought!"}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "Good value"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "muy buen producto, recomendado"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Very nice iPad . Thanks"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I love my iPad. Used it everyday. It has become apart of my life, like a second appendage with a window to the world. I especially like that Apple offers great support."}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "Quit working after one month. Seller said it was under warranty, Apple said it was not. Very disappointed in seller."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great product"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Very nice iPad!"}
{"rating": 3.0, "product_id": "B00OSKREVG", "review": "an iPad, that all"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Ordered used. The one I received was in very very good same. Very happy. Never had an iPad before. I like it. Still getting used to it and Apple. (I'm an android guy)."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Everything I had hoped for"}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "Less than a year iPad would not charge.  Sent to Apple for repair but nothing they could do.  Junk."}
{"rating": 2.0, "product_id": "B00OSKREVG", "review": "I love this iPad, it is fasteasy to use. I ordered it on March 31, 2015 and received it in good time. However, several weeks ago I noticed the home button was becoming less responsive, now it is mostly non-responsive. There is a built in virtual home button that allows me to still use this expensive tablet for most things but I can no longer take a screenshot. My much older iPad model is still working for the person I gave it to, perhaps I should have kept it."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "It's Apple"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "This unit was sold as refurbished. If so, I could not detect any difference between this unit and a new one. It came in a factory box, with what appeared to be a factory seal. And, it works great."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "a dilemma here because the tablet was basically new and perfect.  The problem is I really don't like Apple so I sold it to my sister.  She still has no problem after months of use."}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "sorry but refurbished for me means also a good akku, ibattery shows me \"37% akku bad\", i am a tourist cannot send it back,  i am not great !!!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I am very happy with my IPad air and happy with the shipping."}
{"rating": 3.0, "product_id": "B00OSKREVG", "review": "I pad was in pretty good shape but the case that came with it was sticky and very dirty with holes and was not able to clean. Hopefull that this ipad will continue to run ok."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Bet present I every received!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Good"}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "Lighter, thinner, better screen."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "So far it works great. Fast and easy."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Amazing product! Have everything I need"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "This is a great device for a decent price.  I love the iPad and don't really need some of the very latest model improvements. This one here is the best buy for my money. My wife & I cannot get along without these devices. Having this device along with a Chromebook also allows us to avoid the problems, issues, updates, and anti malware, which accompanies devices using Windows operating systems."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "AMAZING LOVE IT"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love it"}
{"rating": 2.0, "product_id": "B00OSKREVG", "review": "As advertised, good quality and functionality."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Works great"}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "This was sold as an iPad Air 2 but was in fact the 2017 iPad (regular). Take note when opening the package as this may be a scam."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Wife use every day"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "so happyyyy"}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "3 months quit charging, having difficulty contacting seller.  have not responded to email"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "For that kind of money..........an instruction sheet woul have been nice  [ like what I got w/ a$15.00 toaster]"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "You would think it was brand new! Not a scratch on it. Packaging made me kind of scarred but it worked out."}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "GOOD.."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Look my tablet."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "My wife is really enjoying her gift"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Just what I was looking for. Good value and Im happy with this purchase"}
{"rating": 3.0, "product_id": "B00OSKREVG", "review": "I bought this iPad Air 2 128GB NEW in February of 2016.  I and have recently had an issue with it where it no longer charges and cannot be used. I sent it to a repair shop where they sent me this note, \"ARO removed the shield covering the essential logic board components and found part of the shield cage has been cut off from the cage. ARO inspected the logic board under the microscope and found that the NAND IC was replaced or attempted to be replaced. Underfill is gone from around this IC and the logic board has scratch marks around it. This is probably the cause of the issue. ARO is unable to repair the NAND IC and will need to declare the device as non-repairable\".  The only thing I can think of is that I was NOT sold a new iPad Air 2.  I spoke with Amazon who referred me to the seller.  I gave them 3 stars because the iPad did work for the first year.  For almost $500 I do expect it to work longer than that.  I did message them today and will update a response to let future buyers know the outcome of this issue."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "In good condition, as described & fast delivery\nThanks"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I'm new to apple products and I am satisfied and learning how to operate my iPad. So far so good"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Ordered this for one of my Deployment Managers, he loves it! He tells me that the battery is awesome!! the order arrived quickly and nicely packaged."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Actually given as a gift to wife who really loves it. Biiger and much faster than her previous iPad, a mini."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love my new iPad Air 2.  It has some new features that my old iPad didn't and its light and easy to carry."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Excellent!  Comes with a lot of storage. You can sync this with iPhone and back up your phone on iPad where there is more storage"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "It has plenty of space and cost less than my original 16GB Air 2."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love it!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great Ipad"}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "Got Scammed! I received a IPad  Model # MPGT2LL/A  NOT A IPAD AIR 2, instead of  Model # MNV72LL/A as advertised."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Awesome value and awesome product!!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I love my iPad! I use it everyday all day! I have no complaints and wouldn't even consider any other tablet!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Easy to use"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "This tablet is exactly what I ordered!! I'd read reviews about people getting used products etc. but found none of this this true. I ordered it for my husband & he is HAPPY to the max!!!"}
{"rating": 2.0, "product_id": "B00OSKREVG", "review": "I did not receive an Ipad Air 2. I received an Ipad. This one heats up so quickly that I am unable to hold it. Sometimes you don't get what you paid for. This is one of those times. Going to return this one and buy an Ipad Air 2."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "So glad I got this! You will love it!"}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "I cannot believe that this iPad only lasted 1 year.  It will not charge or turn on, not what I would expect from an Apple product"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Wonderful so pleased I bought it."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love love love it. Much lighter and faster than my iPad 1."}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "Died less than 1 year.\nSeptember 20, 2017\nPurchased December 14, 3016"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Bought as a present for my mother, arrived as new.  Happy with the purchase!"}
{"rating": 3.0, "product_id": "B00OSKREVG", "review": "Minus 1 star -- Bad news, I cannot use Apple pencil with it.\nMinus 1 star -- An other sad news, it does not have flash light for camera."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love it. Always pleased with apple products"}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "I bought ipad air 2 i got the ipad but it not working write won't charge now im having hard time getting my refund"}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "Not new!! Horrible experience"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great experience"}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "This a great product!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "love it !"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great item"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love my IPad. Pleased with my purchase."}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "Works as advertised."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Still works and Ive dropped it a million times! Great for media consumption and essay writing (with a wireless keyboard, of course)"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Very nice size and works perfectly for our use."}
{"rating": 2.0, "product_id": "B00OSKREVG", "review": "I'm giving it 2 stars because the front of the iPad, and the functionality of the iPad itself works. The issue is on the back. There was no mention in the discription that there would be major flaws on the iPad, but the iPad I recieved had huge scratches on the back. Very disappointing I'll be returning it immediately"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "This was a replacement for a IPad that I damaged. Great for everything you need while away from your Computer."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Bought this IPad for someone else.  I set it up and it works very nicely.  I own two myself.  They have not had any complaints about it to this point which is to be expected when using IPads."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love it"}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "Use this everyday.  I have a neuromuscular disease that affects my legs so I use this to help with circulation."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "love my ipad"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love it"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Wow wow way too go\nPerfect"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I'm gonna say this is a great product my daughter hasn't put it down since she received it for get bday"}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "I love reading from it & playing a few games, but I can't put my thumb print on it. It won't even let me access it? Must be because it was used?"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "This is just exactly like the products you buy at Best Buy or any other high tech store. so far it is been a perfect. More than 2  years later I have had the best time with it. my grandkids have ones from Best Buy store and this is been good just as good for way less money. Happy I made this purchase."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "LOVE THIS!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I received my order on time, it was brand new and I love it "}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great!"}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "Minor scratches.  Battery life doesn't last long. But device works"}
{"rating": 2.0, "product_id": "B00OSKREVG", "review": "A vertical line has just developed on my iPad Air 2 I purchased new in march of 2017. Return window is closed.  I have read many reviews and this seems to be a common problem. My iPad has never been wet, dropped or exposed to the elements. We have two other iPads that are way older with no problems at all. Apple quality has been declining in recent years in my opinion. I will contact Apple and will post how it goes"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great product."}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "It has just recently become hinky, I try to open a page and before it fully loads, it disappears.  Or I get the page to open, but when I try to scroll down, it disappears.  Guess it's to the Genius Bar for me."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I really love it"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love it"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Value priced. Showed up fast.  Was perfect.  Fully operational in no time.  Gift for my mom - she loves it."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Reached on time and everything correct."}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "Love every thing about it except that I can't view the screen properly in sunlight even with an umbrella open."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "This I pad is great lots of memory and lightweight"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "its and ipad air 2.  Pure and simple amazing product.  Still fast, nice screen, can download all the newest apps.  Between fantasy football and clash of the clans this was a no brainer for me."}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "So bad, doesn't work!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I bought the iPad air 2 to replace my Samsung tablet. It will take some time to learn the new system, however it is already much faster."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Like everything that I purchased from Apple."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Updated my wife's iPad mini.  She loves it."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "My first Apple device.  Works really well and has some great features.  Love it for reading email, news, books, etc.  Love the fact it has 128 gb storage since Apple doesn't add a micro card slot."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great Product!"}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "iPad won't charge.  Obviously never tested.  Don't purchase from these thieves."}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "Worst case scenario you change cell numbers and get your CCard compromised so that gets changed to, and the password you never changed gets rejected. Apple customer service recovery of your account up to this point is impossible, I have been trying to do so for three weeks, twice they were to call my new cell to resolve it, never got a call. Set an appt. online again for them to call me and they cannot help. I had to go back online go thru the process again and now they say 28 days to recover, that is not reasonable. This is not an NSA or HLS item, its a fricken ipad used for work to read catalogs. I do take some of the blame, it had been several months since I bought a song or installed an app and had a very busy time moving, so remembering to not update my info with them before the old card was shredded and cell was changed so that is on me, but Apple's poor customer service in such an instance they just lost a customer for life, just made my decision not to upgrade to an ipad but a real tablet running windows, which is my best interest anyway, its just more expensive. I have been loyal to Apple for decades, not more, I am very disappointed."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I have held off for years in getting an IPAD but now that I have one I love it and I think the price paid is reasonable.  There were quite a few negative reviews ...but I always go with my gut feeling and I have not been disappointed.  I received the model advertised and everything is working great... I am sold :)"}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "Had the device for 1.5 months now, went to turn it on the other day and found out it was dead. Took it in to Apple and they informed me that this device is not covered by Apple even though it was represented as new and came in what appeared to be a new, sealed box which even contained the apple 1 year warranty card.  Have contacted the seller to see if they will resolve the issue but have not heard back yet. Will update review upon hearing back from seller."}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "We purchaed this product on Dec 10,2016. It has been less than a year and the device will not power on."}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "The machine was fine but A very limited wi-fi.  Very misleading  I returned it and still has not been credited to my card. We had to go\nTo Verizon and buy another iPad that would work. So because of you I'm out $1000.00"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love it."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great ipad for the price."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Very Happy"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "love it"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I'm enjoying my iPad and have had no problems. Glad I chose this one."}
{"rating": 2.0, "product_id": "B00OSKREVG", "review": "Not that great! I had all the bubbles out and now I have bubbles in it."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Very satisfied with the purchase of my IPad Air 2.  Very easy to set up and to transfer all the info from my old IPad to the new one."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "My son loves it"}
{"rating": 3.0, "product_id": "B00OSKREVG", "review": "fast and light weight, yes. the sound is terrible, you can barely hear it."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love my ipad"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Nice working good"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Have an iPad2 and although it's old it still does the job. But Apple quit providing upgrades for the old gal leaving me in the dust. I resisted a while but finally gave in and made the purchase. It works great but so does my old one with the exception of updates and bug fixes. So this one is a little different size wise but now I'm waiting for Apple to stop providing updates to the new one. If it comes too soon I'll start looking elsewhere."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "great item"}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "Love it! Could not be happier! Great purchase! Much faster than my iPad 2 !"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Perfectly new as said. The shipping was quick. Would definitely recommend"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Works great!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "unfortunately i was very low on my finances and had to buy very quickly as a replacement  for family member after  destroying theirs by accident and I don't even own one. So far I heard no complaints so thank you !!!!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Very pleased with the fast delivery.  IPad air 2 work wonderful. Will shop Amazon more often."}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "it started failing already"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "My Apple iPad Air 2 arrived within two days of ordering and I love it."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Very nice, user friendly"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love it, it fit me me my needs perfectly."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "It was what I expected.  I use it with my blue tooth hearing aids and listen to books  . ..  its great!!!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Exactly what was ordered and expected!"}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "Yes the Apple iPad air 2 did meet my expectations and more it surpassed my expectations.\n\nI can say that I really like the  ipad air 2, it is fast it is very clear and once  I learned  how to use it is very user friendly."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "If you have no need to use the stylus on the iPad Pro, this is definitely the IPad for you. Why? THE SCREEN!!! The laminated screen is AWESOME!!! The screen on the 2017 IPad is not laminated. While it has a more powerful processor than the iPad Air 2, the screen on the 2017 version is a step backward. Unlike the iPad Air 2, the screen is not laminated so there is air between the screen and the glass. I went from an IPad Gen 4 to this iPad and am blown away by the screen.\n\nTip: Going from another iPad to this one? Do a backup to iCloud before setting up the IPad Air 2. No room in the cloud? Buy storage. It's cheap now. After you back it up, you can download your backup to the new ipad. The Air 2 will be a mirror image of your old iPad with apps intact, safari favorites, etc. took me about 20 minutes to set it up.\n\nVery Happy! Nice to get a bargain on a great IPad! Order while you can as this is the last of them :)"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "My father won't put it down! Great product, but what else would you expect... it Apple.\n\nPackaged well and delivered as expected."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I am not going to get super technical as many others already have, but this is the best ipad I have ever used. This is much thinner and lighter than other ipads and twice as fast as my old ipad 3. If you are looking for a decently high performance tablet for media and business, I highly recommend this as a cheaper alternative to the ipad pro. There are some other tablets a bit cheaper that are nearly equal in performance, but I think the software and usability factor warrant going for this ipad instead."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "A lot of capability that takes time to learn how to use for the first time."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I'm loving my iPad Air 2.  This purchase was for my very first tablet, and it has by far surpassed all my expectations.  It, complemented by my iPhone,  has really made daily life for me less hectic and much more efficient.  I received exactly what I ordered in excellent condition and within a couple of days."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great, works as expected."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great Product - money well spent"}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "Not sure if this was brand new as described but works fine. Factory package didn't come with everything all the other iPads I've bought came with and the charger didn't work."}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "I'm not a fan of the Apple operating system (much prefer Android), but this was purchased at the behest of my employer. It's fast, and seems to be of high quality."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Apple is still #1, simply the Best"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love it!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love it and great price. Also bought the otterbox case and a used apple keyboard, cause well any other keyboard just plain stinks."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "it works"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "They all work great!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "My husband loved it as a christmas gift"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Perfect. Love it."}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "meet my expectation."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great tablet."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Super!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "My gf loved it"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great iPad fast delivery"}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "Very expensive for what it is"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love it!"}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "This iPad was a total fail.  It immediately began freezing upon setup.  The IOS needed updating, and the iPad needed a full reset to install the new IOS. But even that didn't help with the freezing and random rebooting. I contacted Apple Support, and since I had already done a reset, they said my only options were taking the iPad to an Apple Store for possible repair, or just return it.  I opted to return, and then went straight to the Apple store to buy a new replacement iPad, which has worked perfectly.\n\nI learned my lesson here - don't buy Apple products from resellers."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "good"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "It's great, but disappointed that I didn't receive a charger with this IPad."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "This iPad is just incredible. It is really fast and pretty light, hence the word Air in iPad Air 2. I would definitely recommend this tablet to a friend, no questions asked."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love it! Works great! Exactly as advertised!!"}
{"rating": 3.0, "product_id": "B00OSKREVG", "review": "Ordered this Apple iPad Air 2, but received the newer iPad 2017 (although outer wrapping had Air 2 model number). They are similar so it is not much of a problem except the size is different. The case I bought at the same time did not fit since it was for an Air 2."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "It's perfect for my 7 year old. He loves it!"}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "Received the iPad in the mail today. Description states apple iPad Air 2. Did not receive the apple iPad Air 2."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Very nice, as always Apple."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "USE IT ALL THE TIME"}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "I purchased this for my mother to replace and older ipad. So far she has no problems with it and is enjoying it very much."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "The Apple Air 2 is one of the best buy Apple iPad products today."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Wonderful"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "great this is what you need if you don't wanna spend too much money on an iPad"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "e"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "REALLY NICE AND HANDY FOR TRAVELING."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Even tho I can't afford it looks cool"}
{"rating": 2.0, "product_id": "B00OSKREVG", "review": "Item had been used sold for new"}
{"rating": 3.0, "product_id": "B00OSKREVG", "review": "the charger was bad, it took me 3 days to charged up 45%"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great device, lightweight."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "best price"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I've never owned an iPad so I was thrilled when my office paid for one.  I use it all the time, it's great!  I'm not a tech person so you won't get any information from me about that."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love it!!!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "LOVE IT! Never had one before, but was easy to set up and follow. A+A+A+"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "It's fast it's amazing and was only $429"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love it!"}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "Been everything that I thought it would be."}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "I guess my phone could do almost everything the ipad can do"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Wow it's big. Lots of room, I am happy with the speed and performance. I have to get use spot some of the new features, it does come with a ton of pre loaded apps, like garage band, haven't tried that yet, and several others.........\nScreen is big compared to my mini I had before. But I like the 128GB my last was only a 32GB and it would run out of operating space rather quickly. It got frustrating to have apps crashing on me all the time. This one hasn't done that yet.\n\nIt doesn't take the best pictures, the bigger the screen the crappier the picture quality gets, but it's good enough for documenting things and creating quick pics for faceppbook posts so I am happy with that, still produces better pictures than my iPad2 did.\n\nUpdate actually the pictures aren't that bad. Heres a sample of one."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Escelente producto"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Excellent.  My second iPad.  Very fast and responsive."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Received it promptly and I am very happy with the quality of this tablet."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I was very pleased with the service and delivery of the iPad Air 2.  It has met my expectations of support and ease in using it for personal and business use."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great working"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "My 1st I Pad!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I wouldn't want any other brand.  I'm not particularly tech challenged, but Apple is much easier to use than android based tablets.  When they come out with the next greatest version I will be in the market!!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love it move up from previous tablet works perfectly"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great product and service"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I needed a mobile tablet/computer that I can consume lots of data (email, websites, books, videos, etc.) and be able to test out my iOS apps as an independent developer.  The iPad Air 2 was the best price point and has the same features as the other iPads for my use.  It is nice to take around the house to read or take to bed and read before falling asleep.  Good form factor for my big hands also."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great size. Weight.  Love it"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Everything is fine\n\nBobby"}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "My iPad did not charge consistently 4-6 weeks after purchase and after 3 months it quit charging completely."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "great product"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great product, great service. Thank you."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I love my new IPad. It's an upgrade from my the last one I had. Came in on time. A big difference in the resolution compared to my last iPad.\n  I really didn't see how they could make it any thinner or lighter but they did. I got my old Siri back though he speaks in an Aussie accent and  calls me sexy. Me and my IPad went to the Apple Store and took some classes. It was a class just like me,seniors. What I had done with my last  IPad I learned what it would do as I went along. I know that it does a lot more than I know how to make it do."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I have been wanting an iPad for a while and so thrilled I finally got one.  I Love it!  So handy to take with me on the go instead of my computer."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Wonderful.  Light and easy to use."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "just what my Grandson needed he really likes it"}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "It performs great.  I would have given it 5 stars, except for one negative, and we were totally surprised given the product description on Amazon, it doesn't connect through cell service, only wi-fi.  I thought I would return it when I learned of this shortcoming, however we are virtually always using it on wi-fi, so it hasn't been a problem.  It would be a major drawback if we were someplace that didn't have ready access to wi-fi."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Came on time. Works great and fast."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Excellent Product, good value. Great service as always from Amazon."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Works great"}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "It turns the iPad Pro came out just two weeks after I purchased this. So it goes."}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "Love the iPad and its convenience. As it aged, however, it began to freeze regularly. It rights itself after about 30 seconds, but that seems like forever when using it."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Very happy with purchase."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "great ipad great price"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "This is a great ipad with super speed.  It's light, thin and efficient."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Excellent product!  Everything I wanted and more!  Amazon is my go-to shopping experience!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Like it"}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "This is a pre-used product.  Ours arrived looking new but with a restrictions code, passcode, fingerprint codes already set."}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "The Ipad came with defective battery. I will not stay charged. Even if it's on 100 percent if I use it for 3 minutes it dies. This is not normal."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love it...."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love the Pad,,,so nice,, and user friendly."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "My school has free iPads to use for education I go to ps2  and I like the iPad so I wanted to buy one but my parents won't let sooo...."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great product , not problems"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Wonderful! Thank you"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "good and clear"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love my new IPAD."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "So far so good... no complaints..."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Works exactly as planned.  Arrived on time and was well received."}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "Get the new iPad...this one isn't worth the headaches you will get from it. Slow response, always freezes up, sometimes the screen will rotate sometimes it won't. Don't buy!"}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "Problems"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I purchased this for a friend (who was sick and tired of the Windows PC and constant viruses). She is making great strides in learning how to use it and is very pleased thus far."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Best price I could find on a brand new in package IPad Air 2 with 128GB.  Arrived quickly and in perfect condition!  I had to replace my older Air 2 due to a battery charging issue, and the cost of repairing was half the cost of buying a new one with 128GB while my older one was only 16GB.  I was thinking about going with the new Pro, but the price of the Air 2 was a much better pill to swallow and being use to the Air 2 and it's features I knew it would be more than adequate for my usage.  Very happy so far with this purchase!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I bought this for my wife and she loves it and me for buying it for her."}
{"rating": 3.0, "product_id": "B00OSKREVG", "review": "Very difficult to set up. Without prior knowledge of Apple products, it would be impossible without technical assistance!!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love it"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Extremely pleased with this iPad Air 2.  I'm wary of purchasing electronics online but this was a great deal and I couldn't pass it up."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Very happy with my Ipad Air 2"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "we thoroughly enjoy our Ipad.  It has not had any problems to date."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "use it every day. almost takes the place of my Desktop."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Still works perfectly after a year of constant use."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Wonderful iPad. Everything I expected!  Will not disappoint."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "better than expected"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Prompt delivery. iPad was as advertised."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "perfect"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I need got it"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Goodyear device"}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "Received IPad and I checked model number on Apple site.  Apple states it is a IPad generation 5 2017.  I ordered a cover for IPad Air 2 as stated on your web site.  Did not fit because cover states will not fit an IPad.  ???  I ordered a cover for IPad 2017. IPad is great."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "good"}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "meets my expectations"}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "After coming into issues with my antique iPad 2 I decided to get as new a one as I could afford. I still hate the no expandable memory but this unit works fine for what I ask it to do."}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "So far so good."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "this is my second Ipad Air. I had the original one, it lasted about 2 years and then the charging port (lightening port) went bad... it still works great, when you can get it to charge... which is very very spotty and if it does connect it can take up to 5 days to get to 100% from about 10% or less...\nI tried to get it fixed by a local electronics / computer place who say they specialize in Apple products and they told me (after they had it for three days) that the motherboard was shot (i don't even think they opened it up... ) Anyhow This Apple Air2 is pretty sweet. its faster, brighter and seems a bit lighter. plus Since I don't use the volume buttons all the time I can still use the key board / case from my iPad air 1 when I need to!  I just hope this one lasts a little longer than 2 years! but in case it doesnt, I bought the extended warranty for it ! lol"}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "Works great"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "It's an iPad what's not to like about it?"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I am enjoying my ipad"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I love my iPad Air 2 it was a Mother's Day present. Write down passwords and never forget your passcode. It took me 5 hours on the phone with Apple Support to reset my iPad to be able to use."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "It's a iPad a great platform to work from does not lack processing power and don't have the update slowdown problems of windows platform tablet/computers seem to have which tends to make them slow a couple years after buying them."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "IPad...need I say more? excellent product"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I'm giving five stars on this purchase! I was very hesitant about buying a refurbished iPad but couldn't see paying the price of a new one. So, finally decided to take a chance and am happy I did. My Air 2 came in an apple box with all the accessories and owners manual just as a new one would, and it looks and runs like new. It's way faster than my old iPad and works well with my Square chip reader. Excellent purchase!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love it."}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "I like the price, I like the interface, but there is a huge problem with touchscreen sensitivity.  At times, the device just refuses to register touches.  It is especially bad in Clash of Clans, but is also annoying in Safari.  I have read many users seeing this problem originate with the IOS 8 update but have not been able to verify this since Apple does not support downgrading OS.  I have reset my device, clean screen, and all the other Apple tech support suggestions and nothing has helped.  The problem seems to be getting worse with time.  Not what I expected from Apple and its normal QA reputation."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great"}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "Product was unusable since previous owner data was not cleared and properly reset."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great! I love it!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "My IPad arrived quickly. I am very happy with it. Highly recommend seller. Thanks!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Bought this as a Christmas gift for my mother. The old ipad was about wore out so we got her the air. So much faster and easier to handle due to being so light."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Just as described.  We love our iPads!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Ipad Air 2 best purchase I've made! Excellent!!!"}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "Not happy at all! After less than 1.5 month the iPad won't charge. It's not the charger because it charges the iPhone, and not the port because it's clean."}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "Very nice"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I got this to replace my mini , needed something bigger for my eyes and more storage. Very pleased , luv sharper Retina display and arrived as promised in (used) beautiful condition - couldn't have looked  better. !"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "J like this iPad. My grand kid like many game play good."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I love my iPad. I don't bother with my laptop any more. If it ever gives you trouble, turn it all the way off for a few seconds ( by holding the on/off button down for 5 or 10 seconds till the screen goes black), then start it up again. If the screen freezes and you can't turn it off, press the home button at the same time you hold the on/off button down, and it will turn off. Those are the only problems I've ever had with it and they were my own doing as I've been told that the instructions tell you to turn it off occasionally to dump the junk. Who knew."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "We are enjoying the iPad."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love!"}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "Seems OK now, but not sure how strong or protective it will be."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I loooooove it iPad. Perfect gift for my baby sister's graduation. Came in perfect condition. Looks pretty brand new to me. Than you"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great product. Bought it for my kid. He is enjoying it."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Good Product"}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "Great gift."}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "Everything was ok"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Thanks I love it love it, I wouldn't buy anything else"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great as usual"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Excellent product and price, without complications, optimal conditions. Thank you Amazon !!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Perfect"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great product as usual!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Everything about this tablet has been fantastic.  Camera photos and storage are fantastic for vacation.  The only improvement that comes to mind is the zoom. Any time you zoom in the photos become grainy.  Best to take the photo as regular and then crop it out later.  Very Very useful tool to help out on a vacation."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "As advertised."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "The iPad looks great and was easy to set up.  I was using it within minutes and had transferred the content from old iPad to the new one seamlessly through the Cloud."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Works great!!  Easy to transfer over from old one!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Arrived in perfect condition."}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "Product passed off as new from the seller. It was actually refurbished and quit working after 7 months. I would not buy anything from Supreme Deals 18 and be wary of other sellers of Apple products as well."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I use the ipad by for Internet radio.  But love it."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Excellent product.  Arrived on exact day promised."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Very nice device at a great price if you don't need more memory.  Smaller and lighter than earlier models with the same size display.  On road trips we tether it to an iPhone to get Google Maps on a big screen."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Awesome product"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "This iPad is my second one. I love the size, it is great for travel. Keeps me up to date when abroad. Great for reading in bed at night."}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "Broke in less then 5 months don't buy it"}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "The volume doesn't work on this IPad very well.  I frequently have to turn it off and on again during the day to get it to work. Very frustrating"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Gift for wife and she loves it!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "What not to like, sleek thin fast good looking,  Its an apple and apple is great,\n\nAll my devices are apple"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I am very satisfied with the iPad so far. The shipping was fast and the iPad was like brand new."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "This device is incredible for when it was released (2014) and holds up to the competition to this day day three years later. It is thinner and lighter and an overall better value than the newly released IPad. This IPad includes a laminated screen and tri-core processor which don't come with the new \"improved\" IPad. I opted for the 128gb model which is honestly more storage than I will ever be able to fill on a tablet. In short the IPad Air 2 is still the best, lightest, and slimmest IPad that you buy for a reasonable price."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "love it, easy to use, light weight GREAT !\nGood seller, product was wrapped  for shipping in a sufficient  protective way\nWould purchase items again from this seller."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Purchased these for use with our football program so I haven't used it much yet.  They came in new condition and the initial set up has been good.  So far, so good!"}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "Received Apple iPad Air 2 and right off the bat it wouldn't charge. Went to an Apple Store and purchased a new cable and charger and still wouldn't charge. The Apple employee looked up the serial number and said this product even though new was an old model that is no longer made. I have returned the device along with the screensaver and case and won't be purchasing electronics from this seller again."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I love this iPad. I was choosing between this or the pro. I chose this only bc I don't care about having a pencil that costs 100 dollars. It's such a good quality. I am very pleased."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "love my air 2 tablet , couldn't decide between ipad air 2 or ipad latest gen , air 2 was heavier but air 2 had later processor , either way you go you win . awesome ipad..this was cheaper than the local electronics store , theirs had to be shipped also and would have had to pay the tax"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "This iPad is so much faster then my older ipad2. I enjoy using this device every day. It meets my needs, and exceeds my expectations."}
{"rating": 2.0, "product_id": "B00OSKREVG", "review": "Purchased this a few days ago, When the package arrived I anxiously opened it and started connecting it to my Apple account. Started down loading apps, working great, then to my amazement I found out it was ONLY 32 gig, you see, it was advertised as a 128 gig. I really felt ripped off. Contacted Amazon and they were willing to give me a 30% discount IF I decided to keep it. They were out of 128 gig, so they sent a 32 instead. NOT sure why that would even happen. 32 is 1/4 128 and would not work for what I needed. Went round and round with customer service and NOTHING. No help at all, my only option is to return it, and I am, come Monday. Told them I would look somewhere else for my 128. Found it today for a few bucks cheaper too. Really do not understand Amazon doing this as I have shopped Amazon for a few years now and NEVER had a problem. JUST beware of your electronic purchases from Amazon..."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Perfect for our Square Processing Stand!\nWorks great! Only issue was when power went out and battery drained, startup required a password for my volunteer, after I'd reassured her I had set it to \"no password required.\""}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I love my IPAD Air 2. Its so user friendly. Its Light in weight and easily transportable and convenient for busy people that are always on the go."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Excellent!!"}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "Great, just took a long time to get it."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Very good product!  This was a replacement of an older iPad.  Big difference!  Love it!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Very very happy with the product, and the service! You guys are the best!!!"}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "Good"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I donated to our hospital.  It works great, pictures look wonderful.  Apps run so smooth"}
{"rating": 2.0, "product_id": "B00OSKREVG", "review": "The Ipad Air 2 is a mistake that I wish I never made.  The graphics are good and there are a ton of apps... But the touch screen is the worst I have ever encountered.  It goes from touching it once and it registers 6 taps to not responding at all... I now use it only as an E-Reader and music device, it is pretty worthless for anything else"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Nice Ipad works well and good size."}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "As described.  Received in timely manner."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I like the iPad Air\nJust didn't realize you had to have wifi or a hotspot to use it\nBut that is fine"}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "I bought 2 NEW iPad Air 2 as gifts-1 box was 'opened', no booklet/charging wire/plug not factory sealed #PNRR26043 1629"}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "I kind of wish I'd stayed with a laptop, but it's nice. I do like apple products!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Everything happened as promised & product is in proper working order"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "It's an iPad. Need I say more. Too bad I bought this right before the prices for iPads were dropped but nonetheless works as expected. I own 5 of them and bought this one as a present for my dad on his birthday."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Works and looks great"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Good"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Am very satisfied."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Nice"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I love it"}
{"rating": 2.0, "product_id": "B00OSKREVG", "review": "I ordered \"new\" and it wasn't so I sent it back."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love it!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great product."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Works great!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Very pleased"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Excellent"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I love my iPod Air 2. My second one. Use it every day. Very happy with product."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Like the color, size and ease of holding it."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "This IPad is all rith."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I can't think of even one thing I'm unhappy about with this iPad."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "This is honestly the best place to buy an iPad. Great price, fast shipping, and the iPad is brand new. I bought this for my dad because he wanted a bigger screen than his iPhone and it works great. He likes reading ebooks on it and even texting. Would recommend this seller."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Ordered gold came silver, just saying."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love it"}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "So far I have no problems with the iPad."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "received it as promised, working fine."}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "Great product. Works as expected."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I really enjoy y my new iPad. It replaces an old Samsung I had."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "i love it, it's my best friend"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great Product. fast shipping."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I am a youtuber with lots of followers I&nbsp;<a data-hook=\"product-link-linked\" class=\"a-link-normal\" href=\"/Apple-iPad-Air-2-MH0W2LL-A-16GB-Wi-Fi-Gold/dp/B00OSKREVG/ref=cm_cr_arp_d_rvw_txt?ie=UTF8\">Apple iPad Air 2 MH0W2LL/A 16GB Wi-Fi Gold</a>would like to review this awesome product for you."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I absolutely LOVE this iPad.  I replaced a 5 1/2 year old iPad which was slow and would often get a black screen causing me great frustration.  There's a world of difference between the IPad Air 2 and the iPad 2.  I guess 5 1/2 years of newer technology helps account for that.  This iPad Air 2 has much more memory than I probably need but I got it at a very reasonable cost and I love the fact that it is slimmer and lighter than my old iPad.  I hope it gives me as much service as the older model."}
{"rating": 2.0, "product_id": "B00OSKREVG", "review": "This iPad seemed to have glitches right from the start and now after only eight months it will not charge. I will only buy staight from apple. Never through Amazon."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love it!!! Much faster than old one great picture and sound!!!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Exceeded my expectations.  Even updated to IOS10.3"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Third iPad in my family....love the ease of use...."}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "Good function, user friendly.  A minimal dent in the frame."}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "Very Nice!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Perfecto"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Good deal.  Fast ship."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love my ipad"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "No problem"}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "Came in perfect. And looks great. Wish it had a snooze button"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I'm jealous. My iPad Air is only 32gb. I can't imagine my husband having any storage issue with 128gb."}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "Apple is a company that makes good quality products and I understand that. If you personally prefer a simple streamlined experience by all means use an iPad. The display is great and so is the build quality. My problems with this iPad and all iOS devices in general are that what you get is what you get. I would much rather prefer a more customizable experience. But that's just me."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "In continuos use and working great"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Just got my iPad Air 2 today. I have set it up and have watched a Netflix episode. Have had zero problems."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "ok"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love it."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Just as expected!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "This was a gift my son's third one he love's it."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Like new, great product."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Seems much better than my original iPad. Wish it came with written instructions.  All I can do now is trial and error."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "as aspected"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love it"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I needed this mainly for pictures and videos with my work. It takes super HD pics and videos. Really like it. Never had an ipad before, but it's very intuitive and I was up and running quickly without any panic attacks."}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "Charger not original"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "BUENOS"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I have resisted getting an iPad for years, because I could not justify to myself having something \"between\" a cell phone and laptop. I thought it was too expensive for something that includes features of both phone and laptop but is not as portable as a phone nor as functional as a laptop (unless you by an external keyboard.  But now that I have one, I love it. The touch screen works smoothly, and I like that the screen flips so it can be read vertically or horizontally. I have not used the iPad as a camera or telephone, but I use it all the time as an internet device, especially when I don't want to run upstairs to  look up something, read a newspaper or magazine, check on the news or weather, or see messages. My justification now is that I have cancelled print subscriptions and get publications for less money through the iPad, so that it eventually will pay for itself -- and leaves less of a carbon footprint (only the minimal electricity for charging it). Yes, it's still an expensive luxury, but a very much appreciated one."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great tablet all around! Much faster than the earlier generation. The screen is bright and the graphics are good. Battery life could be better but that's about it."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Got this for my wife for her birthday to replace her Kindle.  She love it!!!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "My wife uses it four to five hours a day.  The anti-reflective coating works great.  She loves it!  A happy wife is a happy life."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "i love this ipad it is the best it works really good nothing is mad it is all good"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I absolutely love this iPad!! It is so fast and works magnificently!!"}
{"rating": 3.0, "product_id": "B00OSKREVG", "review": "I upgraded from an old iPad 2, that had ground completely to a halt, performance-wise.\n\nThe iPad 2 Air was a welcome upgrade.  Speed is of course much faster, image quality much better.  Size and Weight improved as well.\n\nAll of those screen and performance upgrades however come at a cost:  Battery life.  I would estimate that the battery in the iPad Air 2, lasts approximately 80% of what it did on the old iPad 2.\n\nAnother great big con; Is that iPad has now come out with a new 9.7\" that is approximately identical to the iPad Air 2, but $70 cheaper.  Just my bad luck to have bought it a couple of weeks too early."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I saw some negative reviews about the product being previously owned or not new.  iPad Air 2 128 GB was brand new and for the lowest price I could possibly find online.  Pair it the Anker bluetooth folio keyboard and you have a great setup!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Bought this for my wife's mother who had a Gen 1. She absolutely loves it!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great screen protector."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Nice product until now no isssue. The packing was not nice got a small scratch near the edge."}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "Do not buy. Screen died within 2 days. No damage. Just a ripoff and I paid full price. Amazon rep mentioned the name of the seller but it sounded like a known complaint from \"a third party\" as they put it"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "It works great. Great product."}
{"rating": 2.0, "product_id": "B00OSKREVG", "review": "5 features I love apps don' workexcept for two games wihich are good.  Other goories:\n- comments\n-  typewriter\n-battery life\n-  siri\n- manual.\n\nMost apps an app store aremass confusion.  Security is totally frustrating."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I was looking at the \"new\" 2017 iPad, compared it to the Air 2, and liked the Air 2 better because it's lighter and has the Retina display. Works like a charm, very happy with the purchase."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "easy to set up and use"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "LOVE"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Showed up as described and in a timely manner."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "It came just perfect, I got it for Christmas and I'm very happy with it."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "My second iPad and love the weight.  Just another excellent apple product and seller"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Excellent Product"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great iPad. Very glad I bought it. Works like a charm."}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "It was a gift and just loves it. Helps for schooling and just enjoying the games and books."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "great product"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Works great."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "If you have a iPad you know what to expect. I love apple products personally"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "There's nothing you can say about an Apple product you're just great"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "This item  was delivered on time and in perfect shape. The Ipad is working great and we haven't had any problems."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great product. Got one for me and my wife. Was a bit suspicious at first because the price seemed to good to be true but it was the real deal. Came in the offical apple packaging and was brand new."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Exactly what they said it would be. Shipped quickly"}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "Struggled with using the device"}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "This is my first iPad so I have no experience on how to judge this one. I did a lot of research and as of this date the Apple iPad Air 2 with iOS 10 seems to be the best on the market. For me it has been a complicated lesson in the use of an Apple iPad and its operating system. All my experience has been with HP and Windows.  So far I find I do prefer Windows over this but I have an open mind and will continue to learn and will update this review in a few weeks or months."}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "Pretty good but there are glitches. Sometimes the keyboard or touch screen acts wacky."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great purchase! Love this iPad."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Happy I purchased it"}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "It was a gift and when I finally give it to the person, we realized it has a dent in it and screen has minor damage.  Terrible."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Awesome!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Good thing that I have this. I did used this thing conveniently. I highly recommend this."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I love it as a product but I wish it weren't so expensive."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Just right"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I like the ipad"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Gift for my wife. Now we can't have a conversation without this in her hand. She loves it."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Brand New Ipad Air 2 128GB. Looked factory wrapped brand new. Works as designed. No issues."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "As expected."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "EXCELLANT"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "great product"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "My 7 year old daughter just loves this IPad"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great iPad. It's lightweight and easy to use. I bought this for my husband and he loves it. It seems to be about the weight of my iPad mini. I am considering getting one for myself since it's a larger size and so light. It would fit in my purse."}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "This is a PSA!\nDo not use this at night! Even with the brightness all the way down, it burns your retinas with the fury of 1,000 suns and will damage your eyes for good. Watching adult content is impossible, as with the brightness, it turns even the darkest of flesh into Matthew Perry skin.\nThe front facing camera also makes it extremely difficult to self-pleasure due to the fact the camera takes off 10lbs making your meat stick look even pathetically smaller than it is.\nI'm pretty sure this iPad in particular gives you cancer."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love this Ipad 2 Air, its all they said and more...great price, came quickly.."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Works fantastic very quick. Just the right size and I would definitely buy from this seller again."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Best tablet made!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Absolutely the best tablet I have ever owned. colors outstanding on screen."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love the iPad Pro..great technology..even my 95 year old mother can use it."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great product"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I've been enjoying my iPad. I'm very pleased with this product."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Its an iPad.  It's awesome.  I had no problems with the seller sending a \"used\" device.  Received on time.  I had an iPad mini but wanted a bigger screen with more memory.  This fit my needs for a \"reasonable\" price.  (All Apple products are overpriced).  Get a cover...you'll want one."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Received it on time very good quality"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love love love"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Another fine Apple product.  Fast"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Good product and the delivery is fast."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "This iPad is awesome. I love the face time and phone. Apple online support talked me through syncing with my other devices and was the best online support I ever had."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Wonderful"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I received the I pad in two days, it was a surprise for my wife Cathy. Her previous I pad was at least 5 years old.  It was slow, Cathy had a hard time down loading articles and was getting frustrated. She absolutely loves the new I pad Air 2. It's download speed is great, the resolution of the screen is greatly improved over her previous model and I love the seri aspect of the I pad. I would recommend a buy on this item coupled with the case that I bought a few days latter for the I pad."}
{"rating": 3.0, "product_id": "B00OSKREVG", "review": "Just OK. Seems to keep shutting down for no reason when I'm in the middle of using it."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great purchase! I have had 2 iPads before and I loved them both. This latest purchase did not disappoint. If you are considering a tablet, the iPad is a great way to go!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Very good"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Very good for my sun"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "The iPad Air 2, while adhering to Apple's tradition of beautifully designed and elegantly functional products, is a powerful tool for a busy student. It's thin and light design allows for incredidible portability, and I've found since my purchase of it, I no longer have a need for a full-feature laptop. For the price of a premium tablet, you're getting a machine that can easily replace your laptop and desktop computers for the majority of people. I highly recommend it."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love the iPad"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "My daughter loves her Christmas present!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Came in sealed, not damaged or anything."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great Ipad"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Exactly what I ordered. Great price."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "great"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "This is my third Ipad and this one is as great as the others."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Exactly as described and will be perfect for my business!!! Thank you!"}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "Why would I spend $425 on this when the brand new iPad is only $329 on Apple's website?"}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "Frauds-sold as new, why then would there be a passcode?  Was not new!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Very cool"}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "Although says new mine came with a small scratch on the screen, not noticeable unless in light  but when stated new I would expect everything to be perfect. Will return"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "iPad is iPad"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Excellent seller.  New product just as advertised."}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "Works great. Great price and really speed up from iPad 3."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "thank you I'm enjoy this"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Very happy. Working great no problems. As advertised"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I'm loving it!,"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Come in good condition"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I had the first iPad and the iPad 2 and the iPad mini.  I went back to the regular size iPad but this time Air 2.  I didn't go Pro because I didn't really need it to work.  I have my Surface for that.  But if the Surface were to not work, this will come in handy if I need Microsoft office.  I love iPad for reading and doing my sermons and Bible studies.  A great tool."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Got this for myself. I love it."}
{"rating": 3.0, "product_id": "B00OSKREVG", "review": "Lots of downloading to do to get features one expected to have. Email system accumulates all the email in chrono order and does not seem to have the ability to separate them as Gmail allows on a full service computer. The feature which causes the screen to shift from vertical to horizontal gets stuck at times, and you simply have to wait for the Ipad to decide to operated as it should--sometimes hours."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great iPad"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great buy. Very happy."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Excellent"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Very happy with my iPad..."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love it"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Very nice ipad.  I am really enjoying this ipad."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great seller. Shipped on time, arrives as expected, with no issues. Love it!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Everything was cool\nPerfect"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "excellent product"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "My purchase was through a third party seller. I highly recommend this seller! I received a like new product in its original box including accessories. I am an original owner of the first iPad. I gave it as a gift many years ago and wanted to reinvest in another one.  I was looking at androids and comparing with Apple, but, didn't want to overspend my budget.\n\nI made the best choice!  The iPad Air 2 is a beast of workmanship and performance. I charged the battery 100% and after 6 hours of internet, games, and, social media, it's now 70%. The standby time on this device is ridiculously insane. Because I knew that I would be using this device for storaging books and videos I knew I would be buying the 128gb model.\n\nThe only complaint I have is getting used to the vibration when the volume is loud. Wish Apple could have factored that adjustment into the design.\n\nI am looking forward to getting more longevity from my Apple IPad Air 2.  Very satisfied customer."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "These guys are great, offered ipads at a good price. Didn't fulfill order, I got ten bucks."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love Love My IPad Air 2. So light & easy to use"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Am still finding out new things"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Exactly what I ordered with good packaging and works great."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Excellente"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I use this IPad constantly. It has really made my life easier. I can take it anywhere without any problem."}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "Item arrived in the wrong box labeled \"iPad Air\" not \"iPad Air 2\". Item would not turn on or Charge. Plugged in for 5 hours, still no activity.\nPackaging was nice and item looked brand new. However, dead on delivery. Beware of refurbished products."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love it"}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "Very useful"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "works great"}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "just what I expected thanks great produce"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "We are very happy with this product."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Best price around on Apple product."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "This has been a great buy.  Charges very quick and holds a charge for quite a while, depending on what you're doing on the iPad."}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "As they say \"Happy Wife makes Happy Life\" It was her birthday gift."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Good condition.\nGood as new."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "So far I am loving my new iPad Air 2. I already have a 3-1/2 year old 16GB iPad (which works just fine), but its storage is almost at capacity -- even after deleting infrequently-used apps. Now with 32GB, I have all the space I need for my favorite apps and can allow the grands to use the older iPad without hesitation. I am also impressed with some of the newer technology this iPad Air 2 offers, especially its ability to read screen pages to me when I am busy. Its price was a little higher than some other vendors I researched, but I with my Amazon Prime, I felt the price was reasonable -- plus I received it in two days and never had to leave the house. I must say that formerly I was not a big fan of Apple products. I thought they were overrated and overpriced. That changed when I bought the older iPad to replace an android tablet. My iPad purchases have given me a whole new perspective about tablets and a new interest and respect for Apple technology."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "The item came fast and new as expected."}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "A very high quality product.  Is being used by my grand daughter to do art work."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I love it. After waiting for a long time reading about these wonder devices, finally the stars were aligned properly and I now own one. I am an Amazon loyalty girl from day one and have the Fire which is great but it hurts my arthritic hands badly to read with it. I did not want to outlay the cost of an e-ink reader without being able to do more with it. So this is where I ended up. The first thing you notice is the incredible weight, or the lack thereof. I find that it's very intuitive also. I'm typing this review on it,  something I was never able to do with my FIre. My daughter says I have gone over to the dark side with this purchase.  But that's alright it's less painful here so I will take it. If you can, I highly recommend you do the same.  Yesterday my 8 year old granddaughter came over to show me how to setup FaceTime so we can share all sorts of things. We are only 4 miles apart but I don't have transportation and miss all 3 of my grands so much. Now I will be able to share more in their lives and they in mine.  That alone makes this purchase worth it."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "This is my first iPad and I love it!! Really easy to use. Mainly internet and Netflix in my case. Suits my needs perfectly!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "at first I thought I had a bad ipad....but it was me that was BAD!!!!!!\nI set it up agan with the right password from my router!!!]]\n\nSo now it is PERECT!\n\nAnd I gave it a one star when I was whing...Because I was doinf it wrong!!!!\n\nSO thanka BUNCH ....Abe you rin sgood outfit!\n\nJoyce"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I only regret not getting more memory."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love, love, love my iPad."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love iPads!"}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "So far so good.  It does have a vibration where the speakers are inside there but that doesn't seem to alter how it works at all. Still kinda wish I had bought the ipad pro but I'm fine with this ipad."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "My gf loved it! Good experience for this purchase."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love it!"}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "Very light , portable and elegant. The only challenge is with DocsToGo that seems not to spell-check in typing and  freezes too especially while it is charging or other applications are opened.\nAlso only 125 Gb. Available not 145 advertised."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I love it!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "If my mother can use it. Proof of how intuitive Apple products are to use."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Bought as a Christmas gift for my husband. Simple to set up and worked almost directly out of the box. Works great and has a long battery life. Functions great as a tablet for reading, watching videos, and surfing the internet."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Absolutely love it!!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love my iPad , use it daily"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I love it, with all the memory!!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Thanks works great"}
{"rating": 2.0, "product_id": "B00OSKREVG", "review": "Super horrible on storage. I know that Imovie has lots of issues, and storage add up is horrible. I'd prefer some other Ipad or maybe a samsung overall. Don't BUY"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Daughter loved it"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love it!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great and fast"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great product! Nothing more to say."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Works great"}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "Worst thing I did"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Working good . Thx"}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "I gave this to my mom for Christmas so it has been used only since then. She is in her 80's so it is not used with any great frequency. The \"Home Button\" has not been working with any regularity, so basically I am now out the price of the Ipad and the now useless accessories which I purchased to go with it. I'm very disappointed, as is my mom."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Everything we wanted...."}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "Not good. Do not buy"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Very happy with this purchase.  All was as I expected."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Very happy with it"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "It's an iPad!  I mean, come on it's perfect."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Easy to use"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "My wife loves her iPhone and wanted to replace her Samsung tablet, so we got her this.  It is good for someone who just wants a tablet for surfing the web and doing e-mail."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Nice... didn't have to figure out nothing... I just turned it on & it prompted me for everything... Had my mom on facebook & looking at grand-kids  with-in like 15 mins.... very happy... will up-date if anything arises."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I love it!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Mother-in-law broke her older iPad - bought this at last minute - of course great quality, quick delivery.  Thank you"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "It's an iPad, it does what an iPad does and does it well. No complaints."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "This is a really nice ipad.  Large enough to do photo edits and comfortably watch movies etc.  At half the price of the pro... with any non apple stylus its a great choice."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "My wife Loves it"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great product- no complaints- would buy again. I bought this to load games and movies for my son when we travel but I also bought a keyboard so it works as an extra travel computer for me!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "The camera,amazing clarity,storage and speed of this IPad is very satisfying. The sleek design and gold color is very nice. Highly recommend."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "thank"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "It was a gift and the individual receiving it has been more than happy with it.  Thank you."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "just what I need for a second tablet"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Very happy!!"}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "We ordered the gold color, you sent a gold rose. The tablet is super! - Viva Apple."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love it!!!!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "My son bought this for himself, and loves it.  So far no problems or complaints."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Gift for my grandson's birthday. He's enjoying this newer model as a replacement for an older iPad Mini."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "iPads work so much better than android tablets.  Battery life is much better than my Android.  Functionality also much improved."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Got this for my girlfriend for christmas. speed and battery life are great. ill be buying my self one this year."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great. I love it."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Works great."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "These are GREAT!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great just what it said it was"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "great sale. good price, and fast shipping. I love this iPad!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great product; great seller; highly recommended!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I'm very pleased with my apple I pad air 2. It was very easy to transfer from my old iPad"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great product with a crystal clear screen.  I love Apple products!"}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "This product was not new, I returned it. The serial number on the packaging was different to the serial number on the iPad.\nEveryone check the two serial numbers and check your warranty coverage on Apple support website."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Excellent Apple product. Works very well. Would buy again."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "My son loves his ipad. Pricey, but worth the investment as he can do many assignments on it."}
{"rating": 2.0, "product_id": "B00OSKREVG", "review": "This was an open item, not NIB.  The box was opened, cables had been unwound, and the protective screen was removed.  The product has worked without issue for three months now."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Perfect size and easy to use."}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "Could not upload this device.  I spent 2 hrs.  with an apple support personal and they could't fix the problem. I was advised to return the iPad."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Awesome. iPad just what I wanted"}
{"rating": 3.0, "product_id": "B00OSKREVG", "review": "I set it up but once I got to the end to accept terms and conditions it said it could not go through I need help :("}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Received it within 2 days. I'm very pleased with the iPad Air 2. Very easy to set up and use. The size is great as well."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great tablet. Delivery was in one day and the price was excellent as was all services provided by Amazon. I have recommended several friends to look to purchase there izpad's via Amazon."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Kids love it."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "right stuff, right timing"}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "Very satisfied"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Bought two. Both perfect and faster than a speeding bullit."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love it"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I have no problems with it and so happy I purchased one with more memory.  I kept running out of memory on my 16g.  Lots of memory on my new 64g. Got it fast and in good condition."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Super good iPad"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I love my new iPad Air 2."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Awesome"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Went from 12g to 128g. Wow! What an amazing difference. I've only had it for one day but unless something major goes wrong, this was a great purchase."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "It's great really like it ."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "A nice balance between price and performance!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "very fast esay to use"}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "no problems"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Excelent, very fast and fluidity."}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "This product has been slow from the very beginning. I bought it only for use with the Rosetta Stone program and I have to restart it just before each session or it will start to run very slowly and I'm unable to complete my session. I have put up with it for the last 3 months and now I greatly regret not returning it immediately. I had so much going on in my life at the time, that I put up with it and I shouldn't have. It runs like a 5 yr. old device. I have tried all of the trouble shooting steps for clearing away excess apps, my cookies, etc. I just wasted almost 500 dollars on this product and it is completely useless to me."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Got for my wife for Xmas.  No issues with this unit.  Replaced her older unit that would no longer update.  She loves it."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "worked perfectly."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Works great"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love my iPad Air 2."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "It is an iPad - it works - as expected."}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "Arrived locked had to go to Itunes store to figure out how to get it to allow me to sigh in."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "My wife liked it and that is all that metters"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Amazing product"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great iPad."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "New.  Arrived very quickly.  Very pleased with this purchase."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Lots of storage, love the color!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Fits great."}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "Horrible! Was unable to add a line to get wifi anywhere despite it saying g 3G\nThe good thing, was I got a full refind"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great tablrt"}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "Bought for a gift! Opened it up to check it out!\nIt obviously is a pre-owned Used IPad! No thanks! Returned"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Like it a lot."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I thoroughly enjoy using my iPad! I have one complaint. I can only delete my mail 25 at a time!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "This is the second purchase of the iPad Air.  I purchased this as a gift after having mine for more than a year and being completely satisfied.  I purchased mine through Apple, and this one through Amazon.  I chose Amazon because efficient Prime shipping and the opportunity to have my purchase (Amazon Smile) benefit my favorite charity."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "This is my first iPad I've ever purchased for myself and I don't know how I ever lived without it. Online shopping, web browsing, social media, and game apps have become 10x the experience they use to be on my iPhone 6 Plus. Very satisfied!!!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "very happy with purchase"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Very nice, it is not for me, it is for a gift. Did not try  it"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "great price"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "As expected"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "everything arrived on time and as expected, great experience"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love it!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Exactly what I wanted to update my old iPad."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love it. This is my second iPad. The air2 is a lot lighter and has more memory. It came much sooner then I thought it would. I couldn't be happier!"}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "I am enjoying my iPad Air 2 so far so good have nothing bad to say."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Second iPad.  First cover.  Cover adds soooo much to the iPad.  Safety,appearance and feel"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Excellent as I expected"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Just what we needed."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Perfect I love it"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Brand New and works perfect."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Just like it was new.  Nice shape when it came and works well.  Upgraded from an ipad mini.  Good move"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "No earphones"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "This is an absolute awesome electronic device, must get the Otter Box, I did and it has saved the day, many times."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Bought for my mother-in-law on behalf of a friend. Little did I know I would be setting it all up for her. Finally, she is done using a decade old laptop and moved to only tablet life."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Very nice. Light weight, easy to use and great customer service. Thank you."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great price."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Never had one before.\nThis thing was super easy to set up, (I'm a PC user) I get my texts and can even make calls on it when on WiFi!\n(And I didn't get the Pro, or pay the extra $125 for it!)\nIt has enhanced my viewing pleasure 100%.  I mostly use it for photos, Facebook, Twitter and reading online news with my tired eyes.  All my apps from my iPhone are loaded, my music loaded, photos loaded.  All took less than an hour to fully set up.\nI bought it from Best Buy and got a Kmart price match, saving me $40. For a total of $460 before tax. I also broke down and dropped another $99 for Apple Insurance on it, which will replace it 2 times even if I throw it in a river or jump on it myself.\nThis will be my #1 choice of getting information and my new travel companion on trips for a long time to come.\nNothing better after a long day than coming home, kicking back on the couch and hitting the home button, boom, there's the world at my finger tips in a clear, bold, and slick looking screen.\nIt's quick, sleek, and vibrant.  If you've never had a tablet, I highly recommend this one.\nSo far, loving it."}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "iPad itself is a nice well built toy to have, very fast too! Unfortunately the iPad froze up on me three times now where a hard reset was nescessary to get the thing working again. Also it has been stuck in landscape mode and was not going to work unless I did a normal reset.\n\nAll in all I am happy with the product but there are some major flaws which I never encountered with my iPad three which I had for four years."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "New as described."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love it.  Love it.  Love it."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Husband loves it!!!!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Excellent product.  Would purchase again"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Very happy"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "<a data-hook=\"product-link-linked\" class=\"a-link-normal\" href=\"/Apple-iPad-Air-2-MGTX2LL-A-9-7-inches-128-GB-Tablet-Space-Gray/dp/B00OTWQXSI/ref=cm_cr_arp_d_rvw_txt?ie=UTF8\">Apple iPad Air 2 MGTX2LL/A 9.7-inches 128 GB Tablet (Space Gray)</a>&nbsp;This iPad Air 2 was purchased as a 13th birthday present for my son.  It is, without a doubt, his most prized possession!  The Air 2 is everything you've come to expect from Apple, and much more.  I recommend it highly!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great Valentine's Day gift. Wife loves it."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Ordered for my sister-in-law.. She is still learning"}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "Very nice, light, fast. Pretty color. Only drawback is the usual for Apple- no sd or USB slot, stupid unique charger"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I've had this iPad for two weeks now and I have to say it's everything it's advertised to be. It was brand new in a sealed package and it works perfectly. Great price for a 128 GB. I wouldn't hesitate to buy from this seller again."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "love it"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "good iPad"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Happy with purchase...fast delivery, too!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Bought as a gift for my husband. He loves it!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "LOVE this iPad!!! It's the perfect size and weight, and it allows me to get work done without pulling out my MacBook. The charge lasts a long time too. I typically only have to charge it every 2-3 days and I use it daily. Great buy!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "the best."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "it's fine"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love my new iPad Air!  Highly recommend!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I bought this for my husband so that he would stop stealing mine all the time. Great buy."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Excellent condition. Arrived on time. I love my iPad!!!!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "So far, so good. It came in perfect condition and works very well."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I love the iPad Air 2.  I have had no issues with it.  Apple always provides great service if there is a problem."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I really like my iPad 2. I like new features."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Absolutely love this iPad. Lots of memory / ram. By far the best tablet I've owned so far."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "came brand new in the box and works like a dream.......a big step up from my series 3"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I think there are a thousand reviews saying how great this tablet is and it's all true. The screen is absolutely fantastic, I love the battery life, it's awesome that I can go for a few days between charges even with using it for several hours each day.  The list goes on and on, I honestly cannot find a single negative about the Air 2."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great product, price and it was delivered in two days."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "This was a replacement for an older iPad.. 128gb storage is great, speed, display and wifi are all light years ahead of the older version...."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Best iPad yet"}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "It's fine."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Very satisfied."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Aah...much better than the old iPad that I had been using."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "It arrived on time and brand new."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great Seller! Great Product!  I received exactly what was advertised."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "My son loves this!  Works great for most everything.  He loves the large screen and clarity.  He does a lot of gaming, and the size makes it so much easier to use than his laptop or phone."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "My wife loves this new Ipad."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great IPad."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "This is a wonderful product. It came on time  and it works great."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "nice~"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Good seller. iPad working good."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love it."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "love it !"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I love my iPad! Thank you Amazon for the great deal & service!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Amazing!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Very pleased with my iPad Air. Very easy to get to get it up and going!!!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Considerably lighter and faster than our old iPad generation 3."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Exactly what I wanted! The screen is a good size, with fantastic clarity from the retina display. Light-weight and quite comfortable to carry around. Very happy with this purchase!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I really love this device. Much easier to navigate then my older iPad. Very pleased with the device and the price was right on!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Outstanding product!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Bought for my son who loves it"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Really really nice."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "My iPad Air 2 is now my favorite device  blazingly fast, absolutely gorgeous screen, incredibly slim  it's exactly what I was expecting it to be. I'm not going to spend too much time reviewing the iPad. There are plenty of better technical reviews of the iPad Air 2 out there. I don't have anything to say that hasn't already been said.\n\nI wanted something portable and powerful enough for reading PDF articles/manuals/texts/etc, casual web browsing, and watching movies. The iPad A 2 is perfect for this. I have a PC and I wasn't looking for a laptop replacement. If that's what you're looking for, the iPad Air 2 is not for you. However, if you're looking for a great, portable device for web browsing, media consumption, etc, then this device is for you.\n\nI initially had some concerns about ordering this from Amazon after the reviews from people receiving fake, damaged, or incorrect model iPads. I'm not going to lie  I was super nervous. My concerns were not justified in this instance. The iPad was in it's original, factory wrapped package (as far as I could tell), and it had no visible imperfections. I was still a little concerned, even after opening the box and seeing everything appear nice and new as expected, so I decided to be safe and purchase the additional Apple Care protection. I figured that if I was able to enroll this device in Apple Care then I could be absolutely sure that it wasn't a fake or factory defect model. I was able to enroll in Apple Care with no problems. I did end up having to do it over the phone though because the Amazon purchase date is not recognized as the actual purchase date from Apple. Still, one ten minute phone call later, my iPad Air 2 was Apple Care insured and I was feeling great about my purchase.\n\nPurchase details:\n- iPad Air 2 - Silver - 128 GB\n- Purchased through WorldWide Distributors\n\n*I swear that I'm not a paid shill for Apple, Amazon, or WorldWide Distributors (admittedly, I'd say they same thing even if I were, so probably just use your best judgement when considering the honesty of my review)"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Outstanding value."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Everything is very good.but  i received a message that there is a big discount in best buy "}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Perfect, I feared buying an iPad on amazon but it was just like a store purchase!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Just as advertised.  Love this item, it is much better and does more then any other tablet I have."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "It came very quickly and it works.. I'm very happy with it"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Terrific product, very fast, super quality. With the Anker keyboard case it makes a great little laptop."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Good product"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Ordered this for my sister  in law,  her first ipad and she loves it. Easy to setup. Good price and fast shipping. Would recommend this seller and Amazon."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love my iPad Air 2."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great company, great pricing & very satisfied with my new iPad. Thank you."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "good"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Very nice and it arrived early. Would purchase this again"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Zxc"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Gift for grandson and of course it was very pleased."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "After almost 2 weeks of use, the iPad has worked flawlessly. I recently added a tempered glass screen protector, otherwise, the screen easily shows smudges, fingerprints and marks using a stylus, much like the smartphones do. A screen protector eliminates a large part of that issue. The iPad is light and has become easier to use than my MacBook Pro for many of my app related interests."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I am sad to see these be discontinued for the only other option of the Ipad pro. I wish they would continue with this series, as this product is just the right size for what we do and these ipads have been very reliable. Our company owns about 45 of the Ipad Air 2s and we love them."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I have had an IPad 2 for 4 or 5 years and couldn't live without it.  But it was getting slow and the battery needed daily charging.  I also needed more room.  I ordered the IPad Air 2 and was very pleased it came fast and was just what I ordered.  I am very pleased with my purchase"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great price, fast delivery, and I love this Ipad! Thanks!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "This was a gift for my beautiful lady! And she loves it!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great deal very happy with the purchase"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Fantastic, but has a little earning curve if one s used to android and Microsoft. I bought this mainly to work with Cricut Explore because my desktop stopped working and had a few kinks but everything is working fine now. I think I'll enjoy this for many years."}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "This iPad was to replace my older iPad and what a difference. The smaller size takes a little getting used to but the speed improvements are amazing.  And for me coming out of what seems to be the dark ages into the light has it's advantages too. One plug for both iPhone and iPad, what will they think of next.  Gyro still gets stuck one in awhile, otherwise it would get 5 stars"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "How great is that!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great buy. Arrived on time. Works perfect."}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "good"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great product! I love it!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Happy with purchase"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love this Ipad."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love my Apple iPad air 2. It is everything described .  Had some concerns because other reviews said that iPad purchased from Amazon didn't qualify for Apple care plus protection. That is not true, mine qualified and went through smoothly. this is a brand-new product. I talked to Apple customer care the serial number matched. thank you great product!!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I love Apple and their products and I was way overdue to replace my iPad 2 - poor thing, I just wore it out! My new iPad is wonderful and I couldn't be more pleased.  I have noticed I need to charge it more often and I'm not sure why that is (techno-challenged) - probably something I'm doing!  It's certainly not a problem plugging it in more often - not a complaint, just something I've noticed.  You can't go wrong with this tablet - very very happy with my purchase."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "It was in great condition! You can tell it was packaged with care and it arrived safely. iPad works great and appearance had minor flaws just as described. Very satisfied with this purchase."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Completely satisfied"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Just what I expected.  Absolutely love it!!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Very satisfied and grateful for the article ... everything is perfect ... very happy with the great service .. Thanks"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Very nice, as expected!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I've owned iPads in the past, this met my expectations."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Everything worked out great the package came on time"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Very Good"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Happy with product"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "love this iPad and I bought the JETech iPad Air 2 Case Slim-Fit Smart Case Cover for Apple iPad Air 2 Second Edition w/Auto Sleep/Wake\nin Gold for my cover."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Excellent! Very fast shipping and I really enjoyed the message in the packaging! Thank You!!\n10/10"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "what can I say- love Apple"}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "I bought it as a present for my 9 year old granddaughter. She is thrilled with it."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Awesome product"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Excellent tablet for the money."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Wonderful item. Very glad I have it. Item just as described. Original packaging. Would gladly do business with these people again. Quick shipping also."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great product"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I have had several tablets but this one by far is the best. I especially love the pictures that it takes. I plan to buy one for my daughters!"}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "IPad did not work. I could not set it up. I returned it after checking with a local computer tech & they suggested  I sent it back. However after they got it they stated that was OK and charged me a restocking fee plus a $10 postage fee. I was very upset and will not order another one thru Amazon. I will get better results buying one from a local big box store."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Perfect! Love this iPad "}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love it"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great"}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "it does everything I like to doe, still getting used to it. only had it a week or so."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Just as described, Brand new , sealed right from apple , couldn't be happier with my purchase. Excellent seller with excellent products and prices. Customer service is excellent as well. Will definitely buy from them again."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "This was a gift for granddaughter and she loves it."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Wonderful gift for my mom!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Very pleased with iPad Air 2"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love my iPad!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Works well.  Very pleased with the entire transaction."}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "I rec'd this, brand new and sealed, as a Christmas gift a little over a year ago.\n\nAfter about 14 months of gentle, indoor use, I had turned it off overnight, as usual, leaving it with about 60-70% power.  The next day I tried to power it up and it would not come on.  Just a black screen only.  After following the suggestions given by Apple Chat with no results, I took it to the local Apple Store Genius Bar tech.  He tried to charge it up with their charger but it just remained a black screen, period. The tech tried hard to diagnose it but since the screen wouldn't show anything at all, diagnoses was too hard to make because the screen showed them nothing.  Their \"best guess\" was that the inner works were somehow preventing electric charges to be processed, though it ws agreed it was a little mysterious since it was already charged at 60 or 70% when I had last turned it off.\n\nNothing else could be done. The back of the box states \"Battery life and charge cycles vary with use and settings.  Battery may eventually need replacement.\"  But the Apple store said they never try to replace batteries, they just replace the tablet, but mine was now not under warranty.  I could order a replacement from them for full price $299.00.  Also, they don't sell used or refurbished tablets,  Or, how about ordering an IPod or IPhone?\n\nI guess not."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love it.  Easy to set up.  I had an mini before and was concerned about a larger one, not a problem."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great Item"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "The Ipad air 2 is still very well worth it, even in early 2017.\n\nI use it mainly for media consumption, surfing the web, playing the occasional games. Nothing too \"pro\" and I think Ipads are meant for this type of use. This particular model, which is now over 2 years old does all that very well, it is still quick and snappy. No lagging, even after running Garageband, Netflix, chrome with multiple tabs open and whatever game all at the same time, switching between those apps in a quick manner just to see if the Ipad would slow down... nothing, it handles this type of actions and heavy usage very well. Recommended!!\n\nPD: The Anker keyboard case is a perfect match!\n\nEDIT! (1 year later)\n\nStill perfect! I can say the same things I said before and it all applies to 2018\n\nJust wanted to share a picture of the iPad running gta vice city xD sorry for the yellow lighting."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "display is brilliant"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Product was as advertised.  The shipping was as promised.  This was a good transaction."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Bought 2, 1 for my wife, 1 for me and we love them. They link beautifully with our iPhone 7+ phones. Only drawbac is they are hard to put down and do some work around the house:)"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I really love Apple products and not because I'm computer illiterate. I've been in the IT field for over 15 years and the last thing i need is a product that doesn't work well. Apple really do a great job in the quality of not only the exterior but the IOS is great! It's smart that the people that make the hardware make the software that runs on it too rather than having any joe shmoe make what ever app they want."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love the iPad!  I had purchased 3 Nexus tablets (refurbished) in the last 5 years. They all had problems after updating. The last one finally would not start up at all. Thankfully I had backed up all my pictures on Google Photos so was able to get to them from my computer and my iPad. I decided this time to try an iPad as my sister had hers for 8 years before having to replace it. So far, so good!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "great"}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "product did not work but for a couple of days-need to find out how to return- no information came with the product"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Totally what I wanted."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Awesome!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "very happy with the purchase price and speed of delivery"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Perfect!"}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "Very fast, Beautiful color. I own other tablets but this is my favorite. I have been using the iPad Air for a couple years or more. I bought it when they first came out. The only problem I have had was the charger port went out or the battery died. I'm not sure which one because I had them both replace to fix the no charge issue I was having. I really missed this tablet when it was in the shop. Saving my pennies for an iPad Pro right now."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Exactly what I needed! In great condition."}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "Awesome I Pad! Camera isn't that great but otherwise great!!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "This is my first iPad and I'm really enjoying it.  It is easy to operate and it has all the apps I need.  Adding even more apps is a breeze."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Arrived on time and performed perfectly"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "great"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "My iPad 2 died, so I replaced it with this one.  Works great, quick delivery, immaculate packaging."}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "Got on time.  It works as it should."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love it.  https://images-na.ssl-images-amazon.com/images/I/519Kc2cGqOL._SS300_.jpg"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I had the first generation iPad, excellent upgrade to the iPad Air 2. Love the new features and it came as advertised. The 32GB is more than enough to meet your needs"}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "As I receive the iPad, I am shocked that it was packed in an outside envelope, and it do damage to the box of the iPad, and the there is also a tiny scratch on the screen of the iPad, so I will give it 4 stars."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love it."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "My sister was stuck in the 20th century, terrified of all things technological ... then along came iPad Air and ... HELLO MODERN WORLD!! She is in love with it and never stops \"playing with it\" and making new discoveries each day. Steve Jobs, you have altered yet another life. Thank you."}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "Apple makes a great product.  It sure would be nice if you could add memory without buying another one."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Awesome tablet!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "As expected - easy to set up and transfer information from old one."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Wow"}
{"rating": 3.0, "product_id": "B00OSKREVG", "review": "Nice little tablet kids loved it."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I love my iPad"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I love it. Waited a long time to purchase. Great for work, I am in the real estate business.\nAlso great for anything else ! No more having to carry my laptop. Screen size is really good."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "My husband ave I love these. It was the perfect choice for our schooling as personal life. Best decision to buy them"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "This is my first tablet.  I bought it primarily to use for casual web, email and audio/video streaming around the house in place of my iPhone.  However, I'm probably more demanding of my devices than most.  I'm  streaming a lot of content from my NAS to my phone and starting to feel the eye strain of the smaller screen.  Additionally I run NAS management, astronomy and instrument tuning apps as well as others.  That said I really researched alternatives not convinced I wanted to be locked into the Apple ecosystem.  I'm something of a gadget guy/tinkerer and closed technology ecosystems make me claustrophobic.  What clinched the iPad Air 2 for me was the ability to mirror the phone's functionality anywhere on my network.  At home, one device, all functionality, big beautiful screen.  Closed ecosystem?  I'm not a cloud guy.  My data - my box please.  Answer.  Integrate with NAS and go bigger with onboard memory.  I'm very pleased with my choice.  Well built, beautiful display, excellent battery, and the consistency and reliability of the closed ecosystem.  Video performance seems flawless.  Biggest surprise - excellent quality speakerphone!  I still use a PC.  But, Microsoft - you're losing me....."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Exelent"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love my iPad Air 2. Don't know how I was able to live without one until now. Never leaves my sight for very long. And everything works and never crashes."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love this. Can't say enough nice things about it. I had the first generation iPad, traded up to the next, then to this one. So far, this is my favorite. I got a keyboard to go with it, makes it just like having a laptop without all the bulk and hassle."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Wonderful item"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Came quickly and so far its working great!"}
{"rating": 3.0, "product_id": "B00OSKREVG", "review": "I waited a long time to get a tablet. I had an Android pad for a while which was fine but recently thought this idea of an iPad Air made so much sense. However, I've gotten used to the amazing keyboards and keyboard action of the samsung products. Even after purchasing and installing Swype as a keyboard, it does not work so well in this environment. The whole way things are done on an iPad seems arcane to me and not very forward thinking. The functionality is fine. The screen is great. But the usability just isn't there. So, good but not great and certainly not cutting edge."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "My first iPad and I love it."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Just as described. Brand new sealed in original package."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "works great"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Use it daily it is wonderful!  Glad I bought it would suggest it to anyone who likes the mini!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love it."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "My second I pad and I love it"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "This iPad worked well right out of the box.  We use it regularly at our office and it has been excellent."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great quick delivery with well described item."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Awesome!  Much better than the IPad Air and shipment was spot on."}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "Very fast and clear images.  Much faster than old one.  Highly recommend."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "It has a lot of storage space and it's a lot like the iPad Air."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Looks great. Works great. Love it."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Works great for low-vision mom (age 88) to do FB and FaceTime with grandkids - she is not computer literate, but she can work this device easily.  (Previoulsy tried a Kindle Fire - it was very confusing for her and very hard for me to support her long-distance.)"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Came brand new in original box and wrapping. It's perfect thank you!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Shipped on time.  Correct product...love it."}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "The charging cable went bad in the first few weeks. It was somewhat difficult to get a replacement from Apple, but after jumping through several hoops, it finally got done. It would seem like the cables supplied by Apple are often the weak link in the ipad world as many folks are posting of similar problems."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "No issues with this iPad. Good buy for the price."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I needed a tablet to retire my aging 2009 Macbook Pro and found just what I was looking for at a great price. I like how you can attach a keyboard case to the tablet, making it become similar to a small laptop. Over the past couple weeks the experience has been great and pictures are included!\n\nPros:\nOverall Performance\nBattery Life (Usage & Standby)\nPortability (Weight & Thinness)\nSplit-Screen multitasking\n\nCons:\nHeavily restricted OS (Limited to iOS app store)\nLimited functionality compared to a laptop\nSpeakers too powerful for housing -> Can cause vibrations at mid-high volume"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love  it."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Luv it...."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "nice"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great iPad, very fast, easy to use."}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "More than expected."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Arrived safe and on time....it replaced one that had several years of hard work."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Perfect in every way!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Outstanding"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I love it .  It works great!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I love this iPad.  Changed from an iPad 3 and this is a big improvement.  I love the thinness of it!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Gift for the wife.  She loves it and uses it every day for long periods of time."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "If you don't have an ipad yet, what are you waiting for? Boots up faster, much more convenient and the battery lasts what seems like forever. I couldn't live without mine"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "It's functioning well, I have no problems so far. It's functions as expected. I'm happy with this purchased."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Muy buena definicion"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "It was the standard iPad 16gb I have no complaints"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "It's apple works great!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I've been an Apple user forever and currently have an iPhone and a MacBook Pro. I've held off for a while buying a tablet because I just didn't see a need. However I'm bypassing cable to watch tv and movies and the screen on the phone is too small and the laptop is too bulky to carry around. The iPad is just the right size without adding features that duplicate the laptop. I did not consider any other tablets because the interconnectedness of the iPad, iPhone, and MacBook was important and as a longtime Apple user I know and trust their quality."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "What can I say?  It works as advertised, just as an Apple product should."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great price and Apple quality."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "great job , I got it fast way befor my time to reccieve  ,, the pad is what it said it was and mor I recommend it to any one if you want a great I pad this is it easy to learn to work, thanks you"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "My dad loved this update, as his iPad was about 7 years old."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Never thought I would like a product as much as I like this pad.  Don't regret it. Got a great price."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Good!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love my new tablet, zero complaints."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Set up was easy.  Transfer of files from icloud working fine"}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "I  did not know it doesn't have a Sim card. I'm not happy with this ipad. I want to return it for an iPad that uses a Sim card."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Enjoying it. It was an upgrade for me. The former I Pad died.  This one has many more options.  I just have to learn them.  I assume there  are instructions on the site.  Love that it is louder.  Thank you, it's great."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "This is replacing my very old iPad 2 and the performance and speed is sooooo much better. There's really not much I can say, other than it is a typical Apple product--well designed and physically beautiful. Pictures look amazing."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "It is fast and is a nice size. It has nice resolution.  I have an iPad mini and they are similar but this size is better for me now."}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "Works great!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Just what I was looking 4"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "The iPad Air 2 is fast and fantastic! Great speed and crystal clear picture. We love it!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Nothing to be said; exactly what I thought I was ordering; prompt delivery; no problems."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Gift"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Do we need to write reviews!!!! Decided , buy and forget it."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Amazing, really awesome. iPad Air is worlds lightest high performance tablet. I love it"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Decent Ipad2 replacement if you like Apple."}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "It's great "}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love it. Replaced a really old one I had and it works great."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love my iPad Air 2 - 32GB, it's an upgrade from my iPad Air 16GB. The extra memory is great b/c was always running out of space & having to delete apps. It's also much faster! Gave my old one to my wife to upgrade her android "}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I gave it as a gift.  As far as I know there have no problems and they were very happy with it."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love my new Apple IPad Air 2, highly recommend!!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Excellent!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I like this a lot.  Functional in many aspects."}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "Just received anxious to open it. Hope I can learn the apple, I've  always used a PC"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Product exactly as listed"}
{"rating": 3.0, "product_id": "B00OSKREVG", "review": "I bought a 32gb gold ipad air 2 at best buy..it took forever to charge  (4) hours..the battery drains really quickly when in use..after about a hour and a half to 2 hours of light use it was back down to 15 percent..I returned it and got the same ipad again..the same issues..apparently you don't get great battery life..not to mention it took 10 to 15 minutes to download the netflix app..the other ipad didn't take this long to download any apps..apple could've done better especially with the battery situation"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love it!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "It was exactly what I wanted, at a great price. And received it into days with Amazon prime. No problems at all."}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "ipad screen was broken to pieces before arrival"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I am so in love with my ipad Air 2. Quality wise it doesn't get any better then the Apple ipad."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Beautiful product, fast shipping!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "All good, thanks"}
{"rating": 3.0, "product_id": "B00OSKREVG", "review": "It takes 4 hours to charge and you don't get much battery life out of useage..I'm considering returning it due to these reasons"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "This was a gift for my wife. She loves it. Thanks!!!!!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great product"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Makes a great gift"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Purchased this for my 10 year old daughter! It is perfect for her! Great product!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "It was a Christmas present for my daughter.  She loves it."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Excellent.  What a fine tablet.  I came from an iPad 2 so of course the speed, the lightness and the beauty of the screen all stand out.  it's a fine piece of gear and I heartily recommend it.  Superb."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Very happy with purchase."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Excelent"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love my iPad.  After doing some comparison shopping, this was the best price."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "It was a Xmas present for son in law and he loves it..."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Everything I expected."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Am very happy with the product and continue to enjoy it every day."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Works great I think! My wife stole it from me once she tried it and has not put it down since."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Great price and it was the correct model and everything. couldn't be happier. was a perfect Christmas gift."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Best purchase! So happy about this!! Love it."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love it."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "I love the iPad Air 2! Awesome!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Excellent!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Love my new iPad. This is my third one and it is so light. Very easy to set up."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Product exactly as  described. Timely delivery and  signature required too. Very nice. They did not ever return my emails about the product though. I also could not reach them by phone either. Lastly when the iPad Air 2 arrived it was covered in fingerprints, display stickers (the cheap paper ones that do not peel off in one piece) and the really thick sticky glue from the security alarm. It took a half hour to clean all that off. If at any point they had made contact I may not have mentioned the disregard shown to my order however this is 2 notable  deficiencies. That being said. Please focus on the first 2 sentences of this review as they are most relevant."}
{"rating": 3.0, "product_id": "B00OSKREVG", "review": "One would expect that the iPad air 2 should come with a pencil that writes and draws on the tablet since the less advanced iPad 1 has such a feature.  Well it does not. If you are an artist stay away from the  iPad air 2 or read the description VERY carefully. Do not expect that features of the iPad 1 will necessarily be present on the  iPad air 2."}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "I have owned three generations of iPad; the iPad 2, iPad Air and now this iPad Air 2. I've enjoyed each of them immensely. As the units have aged I've made gifts of them to my grandchildren to their delight. This model is thinner, lighter, faster and has twice the standard memory. It's a fine substitute for a laptop for most people assuming that their computing needs are limited to mail, the web, apps, photos and movies. On that basis it's a steal. It's also a lot friendlier than a Mac or PC because it requires next to no maintenance and there's nothing that breaks or wears out. Just keep this baby updated (Apple provides free updates automatically) and it will last you for longer than you want to keep it!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "To replace the original Apple I Pad.  Also a gift and they love it"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Awesome just awesome"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "It was a gift for my wife . She loves it."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "But it is Larger than 9.7 inches!!!"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "every dollar i spent on this worth it....im a youtuber with 4k sub and i will be reviewing this"}
{"rating": 2.0, "product_id": "B00OSKREVG", "review": "After only 1 1/2 years, the iPad died.  Thought they had a better reputation or I wouldn't have paid so much money."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "El servicio de envo sper excelente y el artculo Wao est en su funcionamiento es al 100%. Gracias"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Good product"}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "Just like mine / got it for Dad. He loves it."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "It is a beautiful piece of technology."}
{"rating": 5.0, "product_id": "B00OSKREVG", "review": "very good.."}
{"rating": 1.0, "product_id": "B00OSKREVG", "review": "stopped charging after six months , seller will not respond to my  request for help"}
{"rating": 4.0, "product_id": "B00OSKREVG", "review": "Love it."}
