{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I just this tablet today and I'm in love with it.it works great...my husband wants to get one too"}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "Its a good tablet for $50 however the background colors aren't all there,  they are not nearly as vibrant as let's say a Samsung galaxy note tab 4 thus making viewing the screen difficult for long periods of time also I don't like how certain apps aren't compatible with this device such as PayPal and my bank but are compatible on my android Samsung tablet as well as my android phone.....good for the money but I'd rather save up more and by a better one."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "This is the second time I purchased this tablet. I usually use this for web browsing and this tablet made my day. The internet speed is fast even though it is connected to WIFI. 7 inches screen is big enough for me since I use iPhone4S and it is way bigger than my phone screen....  The camera has font and rear facing just like an smart phone. It also come with some handful apps which I haven't have a chance to play with. Well, I don't do a lot of things with a Tablet PC, just web browsing and watch some videos/movies and that's it. I kind of like this tablet so far. Thanks."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "It is a very awesome product. Very easy to carry to beach, school, and so on. Great screen display. Google Android system. It also have a year warranty. So I do not really worry if any problems in this product. Amazingly it also has bluetooth. So basically, I paid 50 bucks but I bought everything. Such a good deal!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "This product works so well that I will actually suggest my friends and family to buy this. I don't like mac, so I always use android product. This product matches all I need and I definitely will consider buy this as a birthday gift to my husband. The apps and music works really good and I really like the Bluetooth part of this product. I can connect it with my speaker and play loud music at parties. Overall, I think people should buy this and discover more about this product."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "NeuTab N7 Pro Quad Core tablet over-runs most tablets in the market. It is an upgrade version of their old N7 model. They have increased the storage to 8GB, expandable with external SD card. The processor is now quad core compared to dual core on N7. After installing bunch of applications, I still had available 4 GB free space. I had no hardware or hang issues with this tablet. I did not face any issue at all out of the box and have been using for days with no issues. The capacitive touch screen was really good, some occasions I had to press little harder and at right locations, but pinch-zoom, highlight, Copy-Paste all worked very well.\n\nI had no problem playing popular applications that I can find in google play store. Streaming online video is also an easy job. I used Netflix and it gives no lag or any issue that stops me from watch my favorite shows. The Wi-Fi reception is good. I live in a townhouse and I can have it on wifi in every room. I usually turn WiFi off as I play games so save some power. There is a built-in 2800 mAh Rechargeable Lithium Battery. Battery came for a good 6 hours with moderate usage. Battery usage really depends on how heavy you use the system.\n\nPros: Very affordable, has an external Micro SD slot (invaluable!), lasts 3 - 4 hrs on a charge, uses the same charger as my cellphone, charges pretty fast, is light, holds quite a few movies without the expanded card slot, connects to our WiFi fast and has a quick connection. Mini HDMI output! Android 4.3 Jelly Bean OS and is upgradable (I believe).\n\nCons: Viewing angle is not the best, battery could last a bit longer. Your teenager will be happier you if you buy them a Samsung Galaxy or iPad!\n\nFirst and foremost, this is not a replacement for a $500 iPad or Samsung tablet. Do not think this has anywhere near that ability but for $55 I was under no illusion that it would."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Good performance and it is so easy to carry! I use it for school, which is really nice!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "It's a good and easy-to-use tablet. Everything works good. The screen is pretty nice and has pretty good display performance. Weight is good for holding, not too heavy. It has many practical functions. Like it a lot."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Bought it for my dad and he likes it!\nEnough for him!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great product for the price you paid for.  Using it for games and social network,, I just love it ."}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "Inretured not what advertised."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "This was an absolute waste of money. After less than a month it simply stopped working. Display resolution is horrible too, especially if you are used to using a device with high quality resolution and clarity. Save your money and buy one of the better brands which will give you value for money."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Horrible waste of money.  Never worked well.  Do yourself and your kids a favor and just get the Amazon fire fir your kid."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "cheap, cheap. cheap. not one good thing to say about it"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Good tablet for home automation use. The screen could be a bit sharper."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Love it"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "My son loves his tablet that his grandmother got him. He can't do anything without it and it holds a great charge on it and he's on it all the time. I recommend this to anybody who's looking for a tablet for a child."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Good product, adequate size and robust"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "it the best out there go get it"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Got this for my son for Christmas!!! I know he will love it!! It arrived on time and works great!!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Absolutely love it. This was a great gift."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "For the price, seems like a decent little tablet. Does everything I need!"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Love the tablet great for price and fast shipping"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "This is small and perfect for the kids"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Device has a good resolution, very handy and compact, responds well to commands."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Great. Basic android device comes with free usb cable"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "You can not go wrong with this tablet. Very great deal. I absolutely love it."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Easy set up and great cost."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Perfect for netflix n chill or studying"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Good option if you are looking to buy an inexpensive tablet that will be used for apps. Battery last a few hours. I am currently using mine in my car with my obd2 reader. Great for displaying what I need."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Nice tablet at low cost, but documentation was lacking."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I gifted this to my grand daughter. It works just as good as much higher priced options."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "It works good"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great product! Couldn't be happier!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Awesome tablet for the money!"}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "Just getting started with it, seems like it is full featured and sound. I still need to figure out how it works but seems like a good valu and full featured."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "These just didn't live up to what we expected and broke fairly quickly for my teens"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "This is a great little tablet. Very easy to use and setup."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Wonderful tablet"}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "Still trying it out ok so far."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Great value!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "It'll do exactly what I need it to do, which is run a car diagnostic app with the Bluetooth dongle"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I love it"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "I got for kids"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Es muy cmoda, is with a good shape that bring confort"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Bought this product as a gift for my son, because of good grades. He absolutely loves it. Great price for a great product."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "I've only had it an hour, so I don't know much.  I love that it's easy to turn on and the picture is excellent.  I'll have to write an update as I play with it more"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "I like the simplicity of use and the Android OS is easy to use."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Came fast exactly what I ordered great 10/10"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I just bought this tablet but it is a great beginner for you or your child. It is a great backup to my computer. I recommend this tablet to anyone looking for a great tablet."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Nice tablet for the price! I use it primarily for my car, connected to my OBD II Bluetooth scan reader so I can display custom gauges while driving. You will need to use \"Advanced Task Killer\" before playing YouTube videos or any other APP requiring most of the tablets resources."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Very happy with product.  Everything I expected it to be.  The blue tooth works very good and picks up my speaker very quick"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Easy to use"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great product would recommend to family and friends."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Tablet works great, right out of the box.  Easy setup!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "great for the money"}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "my wife ordered 3 of the N7PRO\"S and the one I have is extremely slow and even after downloading the cleaner like the manual suggested  it still is very lagging and it crashes constantly and  freezes up"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "It's a great little workhorse of a tablet. Light, simple, easy to set up and go. It's not the speediest or the most powerful and there are some apps that won't run on it, but I didn't need it for that, just to have a cheap and light tablet for mobile note taking and a few of my more used apps (Kindle, sudoku, a QR reader, etc.) The touchscreen is responsive and fun to use, and so far it's been durable too."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great for the price!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "daughter loves this tablet"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "well for a kid"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "I am excited about using my N7Pro"}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "Works like a droid. Pretty slow for gaming, but okay for just email."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Affordable and reliable"}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "Not a great product. Pretty much what I expected from a cheap tablet. Thought it might be a good beater tablet for the garage, but it can't even keep up and hardly works currently. Pony up some extra cash and get a real tab."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "Was okay for being our son's first tablet but I doubt I go with the same brand again."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Works great even after I dropped it once. I ended up buying a case for it and now it is my controller for my in ears."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I bought a Neutab 7 inch android from amazon.com .Im well pleased with it so far. It readily runs the apps that I prefer, has dual cameras for pictures and video, gives me a great portable platform for audio books and music, and will give me a good alternative for browsing the inter-webs when I don't care to lug my laptop around. Overall, an excellent value for the money."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great buy"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "This tablet is great for a casual user. Someone who likes to play with apps, browse the internet or check their Facebook.  It's easy to use and the display is crisp and bright. The battery life is pretty good... I can use it for a couple of days before needing to charge it. The responses sometimes require an extra touch, but unless you're a serious gamer or something I can't see that being an issue. It holds a decent amount of apps and pictures and there is the ability to add another card for more memory. All in all it's a pretty great tablet!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "This tablet is really good, it has the google Android system which is what I look for as I like to be able to download the games from there. I really like the clear display, it is pretty fast, very easy to connect to the wifi.\nWe use this tablet for basic things like games for my kids, candy crush ect for me and it works wonderful for that. I use it for email and searching the internet it works great for that! It holds a decent charge, like most devices it lasts almost the whole day before needing to be plugged in again. The charge is normal speed. For the price of this tablet it has worked for my needs."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Great product for the price. Will work great for the simple things I need to do."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "It's factory defaults to China. Virus scans hit on google speech for some reason,but unable to remove it. It's firmware build in so I wouldn't trust any personal information on these. If you want to use this to manage your bank account online or anything like that I would seriously not recommend that.\nI would use this as if it is watching and tracking you at all times. I don't put personal apps or accounts on it.\nHowever,if you use this for playing around or just some random surfing it's okay. The cameras are meh,but it has both front and back ones so that's actually awesome for the price!\nIt's a decent tablet to have as a spare to tote around those places you're too scared to take a high priced one to.\nThey don't handle the cold well at all. My screen cracked all the way through in 20 degree F weather."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I like its."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Tks"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Lagged horribly Froze more then 100% of the time"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Love it"}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "It's a great tablet but the power button isn't working anymore so I'm going to have to send it back. The plastic is cheap but for the price it's worth it."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "Slow downloading"}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "We bought it to be a remote for our chrome cast. It didn't last very long. It's kind of flimsy and we accidentally dropped it a short distance once and the power button popped off, never to be seen again. And after that it just kind of started falling apart and eventually was complete trash."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "The item was not a good buy.  The screen blanked out in after a few weeks.  All I saw on the screen was total whiteness"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "The person that received it could not get it to work."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Table of poor quality, I only hard for 2 days, I bought it for a year-end gift, I got it off and I did not buy it anymore, I think that was the reason for selling it, leaving it bad because it's totally disillusioned Even with the seller, I lost the money of the purchase and the shipment"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Too slow, and way too glitch!"}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "A decent tablet. Pretty much got what I paid for."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "could not get it to work properly."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Good for about a month.....then died"}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "You get what you pay for. Scratches easily, very very slow. Couldn't even use it to read a book online."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Piece of junk. My expectations were low but I needed affordable tablet to read my online textbooks. This lasted 4 months before it wouldn't turn on at all. My low expectations were too high. Seller was non responsive."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Waste of money"}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "You get what you pay for. Simple, nothing extra. Poor Wi-Fi connectivity and picture resolution.  Mine fell apart after 4 months...like the insides expanded and it came apart at the seam.  Thankfully I had already transferred everything off of it I needed."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "It's okay for the money, just not a replacement for a nicer tablet.  Disappointed with the screen quality."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "I bought this to use for listening to audio books, however, it is much better for just playing games.  The battery doesn't last all the long."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Quick shipping, great product, works like a charm."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great preformance"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "After only a few weeks, the tablet won't retain a charge for more than a few minutes.  Very disappointed in this product and don't recommend it."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Fast shipping and tablets came new and like advertised. DO NOT WASTE YOUR MONEY. Bought these for my 3 kids last christmas and they used for a few months with NO damage from my kids and just stop charging and stop working. Pay the extra money and get a tablet worth it. This was a waste of money and disappointed my kids got these for christmas and only used for a few moths I will pay for a name brand like Samsung galaxy tablets next time"}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "Has a very slow response time.  It lags all the time.  Very annoying."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "It stop working after days of using. Got a replacement and the same issue. We finally got our money back"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "works as it should"}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "Very light and slim, but some of the favourite apps from the store can't be installed. Good for kids and some social networks.\nYou need to root it, if you want to install something in the Micro SD."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Excellent"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Easy to use and navigate"}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "NeuTab N7 Pro 7\" is an o.k. tablet. Always wait to review products in order to evaluate properly. After having this tablet for exactly 1 year the system froze up and I was unable to utilize any of the functions. Had to send to an IT expert to reset. Have not received tablet back, but have been assured it is operational. Screen quality is good, but flips from horizontal to vertical without tablet movement. System is a bit slow that might be due to my home WiFi. Taking pictures with this tablet is of average quality. May post again when I have a chance to play with the tablet."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "https://www.amazon.com/dp/B00THEMRX8/ref=cm_cr_ryp_prd_ttl_sol_22"}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "It died within 6 months.  First the screen turned an orange color around the edge and then two months later the sound was gone.  I would not recommend or buy again."}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "Tablet worked OK at first, but slowly (insufficient RAM).  But problems appeared after just a few months.  The battery stopped holding a charge, so the tablet worked only when plugged in.  Then the plastic case began to separate at the seams.  Finally, the tablet stopped functioning.\n\nThis was a very low-cost device, and I guess I got what I paid for.  In future, I'll stick with brand-name electronic devices."}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "I purchased this for my 10 year old son and he doesn't like it at all. It lags/runs very slowly. He mainly watched YouTube and found this tablet to be painfully slow. He now wants an Asus again. Other than that, delivered quickly and worked as you would expect a $40 tablet to work."}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "You kinda get what you pay for I used it about 3 or 4 times the quality it's very good on it just fells very cheap and the display is awful but it would work good for just a nice internet browsers device to have laying around."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "its okay"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "returned because it was to small actually thought I ordered a 10 in so I never even took it out of box"}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "Gave out rather quickly."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Don't buy this. Lasted only 2 months and it stop working. No picture on screen. I kept on charging it thinking maybe the battery is dead but this junk still didn't work. Get what what you pay for."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Very fragile product...I bought this for my daughter and she accidentally dropped on the second day of use. Product no longer works and screen is cracked. Only buy for child if you also get a kid proof case."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "good quality"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Works very good"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "excellent product of very good quality, highly recommend"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Im satisfied so far with this tablet."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Nice"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "excelente"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I really love this tablet.  It's small and lightweight, but it does the job and works beautifully."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "BROKEN"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "It is a great tablet for children of ages 4-and up. I bought this for 5 year old my daughter and it is amazing she love it and love it too"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Bought as gift.  Works adequately for what it is.  Camera is marginal, takes viewable pictures but not good quality.  Charger plug is loose, otherwise it seems to work well."}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "I was really excited to get this, but slightly disappointed when I first turned it on. The picture was bad, the touch screen was wonky and the battery life was very short. Then like a few months later it just stopped working altogether with no explanation. Of course, it didn't cost much so I guess I got what I payed for."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Can not find a better price for a practical tablet. Working good. Fast shipping."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Tablet came before date expected, excellent tablet I use it all the timd"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "good"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "I purchased this tablet for my 12 years old in December. As of June 2016 the tablet no longer works. Sadly, the company has no warranty agreement to replace it!!!"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Very nice."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "This tablet was an excellent value for for a solid piece of equipment. There are many noteworthy features that you normally would not find on a less expensive device. I've owned both high end and low end devices and this one preforms well and is a solid build.\nPros:\nExpandable with up to a 32gb sd card\nCharging micro USB plug\nCharging wall plug\nAll the necessary pre-installed apps are added to the tablet.\nBeautiful Screen and resolution\nSound is clear without echo\nSreams flawlessly\nAll Pre-installed UI components work well ie: keyboard, camara.\nThis tablet works with most available apps and\nconnects with wifi with no problems in seconds.\nCons:\nWhile the camara work well without glitches The front and rear facing camaras do have low resolution photos. I do not use this tablet for pictures so it's not a problem for me.\nI recently bought another brand of low end tablet. I expected for the price I would likley get the same sorta laggy, glitchy tablet.  The price was right I decided to give it a try.\nThis tablet has impressed me on so many levels! From its solid heavy weight to its real glass screen it's odvious that this device is not your typical \"cheap\" tablet. It works equally as well as my Samsung (except for the picture quality).\nNot only would I recommend this device I plan to buy a couple more for my kids.\nIf your looking for responsive, fast, non lagging and solid built device for an excellent price I would highly recommend this one.\n**I was not paid or compensated for this review in any way. I bought this tablet for its listed price and recieved no incentive discounts for reviewing. My opinions are solely based on my use and testing of this device and are completely honest and unbiased."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Crashed within 2 months of purchase. Kids didn't even get time to enjoy it :("}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Good tablet for the price. I initially had an issue with it no longer charging but I reached out to Neutab and it was within warranty so they replaced at no charge."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Nice little tablet, works well, fast. Great value."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "This tablet lighting is poor and breaks easily"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Screen was received cracked and the tablet never worked."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "VERY GOOD TABLET SOLID CONSTRUCTION GREAT VIDEO EXCELLENT SERVICE"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Bought it as a gift - the recipient is very pleased with it."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Really liking this tablet. Its easy to access and convenient for college use. Thanks!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I purchased this tablet for my 8yr old autistic son. After I rooted the tablet, removed unnecessary programs, this tablet exceeded my expectations. Not bad for the price, you get what you pay for. Don't expect Samsung Galaxy quality, or you will be disappointed.\n\nThis tablet is far better than most $50 tablets and includes blue tooth. The only con that I was able to find (even for a budget tablet) is that it will randomly reboot under heavy load. Not really enough to knock a star off because my kid doesn't seem to mind."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great device for my 8 year old son. Good quality, nice size and weight.  No complaints. He better like it other wise we are getting rid of him"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Very nice operation"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Hoping it lives up to its reviews. It is a Christmas present. But I was excited it came in faster than expected."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Who the hell has been giving this thing positive reviews? All the reviews and questions are about this thing not working after a few months. Mine stopped working after a week. DO NOT BUY THIS \"TABLET\"! I purchased mine on amazon.ca so that's why it won't appear as verified."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great gift for my mother she loves it."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I am very pleased with my tablet and the way it was shipped.  It works perfectly, thank you very much. And tnk u for the scren protector."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Much easier to set up then previous brand I have the price is great"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "i really like this works as expected. Thnks"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "best tablet ive ever used"}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "I decide to buy this tab based on all the positive feedback return here for this Tab. However am largely disappointed with my decision to go for it for reasons mainly - its slow , i repeat its really really slow in performance, slow in charging up, screen gets freezed in the middle of performing tasks, running of Youtube videos hangs the whole Tab. Camera quality is also not that great as well. Overall i would say am not quite happy with this product. For new buyers please think & decide."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Works okay. Needs a reset now and again because things just foreclose. But you get what you pay for. Mostly used for Netflix. And does the job."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "It did not work well. Very slow, and after 6 months, when I was no longer able to return or exchange it, the screen just went completely black and no longer works.  This was a birthday gift that I purchased for my nephew. He was very disappointed."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Love the new tablet."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "This is a great value for my child. Glad to find a Turpro silicone case for it too!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "this product performs better then expected. I'm very happy!!!  I highly recommend anyone who is looking for a lower priced tablet to check it out, you will be amazed!!!!"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Very happy with this product!!  Purchased 2 !!"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Bought this tablet for my son on his birthday and it's a good tablet for the price. He enjoys playing games on it."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Exactly as advertised.  Mainly used to play music apps and do quick internet searches.  No issues."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Really enjoy this tablet great for everyday use anywhere I go"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Great product and satisfactory shipping. Reached on time. The NeuTab is surprisingly good for a below $50 tab."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great product for price.  Arrived on time. I had a special application for this pad and it worked perfectly. Would buy again."}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "Hi glare, you barely can see the screen, also the touch is not soft..."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "it's made in China  the graphic aren't that great,you get what you pay for.\nI'm still Checking It Out I Will Update This Review later"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Haven't had a chance to use it just yet, but the look and feel is going to work well for my company's warehouse personnel."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "I like the product because it is so similar to what my kids first had.  They should be able to jump right in and enjoy."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Bought as a cheap replacement tablet for son to use in school (high school).  First unit I received, I charged per instructions did updates and it died within an hour or two of intermittent use. Attempted to recharge it however screen would not display anything (backlight didn't even come on).  Returned it for an exchange with no hassle, replacement was even shipped priority, excellent customer service. HOWEVER second unit worked for month or two until the LCD shattered under touch screen rendering it useless. I know for a fact it was not damaged by improper use. My son tapped with the tip of his finger the spot on the screen where the Android Home icon is and LCD broke.  Very poorly made device, not even worth the offered low price."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Ordered one for my grandson and one for my son.  My grandson loves his and my son will love his,also."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I purchased this for my grandson to use.  It is easy to use and has everything he needs.  Really like it."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Great tablet for the money."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Really good, works fine and for an awesome price!"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Battery charger broke just after the 30 day return or replacement window! It's now only 3 months old and the Neu tab freezes up and touch screen does NOT respond after wake up alarm goes off. Buyer beware of the cheaper price offered by Amazon on this one! I would NOT recommend this one! And I am a frequent shopper of Amazon verses Walmart for sure!!"}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "Just got it so I can't provide a real accurate review."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Nice but delicate for kids, teenages  ok"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "After many hours of checking on Amazon and looking for a tablet with Android capability's I found exactly what I needed in order to download Android applications.  I did look at other tablets but they were not meeting my needs."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "It's all that you can ask in a $50 tablet, straightforward in operation and use and reasonably rugged in construction."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "The operating systems runs a bit slow, but it gets the job done. Great for casting movies to our google chrome."}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "Ok, you can't expect much st this price point... But the one thing I did expect was a screen that is at least somewhat usable.  I have a 7\" Android radio in my car, was basically expecting an identical 1024x600 LCD.\n\nNope... The LCD on these things is terrible.  The viewing angle is about 15 degrees (and don't even try to use it vertically, you'll swear your eyes are going bad on you.\n\nFor me, I mainly wanted a portable display for some home automation prototyping stuff I'm working on, and this tablet is only good if it's viewing angle doesn't change.\n\nIt's not half bad for the price otherwise... It's no Samsung or Apple, but it does have the ability to run every app I threw at it, until I went cross eyed from the pixels.\n\nI mess with electronics all the time... So I guessed maybe the diffuser inside was backwards... Nope, the LCD coating itself is the problem, and it looks like it was applied by a 2nd grader.\n\nDon't believe those first few rave reviews... Scroll to the end, you'll see they were given a free device and paid for the review\n\nHere's a video trying to show the poor viewing angle the best I could https://youtu.be/-kAB3C09Qs4"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "For $50, you can't beat it. You are also able to root the device but don't expect any custom roms for it, I've yet to find any. It even includes a screen protector in the box which was nice. Another thing to keep in mind is it has terrible viewing angles, I believe it is because it is running a TN panel LCD screen. I could be wrong but that's what it feels like. Beyond that, it has worked out great for the price."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "The tablet came earlier than expected and seems like the perfect product for my needs! Very easy to navigate."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "This is our second one in 2 months. They only last about a month...total waist of money spend more to get something better. Worst tablet we have ever owned."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Just order mind today coming in on 31 Decemember or the 19 of January"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I have enjoyed it because it fixed just right in my purse when I go somewhere."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "ok"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Easy to use. Plenty of memory plus the SD card is more storage space than I will ever use. Great screen graphics ability. The camera is its only weakness. Picture quality is not great."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Very poor quality!!!!!! Don't waist you time and money, amazon is great on return, praise the God."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "This tablet is extremely small...not a 7\" screen...The screen is very dim and the battery life is really short."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Love the tablet. I got it for a 7 yr old girl and she won't put it down! Very simple to set up and use."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great tablet! My 2 year old can run it himself!"}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "Got this for my grandmother mainly so she could video chat her family in the West Indies. This camera is doo-doo. Just plain awful, man."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "garbage"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "These tablets are great for kids because they can do most of the basic things that every tablet should do. As a teacher, I like the fact that the version of Android (KitKat 4.4) allows me to create a teacher account and a student account which locks some of the functions and apps and let's me have control over them in my classroom."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "Good tablet. The only concern I have is my son has only had it for about a week and sometimes it kicks him off what he is doing and he has to turn the tablet all the way off and back on to get it to keep him in what he is trying to do."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Ty love it"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Love it .just the right size.for reading books not to heavy light weight ."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "OK, so first things first:\n\nThis is an inexpensive tablet.  It's not going to be a workhorse, and you should know this already.\n\nHaving said that, we bought this because we wanted a streaming device to replace our AM/FM kitchen radio.  This does the job PERFECTLY.  It lags a little after button-presses sometimes, but again we expected that for the price point.\n\nThe only complaint I have with the tablet is that it won't let me select my own time zone.  It INSISTS that I am in the Central time zone, even though I repeatedly selected Eastern.  I tried turning off all of the automatic settings, and it still did it.  Oh well.  It's minor and inconsequential.\n\nBottom line:  If you need a tablet to do light work and don't want to spend much, this is the one!"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Don't waste your time or $. Worst product ever and doesn't even work. It's going back tomorrow"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Was already falling apart. Can't watch movies I even downloaded to it. Can't update the software so not much space. Touch screen is slow to respond. Feels like it's going to break in my hands"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Pretty decent tablet for a great price! Dont really have any complaints at the moment.  Nice display and decently fast for playing games."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I really like this Neu Tablet, It does what I want it to do, games reading music, you name it and under $50.00 great deal.\nYou also get a free screen protector with the tablet."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Given as a present to my mom for her school\ndownloads.she is very pleased with its simplicity.order#109-586347-6495443"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great batt. life. Comes with separate protective film. It does everything my Archos 70 does plus and $150 cheaper."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I love this product. It does pretty much everything I need to do. We read pdf, kindle, etc., include watch Netflix. Great performance for a small price. Thanks NeuTab!"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Wish it had a cover.... other than that, great tablet and great gift!"}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "I returned this item because the graphics quality wasn't what I wanted.  It would be a great tablet for a child as a first tablet but not for an adult who uses a tablet constantly."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "My kids love it"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "it stopped working after two weeks"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Excellent!! Thank you!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Exactly what I needed."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "My dad sent me this tablet so I could do my comment coursework on it but that didn't work out so well. For starters the screen is a very ugly tint. I tried messing around with the brightness to get it so I could view it comfortably, no such luck. I tried to use Pandora on it as well but it would always force close on me. It is very slow and seemingly unresponsive. Might as well buy the amazon fire for the same price."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Came with two scratches on the front. Hope it's just my own experience. Otherwise it works perfectly."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Very easy to work 7in is the right size. Very nice unit"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "TIPS HARD TO HIT THE LITTLE X MARKS THE SPOT WITH OUT HITTING TWO.WORKS BETTER WITH OUT THE SCREEN COVER FOR ME....REALLY A LOT BETTER.I AM GOING WITH OUT SCREEN COVER AND GOING TO GET ME ONE OF THOSE STYLIST .THIS MAY SOLVE THE PROBLEI THOUGHT FOR 50 HOW GOOD COULD IT BE.THIS LITTLE POWER HOUSE WORKS VERY NICELY FOR ME.I HAVE FAT ROUND FINGERM.YES! I WOULD BUY ANOTHER.AFTER SET UP WIFI INTERNET WORKS GREAT..."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "This product is no good. It shuts off in a middle of a game or other things. It has not given me any satisfaction sense I have had it. This is a recall, a demo, no good a waste of my money."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "This tablet is really nice functions well and is simple to use used other more expensive tablets and don't really see a difference between them and this one"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Do not buy this tablet. I know your probably thinking to yourself right now. \"I won't use my tablet that much so a $49 will make do\". Yeah that's what I thought too. I had it for a month and one day I went to use it and it wasn't turning on. So assuming it was dead. I plugged it in and walked away. Came back about 45 or so minutes  and it still wasn't turning on. I tried using other chargers I had laying around, just in case the cord was maybe the reason for it not working but it didn't change anything. Unfortunately it stoped working about 3 days after the manufacturer warenty was up. So topical right? Anyway I ended spending another 150 bucks on a samsung galaxy tab pro 4 and it's been great. I definitely recommend you spend a little more money and get a name brand tablet. Well we all know that very common saying. \"You get what you pay for\""}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Buena"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "It works well with little stuff it needs more ram"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "So far so good accept that tablet print font is way too small!"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "A decently good, solid tablet, just right for the price."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Awesome. Great inexpensive tablet for our 6 year old!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Sleek and beautiful design and faster tablet."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Its a great tablet hasn't frozen at all have no complaints at all. Its way better then I expected at a great price."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "This product is good for the two 5 years olds and the 9 year old it got it for, but does not seem to have speakers unless plugged into Headphones."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "This tablet is great best first tablet I bought"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I love it"}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "just got the item hope it ls as good as people says it is."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Decent tablet for pricing. Design is pleasing and small size makes it easy to carry around. Feels durable and light enough. Intuitive interface. My only issues are minor ones in regards to the battery life and performance, but considering the price, I'm not surprised. I bought the tablet for my child and I believe the tablet will be put to good use."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "beautifull"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Awesome tablet for my son"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "I was very excited to get it for my son. Never no that this tablet was so awesome but my son was more excited than I. love the resolution and speed for such a reasonable price. My son tells me every day that I love it daddy. Jus hope that you can make it with more memory"}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "Not bad for a small tablet. I have s few other tablets and this is what I was expecting. Pretty easy to use and I like the compact design. As a matter of fact I'm writing this review on it. I would recommend and would buy again"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "First off, how many of these positive reviews are from people who haven't spent more than 1 hour with the tablet?  The first thing you see when you open up the box is a note detailing the seller's  bribe of a free tablet case in exchange for your positive review. I tossed it aside, I'm not a shill.\n\nNow onto this abysmal combination of recycled pcb from Rosie Odonnel's shake weight and junkyard components that make up this tablet.  I wasn't expecting much maybe 50 hours of use but 30 minutes in and the damn thing boot looped me into a state of pissed off I hadn't felt in years. I should add that his occurred after trying to encrypt the device from factory settings.\n\nSo I finally troubleshoot the device into a normal boot, have just enough time to fiddle around with basic operations (adjusting brightness which doesn't do much besides make the dull screen more nauseating) before it blacks out for good. I started to do a return but by this point had pu it in a drawer and walked away. That was 6 months ago. A friend of mine who is an expert with electronics just finished taking a look at the inside of the tablet and pointed out 2 components that had fried themselves up real nice like.\n\nI know you get what you paid for. Well I paid $50 for $14 worth of busted parts and a headache. I didn't even get to using the bloatware which was firmly garrisoned into the system data.  My advice: stay away."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "Not very happy with the battery, I have to keep it charging all the time"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Easy to navigate by a 9 year old and an 8 year old. Size is good. Quality is perfect for price. :)"}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "Good for browsing the internet or reading books. Less than desirable performance playing games that are graphically demanding."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Beautiful design, quality is high and arrived on time"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Purchased a second one! This is perfect for an entry tablet. Easy to use and great price."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Not a good deal have used better tablets for around the same cost."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Right when I powered it on it was almost 1080 resolution and responded so good the screen was smooth love it perfect gift for the holidays"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Excellent"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Just bought this for my 10 year old daughter for her birthday. She LOVES it. The interface is familiar, she had no problem navigating the device. She set up her own email, downloaded apps and set the time and date with ease. For the price, this tablet is PERFECT for a young child."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "This only lasted 4 months, my son was listening to pandora when it completely stopped working, never turned on again or was charging. I was very disappointed and so was my son!"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "This stopped working and my end date for returns was Oct 25...this sucks"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "This tablet wouldn't even power up when I received it! They are supposedly sending a replacement, so I will update rating when/if I get one that will actually turn on!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "order #107-9434132-5712224\nGreat tablet ,perfect go anywhere size with lots of app's.price was right for my first tablet. LOVE IT!!!\nTell all your friends."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "The NeuTab N7 Pro is a great product. It has great features and is very easy to use for a beginner. The shipping was fast. Great seller, I will definitely buy from this seller again."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "For my first tablet it is great.  I want to use it for contacts, calendar notes, fun games, etc.  I wanted a bigger than cellphone, but smaller than laptop to carry around and this fits the bill. Also the price is right."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Enjoying this Tab. Very nice and packed well. Shipped fast. This is my first tab and I'm still learning but to me it is well worth the price."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Don't buy it, slow and ridiculous, I can't even update the Android. Don't waste your money"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "It's a decent tablet for what you are paying.\n\nFast\nDecent resolution\nInexpensive\nAndroid OS\nAll the latest features (BT/WIFI)\nRelliable\n\nHappy with the purchase so far!"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "If your'e buying for a a kid, sure. Anything else, just don't."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great tablet."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "SO pleased with this tablet! The battery life is perfect (+ it charges quickly) and my 3 year old son can use it without problem. I set up a user account for him so I can control which settings he has access to. There are lots of educational apps and games to DL from the Google Play store. I am definitely buying another one for my 5 year old for Christmas. :)"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Very good"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great first time tablet for my son"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "For the money this fits my needs. Surf, shop, Facebook and Netflix. Love the size.  The tablet fits in my purse to take with me."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Tablet would glitch whenever I'd try to load pictures on Google image. Also tablet would freeze too much"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Worked well for 3 weeks then just stopped working!!! Do not buy."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Love the product"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "this an awesome tablet. what is even better is Amazon made it so easy to order and ship items. great job Amazon. very pleased on entire process"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "This is a great tablet.  Very easy to use.  I love it!"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Bought this for my nine year old and she absolutely loves it. It runs a little slow but for theoney we spent we couldn't beat iy"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Slow cheap tablet rerurned right away. One didn't even power on and the other u had to look dead on at the screen tilt even a little couldn't hardly recognize what was on the screen. Buyer beware"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "This item is a joke"}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "Not happy with this tablet. Battery life is very quick to drain, slow to load pages and have had trouble trying to load apps. Paid $50, which may explain why it's not very powerful or fast."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Very easy to use ! Great $$, I am no techie and I was able to use this tablet with ease ! Would recommend this to everyone, no need to spend hundreds on a ipad or samsung gallaxy ."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "This is my first tablet and I find it easy to use, and not too large or too small."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great Tablet"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Excellent seller, product as described, highly recommended!!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great product for the price"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Nicer than my Samsung Tab3"}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "<a data-hook=\"product-link-linked\" class=\"a-link-normal\" href=\"/NeuTab-174-N7-Pro-7-Quad-Core-Google-Android-4-4-KitKat-Tablet-PC-HD-1024X600-Display-Bluetooth-Dual-Camera-Google-Play-Pre-loaded-3D-Game-Supported-Black/dp/B00THEMRX8/ref=cm_cr_arp_d_rvw_txt?ie=UTF8\">NeuTab&#174; N7 Pro 7'' Quad Core Google Android 4.4 KitKat Tablet PC, HD 1024X600 Display, Bluetooth, Dual Camera, Google Play Pre-loaded, 3D-Game Supported (Black)</a>\nWas very happy when this tablet first arrived.  Purchased for my son to use with a planner app to keep track of his homework at school.  Less than 2 months of use and it stopped charging.  Contacted customer service at the email address listed for NeuTab and waited 2 business days for a response.  Responded to the reply within minutes of receiving the message but had to wait another 2 business days for another reply.  Had to pay to ship the defective unit back to them and wait for a replacement.  Shipping is slow and found out that instead of getting a new tablet it will be a refurbished one.  Not happy with that as the tablet that we purchased was less than 2 months old with a 1 year warranty would have expected the unit to work longer than 6 weeks."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Tab is very slow and it is getting struck even for smaller games. Battery performance worst. Not even getting couple of hours.\nNot recommended."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I bought some of these for my class to write and test mobile apps as well as take video and pictures for websites. They are working great!  Easy to use and includes both power cord and usb with power attachment so you have multiple ways to charge and use!"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Good tablet, my 12 yr old son loves it, he picked it out and purchased it with his bday money. Stylus works on these tablets, I recommend getting a case, it just gives the tablet a little extra protection.  Its been dropped a couple of times and has held up, no broken screens, so in my opionion worth the $50.  Works with google play so that was a bonus, he wanted it so he could play clash of clans."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "impressive! fast shipping, superior packaging, overall its a steal! plus this item came with a screen protector. i didn't expect to receive one! thank you"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Does Not Work Have Tried Everything and it doesn't work A waist of money smh it was someone's Christmas gift"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Tablet works well except a port for a sim card should be installed to facilitate Watsapp."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "This tablet is very nice and very comfortable. I convinced to buy it for all applications. The easy that I could install my Emails and everything you need to get. It is very complete for my use medical journal in the reminder of appointments and my games. It is also a very durable Tablet since it offers one year warranty that not all tablets offer, that more I convinced because I am a senior and is I going to last a long time."}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "Most notable flaw is the horrible screen viewing angle.  Looking at it from any angle besides dead on causes the colors to shift or get washed out.  Also, 512MB memory is a small amount.  It looks like they have a newer model (N7S Pro) with an IPS screen and 1GB of memory that would be a much better buy at only $5 more."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I love my tablet.  I am amazed at how fast it is.  For the price I am well pleased"}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "Pretty low quality screen. Its alright though considering the price"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Overall I liked this product. It is well  built and has enough power to play games, surf the internet, and play videos. The only problem I have had with it is the battery. It seems to me that it drains too quickly. If they were to fix this problem I am sure there would be no reason to give it 5 stars."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Good item. Very useful"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "The perfect little starter tablet for our grandson. Plenty of power and function to start him off right on the road of personal digital products. Very good price point making it accessible to most families."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great product!!"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Nice unit,battery doesn't last all that long"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great camera qualities and display screen, very fast too. Loving them!!!!!!!!!!"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Battery life was awful and had all sorts of compatibility issues with apps. Returned."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I really enjoy my tablet, I love it so much ,I help my co-workers to order order thhem one as well. I received it on time with no promblem. Amazon is the GREATEST!!!!!!!!!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Perfect size, and very clear screen! I love it!"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Nice easy to use tablet.  Very good battery life."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "At the moment, I love it!\n\nIt's black, the color I ordered. It was partially charged so I could play with it right off.\n\nMy Kindle Fire HD that I bought January 20, 2014 won't charge even when plugged in. At least 1 reviewer had this problem with this product. I'll post an updated reviews.\n\nI've downloaded some apps, including Kindle.\n\nPlus I get a free protective case for writing. Though I might get something else."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "This is definitely a great buy!!!  It was purchased as a gift for my son's birthday, he is 12 so it has been getting a decent workout. It hasn't given him any problems. My son votes five stars, but I am going to give it four-star rating because the camera takes a cloudy pic ever since we got it.  It would appear that there is something wrong with the lens,(which is not dirty, I checked,) so instant photos are not fun.\n\n It does stream in HDmovies, videos, and youtube all come in clear as can be.  Great product, worth the investment.\n\n  ,<a data-hook=\"product-link-linked\" class=\"a-link-normal\" href=\"/NeuTab-174-N7-Pro-7-Quad-Core-Google-Android-4-4-KitKat-Tablet-PC-HD-1024X600-Display-Bluetooth-Dual-Camera-Google-Play-Pre-loaded-3D-Game-Supported-Black/dp/B00THEMRX8/ref=cm_cr_arp_d_rvw_txt?ie=UTF8\">NeuTab&#174; N7 Pro 7'' Quad Core Google Android 4.4 KitKat Tablet PC, HD 1024X600 Display, Bluetooth, Dual Camera, Google Play Pre-loaded, 3D-Game Supported (Black)</a>"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "For the price you can't go wrong. Great tablet"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Very good product for the price my little. Girl love it"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Surprisingly satisfying! Everything in a small package. Perfect for what I was looking to use it for."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Terrible just terrible"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Excellent"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Just the perfect little tablet for on the go."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "seller gave great description no let downs. got it for my wife and we play fight to use it lol. I'm gonna have to buy another. Ty for speedy shipping I didn't have to pay for!!! it got Here quick!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great tablet for the money, i got it for my 7 year old daughter. Great buy .."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Nice tablet for the money. Works as well as higher priced tablets."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Really nice little tablet the screen protector was a bit difficult to put on but other then that a great device and plays games etc really nice"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "works good, directions need improvement"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "GOOD VALUE"}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "After months of research, we opted for this tablet for our tween daughter. Out of the box, it looked good. The screen is really strange. My daughter thinks it's a cool 3D effect, I think it's absolutely miserable. She was given the device the last week of September and now, the first week of November, the device continually quits during games... Continually. I finally contacted amazon regarding this issue to see about trading, and due to the sellers policy, I'm out of luck. I'm super sad, too, my daughter just asked for a new tablet for Christmas. Please make this right. And I would definitely not recommend this tablet- especially over the now $50 Kindle."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Nice little tablet.  Has good display.  Very responsive.  Excellent value for the money."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "Slow and poor display. I guess I was expecting a bit too much for $50!"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "I really like this tablet! It does everything I need it to do; but it is a little awkward on facebook. The speed is good considering the price. I would definitely recommend this product."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I loved it, it set my expectations, it's light, fast, i love it."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Has bluetooth"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "it is good for the price you get what you pay for I really like this is a nice tablet  you can play video and looks really good I did not no it wound look so nice the only thing I don't like is when it gets 2 hot but I really don't mind  it I wish the batty will  full up more faster when plug in over all this is a good deal  I really enjoy use it ever day"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "my son say good."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I love! Excellent neutab tablet . I bought one of the Christmas presents for my 7 years. The truth is the perfect gift! thin and very easy to use and has everything you need in one tablet. Very good image and storage capacity and speed of connection and navigation. I made a very good buy. The highly recommend !"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "was not turning on. returned it,."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I love it. It running a little a slow. But it ok"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Bought one for my granddaughter recently and she loves it.  For $50, you can't beat it.  It  has a year's warranty on it too."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "This is very light and functions very well for what I need. Love the item very clear and gets me to where I want to go and quickly. Would recommend to anyone who is looking for a inexpensive tablet and convenience."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Awesome tablet. Thanks my son is happy :)"}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "It was a pretty good tablet for the price. I've had it for a month now though, and now its just not turning on. I don't know why. I've tried just about everything, but it still won't work. I will edit this review if I figure out how to get it working again."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "This is actually my second time ordering a NeuTab. Both times I have been very satisfied with the value I got for the price. I had originally ordered the new Amazon Fire but I returned it almost immediately because I hadn't realized I was signing up for an exclusive Amazon shopping device. I needed a straight forward tablet to store all of my own, variously acquired collections of media content (read: media content not exclusively bought from Amazon), and this tablet does the job well. Having compared, however, the actual quality of the device itself, it is true that other tablets will be a bit sturdier and run faster. But for a straight forward, user friendly tablet, this device is just right, and it was worth buying a second time."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "broke quickly when used by a 10 y/o"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "This is very light and functions very well for what I need. I do however have to invest in a sd card to save on memory."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I bought this Neu Tab N7 for my older son and I just finished setting it up for him. It's not all that for someone who's an advanced user or picky but, I think it's more than good enough for kids. The front and rear facing cameras aren't aren't as sharp so far from what I saw but, i'm guessing that maybe outside with the sunlight it'll have a sharper image. So far, I personally like it myself overall for now, LoL... :-)"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Perfect for Toddlers!\nAt first I thought it was a little small, but then I saw how easy it was for my son to manipulate it in his hands.\nHe could hold it in both hands and touch the screen with his little thumbs.\nI loaded it up with learning apps and we do them together.\nThis was a big improvement from him constantly poking my laptop screen."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "I got it on time to start school but it will not work at all"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "This is our first tablet so keep that in mind. Came with everything we needed to use this device. I think for the price we get a lot and we are happy with the purchase. It's been easy to use for two people that are new to this kind of stuff."}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "I expected more operational info to be included.  This item might be self-explanatory to a techie, but I'm not.  So far I am using the \"Columbus Method\"..discovery.  Needless to say I would not purchase one again.  Pretty disappointed."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "The battery life leaves much to be desired.  I only use the device as an e-reader.  After reading for 20 minutes, my battery life is at 85%.  I would understand if I was running game apps that suck the life out of device batteries, but I am just reading with the brightness turned all the way down and using the \"black\" lighting option.\nI do love how responsive the device is and the headphone jack option/wall charger is divine.  I have destroyed numerous devices damaging those regular USB connection cable inserts."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Love the item very clear and gets me to where I want to go and quickly.  Would recommend to anyone who is looking for a inexpensive tablet and convenience."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Nice tablet!!!"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "awesome tablet"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great tablet for the price."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "For the price it is a great value, so far user friendly. I would definitely purchase this item again."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I bought 2 of these tablets for my kids they work great  thanks  guys"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Love my new tablet its the pefect size."}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "email me at ceycondrayia1@yahoo.com thank you"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "The size is perfect. It has everything you need, plus the android system is awesome. The tablet was fully charged when I got it so I could start using it instantly. I like it!!"}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "Had to return to get set back to factory default ..waiting 4 it to come back"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "The NeuTab N7 Pro 7'' Quad Core Google Android is great. I gave it to my wife as a Birthday gift and she loves it!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Very nice excellent tablet, but power buttom is very closest to charger"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great, fast tablet.  Great price!  Highly recommended!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "nice tablet. nice price. does what i need. more pre-loaded apps"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "needs a better camera"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "got this for my 9 year old son for gameing and videos. works great wish it was a little larger screen but this is a test run first tablet"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "As for its price, It is just OK!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I really like how quick the response is for this tablet. The web browsing works great on this tablet and seems to great for app games.  The only thing is don't like is the glare, so you will definitely need to get an anti-glare protector.  It would be nice if the company included that instead of the protector screen in the box. Maybe even more pre-loaded apps like Facebook, Amazon, etc. It works great with my bluetooth keyboard/mouse, no problems connecting.  I would recommend this tablet to everyone is who looking for good price and product!!!"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "It is what it is a 50 buck cheapy tablet, it broke in less than a month. Don't waste your money on this."}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "Screen freezes,and becomes un-responsive, WiFi doesn't stay connected have to reboot device multiple times.would really like to just return device and get refund.camera is horrible."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Purchased for my granddaughter.  Perfect."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Bought 2 one for me, the other as a a gift. So far we both love them!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great price and great tablet. Far exceeded my expectations"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "easy to use easy to see and the price was great"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "it is just what i was looking for."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "excellent product easy to use, it's also easy to use and good condition"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Plastic screen scratched so bad it was ridiculous"}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "As one who is not up to speed with the geeks, this at first was really difficult.  But as I go on and spend time (thank god the flight from dia to tel aviv was long) it is getting easier.  Size is handy, easy to get through tsa.  But I don't know all that it is capable of."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Working Good"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "I dropped the tablet once!!!!! And It broke!! Very angry. I understand its 50$ but it shouldn't be so poorly made"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I was not able to remove all the bubbles with I applied the screen protectors to my tablets (2 of them). These are great tablets for my 2 grandsons (ages 10 & 7)"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "For a 50 dollar tablet you really can't go wrong. It's not particularly zippy but can do most simple things like running apps and using the Internet. I bought it to mount in my car and use an an OBDII interface however I could not find a proper spot to mount it so I returned it as I had no use for it. All around its good for the basic stuff but not performant enough for me."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": ",it seems to work fine so f,ar .A little time will tell  needs alot more pre-loaded apps and needs to be a more \"handleable\" size in otherwords theres too much extra space ,too big, all you need is the 7inch touchscreen not the extra plasticThank You, Cris"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Early days yet but so far so good. Astonishingly simple setup. Intuitive display and navigation. Audio quality seems good and display fairly good. My only slight gripe with the tablet is that the screen brightness could be better. I like my devices to be super-bright and this one's just a little dim for my liking. That aside, this is a terrific little tablet for browsing, emails, apps and at 50 bucks (including Amazon's same day delivery in NYC) this is really hard to beat."}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "Sooooooooooooooooooo very disappointed in this tablet.  Thought I would save a few bucks and get a cheaper tablet when my old one died.  It's from Google, what did I have to loose, right?\nI gave it some time, but just now ordered a duplicate of my dead tablet.  This tablet is very cheap.  Lessons learned = you get what you pay for.  The feel is cheap, I could work with that, but the battery is awful.  I don't use it every day, and when I wanted too = the battery was dead...EVERY TIME.  The operating wasn't for me, maybe because I'm getting old, but waiting for it to start (after charging it before every use), and then starting in the browser every time just isn't for me.  The graphics were cheap, I could deal with that also...the commands were very slow...I'm aging just waiting on it to respond.\n\nThe makers ask for a good review, and say if you e-mail your post to them you can get a free cover.  Well, that's probably the only way they get good reviews!\nPerhaps if I never had a GOOD tablet this would have been something...but just be warned...read ALL reviews.\nPay a bit more and move on with your life!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "love it easy to use"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Love the neutab n7 pro.  Beat birthday gift I've ever got!  Very fast tablet."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Excellent product."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "I had some trouble setting it up, however I am new to the tablet era. Once it was up and running I have a great time. I only wish the instructions were more detailed om adding/deleting, using the camera."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "Great tablet for very young people or art needs like a picture display or use as a clock , or something simple, if u want smooth browsing and video i would spend 50 dollar more and get a used nexus or new name brand tablet , its pretty slow and display is like a 25 dollar screen so think about that when buying for something else like movies or gaming\nbut i put it 3 stars because for 50 bux it gets it done"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "It is everything I needed. Works well for me."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "I thought that the Neutab tablet had a HDMI port but it didn't \"bummer\" the speaker/camera is crap but for the price.. it OK"}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "This tablet is about what you would expect from such a low price. The screen size is great but the LCD viewing angle is so narrow that even the different perspective from each creates differences in screen color, which certainly takes some getting used to for reading- the reason I bought this tablet.\nIs it great? No. It's cheap and that's the point."}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "Battery dies after 2 hours of use."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "This item doesn't stay charge,it has poor reception and you can't play anything too long on it, I do not like it at all."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "My son and i love it.."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Tablet is great and I am happy that I purchased this. I will purchase another one for me"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Zero stars. Tablet can not even load a web page without taking ever fifteen seconds! Do not recommend at all. There is no plus or up side to this tablet"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great tablet. Perfect for a 2yr old"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "SO far I'm happy with the Pro7 tablet...It's taking me a while to set it up, but that's only because I'm old school. I don't know that much about electronics so I'll probably have my savior neighbor help me with getting it all set.....The only thing I have a problem with is that the instructions weren't very clear on the protective screen and I had two pieces I needed to take off and by that time had ruined the protective screen I was supposed to on........Charging right now even though it said it had a full charge, the charge went down very fast...."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "great product !"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Bought for our 11 yr old son.  Seems like it will work good. Disappointed that the 5V charging cord does not work, but hey, the USB cord does."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Exelent seller... all ok :)"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Nice product for nice price very happy with mi 2 neutabs."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Not a ipod mini but its doing a great job m kids are having a great time."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "I'm completely disappointed of this tablet, I thought that being more expensive would be better, but not, I feel completely cheated, because it is a Chinese Tablet equals many generic brands and is promoted as if it had better quality, the Tablet is slow, the screen freezes constantly, wifi is poor, screen resolution is very low how  the front camera of only 0.3 megapixels, not even bring headphones or headset. I am completely disappointed, the worse purchase I made at amazon."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Overall this is a great little tablet for the price.  It does not compare to a more expensive tablet like a Galaxy or an iPad.  If you are used to a $200+ tablet and are expecting that kind of performance you will be disappointed.  With that said, I own an iPad Mini 1 which is running iOS 9.  That older hardware runs at a very similar speed (if not a little slower) than the NeuTab.\n\nI purchased this for my son to use at school.  We do not allow him to use the internet or YouTube on his phone; however, there are several classes which require him to use his device, which put us in a bind.  Our solution was to purchase a $50 tablet for him to use at school.  A bonus of the price is that if he trashes it we are not out a lot of money.  I found a $10 7\" case on Amazon with the elastic corners and it fits fine.  I think anything you find on Amazon to fit a 7\" tablet will work fine.  There is an offer in the box for a free case but I have not received it yet so I can't speak to what it is.\n\nI originally purchased the new Amazon Fire but then returned it and bought this one instead.  Since I purchased and used both in a short period of time, I will compare the two tablets.\n\nScreen:\nThis is the biggest hit on this tablet.  The screen is washed out if you look at it at any kind of angle.  The Amazon Fire screen is much better.\n\nBattery life:\nUnknown so far.  It shipped with a 90% charge and drained to 70% within about an hour of heavy use (initial downloads and install).\n\nPackaging:\nThe tablet comes in a plain brown box but is very securely packaged.  It comes with a micro-USB cord, a proprietary power cord, and a standard USB power supply.  It comes with a screen protector which is custom cut to this tablet.  It also has an offer for a free case.  Amazon Fire packaging is very nice and includes everything but a screen protector and a free case.\n\nStartup:\nThe Amazon Fire took about 30 minutes to download and update everything.  It shipped already linked to my Amazon account which was convenient.  The NeuTab started right up but was very slow at first.  I realize now that it was also downloading updates to several apps (Hangouts, Google Play, and Chrome).  Once those downloads were complete (about 10 minutes) the performance picked back up.  The registration was a little more clunky than the Fire.  Standard Android stuff.\n\nButtons/Ports:\nThe Fire has a power button, volume button, and micro-USB port.  The NeuTab has the same plus a small (2mm) power spot.  I don't know why they included the proprietary cable and put the charging port in.  It charges fine through the standard micro-USB port.  I will probably throw away the extra power cord once I'm sure that everything is working OK.\n\nWarranty:\nThe NeuTab has a 1 year warranty.  Fire also has a 1 year warranty.\n\nSpeed:\nThe NeuTab is about what you would expect for a $50 tab.  Fire is a little snappier but nothing to write home about.\n\nParental Control:\nI installed a free app called Kids Place that allows you to fence off the tablet and only allow access to certain apps.  There is a timer plugin to this app which only allows access during certain times of the day, or you can set a daily timer.  This works better for me than the Fire FreeTime feature since FreeTime does not allow access to the browser.  My son also requires an app called SeeSaw which was not available in the Amazon app store.  If you are wanting to get a tablet and install any apps on it, the Fire is probably not for you.  If you are mainly wanting to watch videos, you probably want to go with the Fire since the screen on the NeuTab is so particular about viewing angle.\n\nOverall:\nAt the end of the day the biggest advantage the Fire tab has is the screen.  It is also deeply integrated with the greater Amazon ecosystem.  The problem is that you lose access to the bigger Android app market.  The NeuTab has access to every Android app that will run in Android 4.4.  This lack of a fence is the biggest reason that I will be using this tab instead of the Fire.  So far I am very pleased."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "This product is in a very good condition. I like it."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "It is fast / I like the screen quality customer service is really great as well . One problem Is the 2 hour battery life  on a down loaded movie standard definition . I get 2 hours a movie /a TV show after ..\nMusic I got 3-3.5 hours with head phones all non stream\nA low action video game with music muted , 1,5 hours ..\n\nThis is great Tablet I sent a question about the battery life to the company , I did not get a answer if these times are common but a return authorization, so going do that  I have owned the Kindle 7 and got about 5-6 hours I wanted to get away from being locked into the Silk browser and wanted my Goggle /Firefox\nSo will shop around see if there are others with good battery life . I cannot see paying 50.00 then another 40 for the portable batt charger . it puts you in a new tablet price bracket so might as well spend it on a better one out of the box"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "the best tablet I have use  ."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "The NeuTab is a great tablet to have for anyone."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "easy to use, lightweight . sharp picture"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "S***."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "Unknown how I feel. It will take a while."}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "For $50 it's alright. But of you own an Iphone or a Galaxy phone you'll be very disappointed with this tablet. Screen and display are poor quality. Bluetooth connection is constantly interrupting. Sound is aweful. Screen freezes quite often"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "I order 2 neu tab before for my 2 sons one is working and one is not working. Don't know what to do about it."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "amazing processor, runs apps faster than i expected, I like it."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great little tablet! Great value at the price, and works as intended. Screen viewing angles aren't the best, but it is only $50. Bundled screen protector is great!"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "So far so good just opened and grandson loves it. Had good reviews so l took the chance."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "I was surprised to see a sleek product that works pretty good. I would prefer a better camera. But for the price you cannot beat it."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "didnt take a charge from day one"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Its a nice little tablet works very well.."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "exactly as described.  very fast shipping.  a quality product."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Extremely thrilled once I received my tablet. I would suggest this to anyone who is interested in an affordable device. However, since its so low in price the camera is not of great quality , nonetheless, I love it and it fits my needs. Im not gamer , all I need this device for is to read my bible , surf the internet and to do little task . Besides I don't take pictures much but get this while you can its a good find"}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "Does not last long at all, very slow. The description says that the quad-core processor has good performance, but that is completely not true. \"Enhanced performance: Featuring a powerful and robust Quad-Core CPU, NeuTab N7 Pro ensures quick app launches and ultra-smooth gaming. Android 4.4 KitKat enables quicker multitasking without sacrificing its performance.\" None of this true. It has only 512 MB of ram so multitasking is not efficient. This description also says that the camera is sharp clear. But this is all false. Don't buy these lies. This is false advertising."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Really like the product. It is very good for my small kid who love it.\nIf you are looking for an accessible tablet with a very good quality/price relation go with the NeuTab."}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "I bought 2, 1 for my son and 1 for my daughter... both stopped function. It was a very bad purchase!!"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Compares well to my google tablet. And for the money you can't beat it!"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Super slow!! To the point, we have to touch the icons over and over before it will even respond.  Therefore I'm not even really sure if computer is still thinking or the screen is just very unresponsive?  Either way the quality is also poor.  I bought two other tablets around the same cost as this one for my other two kids that are both much more superior in ever way to this NeuTab .  Will be returning and strongly consider buying any other products from this company"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "The best bought for my 97 yr old grandmother thank you"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "cool android"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "This is a terrible tablet I didn't expect much bot omg its so slow and messes up a day after I bought it it exploded on me like wtf"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "I just received my tablet today and am very much enjoying it. I only wish the battery would last a little longer. Other than that I am very satisfied."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "This is my first tablet, and I am impressed by the level of function for a $50 tablet. It has all the features I need, especially email, a web browser, Skype and photo storage. It was easy to set up.\nFor a $50 tablet, you can't beat it."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Pretty good tablet for its price. I liked the graphics, response time. I wish I could upgrade it to Android 5.1, but 4.4 version is just fine. I bought it for my 2 years old boy."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "This is awesome and I don't have one negative thing to say! Have had it for almost a yr and still love it!"}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "Considering that i bought it used the left side of the tablets screen is messed up . I can still see it, but the touch screen effect is a little off...\nIt still performs adequately"}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "Smaller than I thought it would be. It's just OK"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "My son loved it"}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "Bought it to use as a wifi monitor for my camera, not nearly as fast as my iPad, and battery drains quicker. Get an iPad or a kindle Fire."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "No SIM card\nWon't work out of U.S"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Works for me and streaming to the TV is awesome"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "excelent  i love it.  better than expected and shipped fast as lighting  a big thank you to this seller"}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "Unfortunately these were a no go. We truly wanted to like them as we purchased 3 of these and within 2 months all 3 are not working. The power button continually got stuck and with 2 of them you could only power them on when using the charger. We also purchased covers to go with the 3 we purchased however we were refunded as they didn't have any available..a huge no no for tablets especially when they are used for children. We returned 2 and received a new one for one and a refund for 1 and the new one stopped working in the exact same manner as the returned one. We weren't expecting the durability as we get from our ipads due to the low price, however, we did expect for them to hold up longer than a couple of months. Unfortunately, we can't recommend these."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I just want to say it's a great product"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Got this for my son to play games. Works great. Come with two USB cables which is very nice."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "works great for my classroom"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "it do everything I need it to do for the low price I got it for.its light the screen is perfect for movies and games."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "I really like the tablet, but it has frozen once."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Great little tablet for the price. I bought one for each of my two children. They love them. The touch screen works great. This is not a high end tablet and I wasn't expecting that at all. Perfect for young kids and the sound was impressive. Was is the key word, I'll get to that in a second. They have good battery life, fast processing, 2 charging options (which is great), and a sensitive/responsive touch screen. Mostly no complaints. My daughters are 7 and 8. They solely use the tablets for games. And yes, I would purchase this tablet again.\n\nHowever, my daughter's speakers went out on one of the tablets after less than 2 weeks. It wasn't dropped or mishandled in any way, it had  a case on it since the day we got it. The headphone port still works, but we decided to try our hand at returning the tablet for a replacement.\n\nI don't return things often, especially by mail. I do like Amazon. I usually read reviews before purchasing so I can be as sure as possible that I will like the products I buy. We only had the tablet a short time and I didn't want to resign to only using headphones so soon after the purchase, so I bit the bullet... Amazon made the return/replacement SO EASY! It literally took 2 min to order the replacement and I got the shipping label email shortly afterwards.\n\nThis product is good. I gave an extra star because I feel a lot more confident now that I have seen how fast and easy the replacement process is. The other tablet still works great, maybe this one was just defective. I'm super happy with Amazon's customer service."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "It's awesome kinda small but awesome"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "I think you get your money worth out of this tablet. It's my not be the best tablet on the market but for $50 you get a device that works and has no major issues."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "it nice device and I hope success in your lif order number 108-9458030-6981834."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "This tablet is very easy to run and works great for my daughter to play games on or watch videos."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "great tablet for the price, the dual camera feature is great for selfies.... overall i am satisfied with this product"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "it is really helpful"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Didn't work as expected. Returning the item"}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "The display obviously does not look as good as my another $80 tablet. You can see it well only at some specific angle.\nYou get what you pay for."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Wow, I was at least expecting something decent for $50.00, but I wouldn't pay $20 for this thing.  I bought this for my young son and after sitting down to set the thing up I knew right away I was sending this back.  Right away when I plugged it in I noticed the charger wouldn't go in very well,.  I had to push pretty hard on the 3rd try and it finally went in.  I've had charger issues with electronic devices so right then I had a bad feeling knowing it would probably cause larger issues later.  After fully charging it, the battery died about 10% every 5-10 minutes.  I checked the screen brightness and it was only at 50%.  Also, the screen quality is HORRIBLE!  So much glare and reflective colors, almost like oil and water when they mix.  It killed my eyes and even my husband and son said it hurt their eyes just look at for a few seconds.  This thing was barely out of the box and charged up before I broke the news to my son that we had to send it back.  I can't justify spending money on something of such poor quality.  One more thing I noticed as FALSE advertising (besides the \"great quality\" screen) is the box states Android 5.0 Lollipop but this shows 4.4 KitKat?  Which is it?  Whatever it was it was crap on this tablet."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I LOVE THIS PRODUCT"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Bought this the other day. Good tablet for the price. Great ease in surfing the web, reading books and watching movies."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "After reading the reviews on this tablet, I decided to purchase one.  I have to tell you, for $50.00, it's quite nice.  You really should spring for the extra memory, but all in all, this really is a five star unit!"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Oh! this is crap!!\nHorrible screen resolution and so much slow processor speed."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I'm quite happy with this NeuTab, by Samsung. By weight, it is very easy. The design is developed professionally and in accordance with the current needs of users. But the most important thing that this device initially include all the required files. I can see movies, listen to music, read books or working the Internet. I'm quite happy! Thank you very much!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "just got it the other day and REALLY like it . for the money it can't be beat."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Already broken.  We have only had it for 4 months. It just stopped working.  It was not dropped or mishandled.  Very frustrated since we  can not return it.  Do not purchase this item."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "first let me say i was surprise of the quality of this tablet ,this tablet ia a winner for the price.\nspecification is great i really love every thing about  this tablet,\nwill purchase another one soon , will recommend. 5 star"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Cuts only the first 1/2  inch"}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "The camera graphics is fuzzy the device get hot n less then hour the better die very fast and its always freezing"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great product Love it!!!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great service and a great product! Would recommend to anyone!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "OK"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "very surprised for price"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Convenient and portable tablet."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "I bought this product for my eight year old and so far it works just as well as the other tablets. We have no complaints."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "This product is excellent, my daughter loves her tablet"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "this tablet is just what i wanted, it is excellent, thank you"}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "too slow"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "just got it and within a day it crashed."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Perfect gift."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Does everything I need it to do."}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "SLOW started crashing within days,  regret it"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "This was a gift to my small grandson.  The first one broke within days of his birthday.  I returned it and they sent out another one.  It is now charger port won't work.  Needs to be held at an angle and it goes on and off with charging.  Tab keeps dying.  Apparently is is not within the time limit of return.  Don't bother buying it.  The device sucks."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I love my new tablet"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I love it, it's the best I've had so far and I've had no problems with it. I really like that it's cheap and affordable for most people.. really amazing."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "A really great tablet, I like like it way better then the iPad and Samsung I have had prior and it costs a lot less."}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "The charger did not work after a several days of sparking when being plugged in. My son got really upset that it happened because he was playing a time consuming having to be active game called Clash of Clans. Really wish that you would be able to make sure the product was in working order before it is sent off to the costermer."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "right on time, works great love it!!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great tablet for the beginner!  My husband is not a computer type of guy and was able to figure this out very quickly!  Good product, great price!"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "comes with a virus and discharged quickly\n\nthis is fraud"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Great price, and it works as expected. What more could you ask?"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "I just started using the device and it's a great value for money. It would be incorrect to compare with other tablets as they do not offer these features at such an affordable price point."}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "NOT Impressed.  Cheap piece of junk. If you play ANY games on Google Play DO NOT buy this!!  Buy an Asus. I had one of those and loved it."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "my 9 yr daughter loves it!! she hasn't put the tablet down since she got it!! and delivery was very fast!! well worth the money!!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I purchased this tablet for my 5 year old son.  It comes with a base install of Android (minus the bloatware most are accustomed to).  While the screen quality may not be what is seen in a iPad or Galaxy Note, it is still decent once the brightness is turned up. While the sound quality is \"tinny\", there is more than enough power to handle a Skype video call.  Overall, a good value."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Excelent! I bought it for my 3 years old son"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "It's great as a simple tablet. The camera is not too great which was a disappointment and it isn't as fast as I'd like. Then again, this tablet is for my father and not myself. I am used to iPads. Overall a great simple tablet that serves it's purpose!!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I got the NeuTab N7 Pro 7'' Quad-Core Tablet for the basic stuff, entertainment music, quickly checking things on the net (email, searching, etc.), and watching videos during down time. What works for me with this tablet is native support for Google play, and Amazon App store installed and worked without consequence. Haven't found app I use regularly that won't work with this tablet.\n\nOn the first charge, I got a couple days use before needing to charge again. Mostly video streaming, internet browsing use. I keep screen brightness low and that helped with battery life. I like that I have Bluetooth on a budget tablet like this, some selling at 2-3 times the price don't even have it. Paired it with wireless headphones and a Bluetooth keyboard without a problem."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "This is a great device for a kid. It has two ways to charge it and it's easy to use. The coloring on the screen could be better. My son loves it!"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "I tried to leave 0 stars but it wouldn't let me. We bought the tablet and within a week the thing died. I contact Amazon who offered an exchange which we did and the 2nd tablet also died. It seems like the power button isn't working. I don't know, but I give up!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "https://www.amazon.com/review/review-your-purchases/ref=oh_aui_rev_shipment_o00_s00?_encoding=UTF8&asins=B00THEMRX8&channel=YAcc-wr#\n\nDid not expect my package so soon.  EXCELLENT."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "This tablet is very easy to use.  I like the product and will be ordering another one for a Christmas gift."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I love this tablet with all its features. You should add a OTG cord with it also. Came on time."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "works real well. have had it for a while. We all use it. has been dropped several times and still works like a charm. The screen protector that came with, that we applied when new is still on and is very resistant. Works so well we have bought two more for gifts. Graphics are great, network is great, is a quad processor so it works awesome."}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "+.+This tablet is easily rootable. However DO NOT use towell root. It's incompatible.\nYou really just need KingRoot, SuperSu, and an app called System App Safe Remover (0r es files)\nInstall kingroot or sasr first, then uninstall/disable programs through the gear icon, \"settings\" then \"apps\" then uninstall...\nAfter rooting and overhauling, this tablet WILL perform better, however, it might not operate as efficiently as you might have expected.\n\nReview:\n The Neutab n7 pro is basically a knock-off of a Quality Android tablet.\n Out of the box, it runs similar to your generic dual-CPU Android. It has a distracting square grid super-imposed on the display. It only responds when you touch it very lightly.\n\nCompared to the Kindle Fire, CURRENTLY AT THE EXACT SAME PRICE,\n this has more general value.\nHopefully this might save you some time and frustration!\nMuch nicer than the Amazon Fire!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "It's a great tablet for a very affordable price."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Good value for the money."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "No problems with quality.  Happy with the item."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great product would recommend it to anyone who needs a tablet but don't have the money to buy a traditional expensive brand, plus it works just as the others do."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "IS GREAT FOR KIDS"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "It is a good inexpensive tablet. Still new to me but I am getting used to it. Does seem to slow down while on my wi-fi. Battery drains rather quickly."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "This was the second NeuTab tablet we have purchased. We are very pleased with the product, and happy that it has a one-year warranty. Many tablets don't offer that."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I'm happy with the product, everything was neatly packed and shipped, arrived on time, and it gets the job done if your looking for a great priced tablet."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Good response, birthday present for my grandson, he loves it!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I love my new tablet. Shipping was very quick, and it arrived the day it was supposed to and it was also free shipping. The tablet is very good for the price it has. A little small but for 50 dollars, you can guarantee that i will be purchasing more. I've had no problems or cons with my tablets so far. I also highly recommend you purchasing this tablet if you are looking for a great small tablet."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "I bought this for my sister who is new to this sort of technology.  I didn't know how much she would use it and since she had never used a computer or anything before, I decided to go inexpensive without bells and whistles.  I first bought another brand but returned it within a couple days of her using it.  I searched Amazon for the price I wanted and read the reviews.  The NeuTab N7 Pro 7\" Quad has not disappointed over all.  It charges easily and fairly quickly.  It is simple and easy for her to use.  The only repeated complaint I hear from her is that it freezes up periodically.  It seems to have been happening more frequently in the last week.  She has had it for almost a month.  I wanted to wait before giving a review so it would be more complete.\n\nAfter having this for a little longer, the battery does not keep a very good charge.  I have changed my rating based on that."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "This is a good starter tablet for sme one who has never used or had one. I purchased it for my dad who is a senior citizen now but who is it learning new technology. He however does not know how to handle or take care of any item. This tablet was something for him to log into the Internet or play games without having the small screen of his phone or standing up to go to the office and use the tablet. It hardly has any memory and the camera is horrible."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "This Product works great.  It does everything I expected and more.\nThe battery life is about one half to two thirds of what is advertised, when used heavily.\nHowever, for the price, this is definitely a good first tablet. :-)\nThanks NeuTab. :-)"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "not bad... so far..."}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "I got this tablet a few days ago. I got say I may as well use my smart phone I like it much more. This tablet is not easy on the eyes, it is very slow and it just does not make me a happy camper. I thought after giving my son in law my laptop I would try this thing. Well, I will be purchasing a laptop soon. Sorry I do not like this thing."}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "I couldn't get it to work properly .... So I sent it back ...."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "very difficult instructions for assembly not really user friendly"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "It is good for the money I spent on it, but it seems a little buggy to me. There are times when it can be slow, but overall I do like it!"}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "Ok so far"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "The tablets are fast and have a decent battery life. My kids enjoy them."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "This is really a bad product folks. I bought  two  for my son and daughter as their presents for  their  birthday. The  two went unresponsive,  completely  dead in less than  2 days. Absolutely nothing  appeared on the screen. I have returned  them so that I can get my refund. If there was a zero star I would  have  rated  this product  zero."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "The tablet is a great buy, it performs well and  is easy to use. My child loved the tablet."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "it is cool i love it but there is only one problem it has a very very tiny mark on one corner even though it was brand new it had one scratch."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "The cameras aren't that great. But for the price it's ok."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "I had this tablet for only a month and it already stopped working. I can't seem to find the problem, so I'm gonna have to just let it go. If I could get another one and send back this broken one, that would be amazing. I would then change it back to 5 stars."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Junk....nothing but problems and no real online tech support."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I love it and have been using it for hours every day. Really easy to set up and use. A lot of fun can't believe I got such a great tablet for so little. Very HAPPY and my boyfriend is now going to buy one!"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "The screen protector was too large. That's the only complaint we have. It works great for my 5 year old who is using it for school. Great price, great quality for what we need."}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "I purchased the NeuTab to try myself with a plan to purchase multiple units to give to my clients to display our products to customers. I don't think I will at this point. It feels cheap (which was expected for $50), the glare is horrific. Even staring at the screen dead on in natural inside lighting you can see yourself with the screen on and it's SO HARD to see the icons and words because they look mirrored and they look like they are under a magnifying glass....so don't even think you're going to use this tablet to read a book. It's so bad it actually makes me dizzy. The screen is laggy to input, if it takes it at all and your finger doesn't glide across the screen...more like stutters. The first time I tried to play a YouTube video, it crashed. The camera is unusable  as it won't focus. It's complete garbage. I knew that I was going to be purchasing a crappy tablet, I was getting it just to play videos for my clients which it will do....but that's about it."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Aaaa"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "My husband was very pleased with the tablet."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Nice little cheap tablet!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great product...highly recommend"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Good tablet , light weight , perfect for\nWhat I need it for!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I am truly impressed with my purchase. It is very user friendly and applications are easy to find and download. For the price I don't think I could have gotten a better deal."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "For the price this Tablet is good but the screen image is horrible."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Good quality, neat packaging, the visuals are great. So far the battery life is good."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "An amazing deal!  Far better than expected for $50.\n\nMy own tablet is a Nexus 9, a very high end Android tablet.  I bought this for my seven-year-old son and was pleasantly surprised at how few were the ways it was inferior, and how none of them will detract from his childhood use of it.\n\nSpecifically:\n\n1. The screen only looks decent straight on.  Not a tablet to sit on the couch and have friends on either side watch too.  (Not a problem, his friends have their own phones or tablets and are using their own Minecraft of Clash of Clans accounts.)\n\n2. The case is well made, but not especially sturdy.  It handles expected use great.  We like the button locations.  The first time my son dropped it, the front facing partially separated from the pack panel.  It barely moved, and was not noticeable until the mini-USB plug would not go in any more.  Squeezing the case around the edge clicked all the bumps back into their holes and it was fixed.  (Not a problem.  He needs to learn not to drop it.)\n\n3. The battery is quicker to deplete and quicker to charge.  (Not a problem.  I do not want him using it for many hours at a time anyway.  We already own USB extension cords for tablet use during road trips in the car: the one time hours of tablet time is allowed.)\n\n4. Loading times are slower.  Duh.  (Compared to his InnoTab, this is much faster.  He is thrilled.)\n\nMoreover, it has advantages for him over my much more expensive tablet!\n\nA. The buttons are in better places, and easier to use.\n\nB. It has a micro-SD slot, so his favorite music and movies can now travel with him.\n\nC. It comes with a very nice screen cover, and costs much less, so I am much less worried about scratches on the glass.\n\nD. It has both a charger plug and a mini-USB plug.  It can be plugged in while transferring files to or from a laptop.  (A small benefit, but potentially helpful.)\n\nI will order another one (in the other color) for his four-year-old brother as a December holiday present."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "I love it, I was surprised of the size.  It's smaller than I was thinking, but for the price it's a great tablet."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "very good for the price,"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I bought this for a friend upon request. He seemed very pleased, other than that I can't say much. It arrived safely and on time."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "so far so good, i like how the product works easy to use.\nAfter using it  is very slow not sure if I love it"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "It has a front camera also it is light which makes it even more comfortable to travel around.  Most importantly the package was well kept and organize as well as the tablet was safe and secure."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "A Pre-Used Tablet, Could Not Activate, Screen was locked,  did not know unlock Pattern,  Has too purchase New Device  !!!"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Being new to tablets I would have liked to have a little more detailed instructions but overall I am very happy with the tablet."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Very nice!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I love my ttablet"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "The nuetab is awesome! Very compact I love it"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "quick, clear screen"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "It is worth for money. Especially suita"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Kids like it."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "This is exactly what we needed. We wanted a cheap but fully functional tablet for our toddler to play with (limited, supervised time, for those of you who want to judge). She had a Zeki tablet but it broke. This is higher resolution, faster, more memory, and plays everything without the annoying quirks of the Zeki (eg, the Zeki's display wouldn't rotate, so videos couldn't be displayed full-frame; books just split up into unreadable page fractions, etc.). And it was cheaper. It came with Google Play so all we had to do was link to her account and all her games were ready to download. No problem at all linking to the home network. It blows the Zeki out of the water, and frankly, it compares favorably to our iPads. My toddler loves it. If I didn't own an iPad I'd probably get another for myself."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "This tablet is being used to control my garage door thru a bluetooth connection to hardware.  The n& included bluetooth, which some other similarly priced tablets did not.\n\nTablet is working very well.  In addition to the bluetooth, I'm using the microphone for voice activated control of the door, as well as the wifi for text message control.  The wifi is stable, good range on the BT and reasonably sensitive microphone.\n\nOf lesser importance than function, but nonetheless appreciated is how well laid out their packaging is.  The little details like that tell me they put some thought into their customer's experience- always a good sign.\n\nTwo critiques.  One is the screen, a couple angles get too much glare and there is a noted difference in color balance (almost a bluish overtone) etween the N7 Pro  and other tablets of mine; the other tablets being more realistic colors.  Two, the screen auto-rotation is not as responsive as with most tablets.  I can only get one portrait and one landscape orientation (no flipping), which can be problematic given volume buttons and docking mounts.\n\nOverall I'm quite happy with this guy- especially at the $50 price point.  Much better than other \"cheap\" tablets I've worked with."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "The screen to me in this day and age is worthy of 50 bucks, but just not worthy of buying still.  It's like walking around with a good standard definition TV in your pocket. You have to be at like the perfect angle for it to be watchable. Or you'll see shadows of people instead of people. The battery only lasted for about 3 hours maybe less of video watching and a little gaming. You have to use the charger that's not the USB or it won't hold a charge for more than 30 min. With that said kodi, temple run, Netflix, amazon, web browsing works fine. Its slow on taxing sites.\nAfter having a kindle 7inch HD that got ran over by car I wish I would have gotten the kindle hd6inch. Only 50 bucks more. The HD screen is worth it 1200x800 not 1200x600. After watching a movie on an iPad then going back to the kindle; the iPad is better but not enough to miss it. After watching a movie on my neutab I miss my kindle dearly."}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "Ok for the price.  They have to prefect it more.  It. Keeps closing whhen I am\nplaying a game.  Thank you"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "It is a good tablet but is acting slow at times I don't,t know if I need security software or it is my internet ."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "This tablet is a good replacement for my kindle that died on me."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "I am Kendra's mom and I am new to owning a tablet.  I got this tablet to replace another brand that sent me two that didn't work.  I wanted an android device to take on a trip so that I could access apps I cannot on my windows phone.  I have had this now for a couple of weeks and really like it!  It was very easy to get set up and downloading apps is a snap.  The only issue I have had at all is that sometimes, it does NOT want to change orientation from  vertical to horizontal no matter how I rotate it - or upend it.  It has always eventually changed, though, and the image quality and responsiveness in changing screens has been completely satisfactory.  While it is obviously not an iPad or a Galaxy, I knew that when I was looking for a bargain priced tablet and I am very pleased with its performance as a $50 tablet."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Really nice.. Love it!!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "excellent tablet for my 9 year old!!!  Right size, right accessibility, right choice!!!!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I bought these for my grandkids, and they love them.  No more fighting over Gammie's tablet--now they each have their own with their favorite games installed.  Also, each one has personalized wallpaper for their favorite pasttime--motorcycles; Pokemon; animals.  And the fact that they already had Play Store installed, made the set up so fast and easy.  I would recommend this tablet."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Great tablet. Wish it came preloaded with a document writer however since I am going to be using it for my school work. Other then that it's a very nice product and has Google play so I can download my fravorite games and other apps."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I  got this for my grandson and he loves it!!!!  The only complaint is you can't use headphones with it."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "first one broke in just over 30 days and so I tried a second one and it broke within 3 days.  Bad choice!"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "I was excited about the dual camera but kinda disappointed in the resolution and the quality of it. Definitely I won't use it to take pictures. Overall an ok product for the money you spend."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Love it!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "This tablet is PERFECT! My 11 year old loves it! Shoot, now I think i'm going to buy myself one! I love that it comes with 2 different kinds of chargers! I'm very happy and so is he!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great affordable option for a tablet.  Does all that I need for my job that requires me to be walking around all day!"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "For the price, this is an amazing product.  Being a first time user to tablets, I have asked other people who have higher priced tablets what they think of this, and after playing around with this, they are all amazed with the quality, especially at the price. Very user friendly, and easy to get started. Very happy I purchased this."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "We love the tablet. We bought it for our 2 year old to play games on and watch her cartoons on. She loves it!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "this product is well worth the money!  I can use the wifi arount in the yard around my house, works on video down to 2 bars and email with 1 bar\n*Your results may very but I am pleased with this purchase can't wait till I get it on the road"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "This product is garbage and will last a few weeks to a month at best. Please do not waste your money, I purchased this tablet twice and each time after a short time the tablet shut down and would not restart, even after 24+ hours of charging. I give it one star for being shipped to me in a timely manner. Spend a little more money to get something worth having."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Just purchased the small tablet for one specific reason, to use for a work application to take with me on inspections.  Works great so far, My kids have gotten a hold of it and give it the kids thumbs up.  was able to use the app store and app loaded just fine on my home wifi.  the app I used, itself is slow to respond to touchscreen would recommend a stylus."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "a very good product... my son lovely..."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Speed delivery and now trying to play with my new neo."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Keeps cutting off and slow only used it a handful of times now in the box in a drawer."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Worked as advertised.  Very pleased."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "The product arrived like expected. I'm pleased with my order."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Just got my tablet. Shipping was early and the tablet looks great."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Perfect for all my needs. I can stream movies and play games. I did have to find a note app since it didn't come with one but overall I am very satisfied with this product!"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "My Amazon Fire HDX runs circles around this in terms of speed, wifi and bluetooth range and connection speed. Wish Amazon would clear the way for more app developers already on Google Play, I Tunes. For $50.00 it is more than proportionally within acceptable performance expectations. Amazon Fire HDX side loaders, you may get away with side loading a few Google Apps, but you will meet with increasing difficulty."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "We bought 2 of them plus protective cases but the cheap plastic bits that keep the screen situated did not last very long. Now both are broken in less than a month. I contacted the company and they said they were passing the message along to their design team. Buying a fire tab next."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Love this tablet! Convenient and fun. Love that you can have multiple users. It is a little slow even on wifi. Otherwise perfect for kids!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Awesome !! My son loved it !"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Pretty good tablet for the price."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "I really wanted to like these... But I guess you get what you pay for.  We couldn't afford an iPad- and looked for something functional without all the fancy apps-functions.  I wouldn't buy them again. We bought 3 of them for our kids for a road trip across the country.  The third day one of my kids dropped it (with a case on it) and it landed on the screen-didn't crack, but the tablet was ruined.  They also freeze up and are EXTREMELY slow- very frustrating for a 3 year old let me tell you.  Poor quality.  Pay a little more and get something better."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Awesome!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "great !!!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Love this. I'm about to order a second one for a friend. Very pleased a th this product. I just got the second one for a friend and she is so very happy with this. Awesome Tablet!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Arrived on time, and works perfectly for a First person screen for my drone as well as other things I have been using it for."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "This tablet is very good for the price its one of the best out there"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "My sons love s it thank you"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Bought it for downloading movies to chromecast .Not sure how it will work yet."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "I have had my NeuTab N7 Pro for a little over 24 hours now, and I am enjoying it quite a bit.  I have been very impressed with this tablet, especially considering the low price.  I am a student and I purchased it mostly for taking to school and taking notes, which thus far has worked out well for me.  I have also used it for watching things on youtube and netflix.  It streams them with no problem.  I found it a nice surprise that it was not overloaded wth programs and apps right from the start.  It was also very helpful to have Googleplay already installed. So this tablet works great for what I wanted, something small and portable for school, and recreational viewing."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "Downloads slow"}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "Bought these along with the non-pro version. Pro version is definitely a better choice. Speaker is rear facing and tab shakes a lil at full volume. Plastic back. Colors are nice and crisp, but distorted screen vision when looking at an angle."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Good value. Works well.like it lots compared to much higher priced with same features"}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "It was as advertised and it seams to work well but the lack of a usable instruction manual makes it difficult to use."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Works just as well as my mini for my needs. ORDER # 110-5524830-7066634\nhttp://www.amazon.com/gp/product/B00THEMRX8?redirect=true&ref_=cm_cr_ryp_prd_ttl_sol_0"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "good"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "ordered for my son, seems to be working for what he needed it for."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Bought a couple weeks ago used for a week now it won't turn on or charge. Sucks because it was a good tablet."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great tab just the size I need for short trips quick to set up clear display"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "It came early which was nice surprise...and fit the tablet very well"}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "I admit this is my first tablet.  I've used and built computers since the 1980s.  So while I am new to tablets, I'm very adept with PCs.  This tablet does offer a lot for the price.  Really can't beat it, but I only give it 3 stars, because the camera is not good at all.  The photo resolution is pretty sad.  The sound is good but would have been nice it I had paid attention to see it only has one speaker.  Also not good for someone who loves quality music reproduction.  My fault.  But will be good to have it sit there while I work around the house and not really paying attention to this issue.  It takes getting used to finding how to get around to everything you want to do that comes so quickly and \"naturally\" on a computer.  I have yet to figure out how to correct the time.  It insists I am in Beijing, China.  The other disappointment for me was to learn its Android OS is not compatible for the Wink Hub home automation.  The online tech with Wink said all I needed was either Android or Apple OS.  Wrong.  And again, not this tablet's fault.  I thought about returning it, but for only $50 I decided to see if I could learn to love it.  Setting up Spotify and YouTube helped.  It's a good buy for entertainment.  I don't much care for the way you have to type to send an email, but learned you can use the microphone for speech to text.  That works pretty good.  Only problem there is when it gets a word or phrase wrong, because I've tried to go back and fix it with text editing and I couldn't do it.  So i either had to leave the gook or delete the whole message to start over.  That's rather annoying.  Overall, it's a good buy for the money.  I just needed to pay closer attention some of its details before buying it."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Just got it about 20minutes ago and the power button is damaged. It might or might not work"}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "It's really not what I expected. I've already had to send this product back for a replacement. The first one kept crashing and resetting itself!\nThe replacement, gets very hot and even with high speed data it is so s l o w!\nI'm not sending this one back. Too much of a hassle. Thanks."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "great tab for price....moves really quick.$50 well spent"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Overall, very happy with the NeuTab N7 Pro Quad-Core Tablet. Awesome tablet. Upgrades android software immediately. Can't beat the high quality for the price. Works great for my needs and performs great for its price range.\n\nStorage space is fine, has 8GB for my apps and so on (about 5-6GB user accessible), and I can add a Micro-SD card for more space.\n\nTablet has basic accessories, USB cable, charging cable, screen protector, manual, and a USB wall adapter. None of my Kindle device came with half that."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Super fast shipping! Great tablet at a great price. I bought this tab for my 2 year old to use with his learning program. Easy set up and easy to navigate. Super happy with my purchase. =)"}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "Keeps freezing for no apparent reason. GARBAGE,  but that's the price u pay for, right!"}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "I ordered two of used NeuTab tablets because it read like a good deal for price. One of the NeuTab tablets would not charge even after using both the outlet charger and the USB charger. The tablet only came on while it was plugged in. I charged it all weekend but to no avail. The second one works but it only charges through the USB charger, the plug-in jack on the tablet for the outlet charger would not fit. However the USB charger did work. So I was able to charge it and use it. These were the used NeuTab tablets."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Is a good tablet. .. 4 stars!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "This is perfect for my needs.  Its light weight and display is great.  I can carry it in my purse so when I travel I just whip it out.  I don't have to have so many apps on my cell, I just put them all on my tablet.  Nice job Pro 7."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Love it"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I am happy with the purchase. Trying to figure out how to increase the idle time otherwise it is working as expected."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great tablet for a child!"}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "I read tons of reveiws & watched reveiws about this tablet on youtube. So I thought it would be A good little tablet. Turns out I was wrong. The battery drained so fast it was ridiculous. To top it off it kept telling me there was something wrong with my wireless connection, it just wouldn't stay connected (even though all my other devices were fully connected) . The screen kept messing up my eyes, if u don't have the screen titled a certain way, it looks horrible. Yes I know you get what you pay for.  but I was mislead with all the reveiws. I returned it."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great tablet for my kid, very durable and easy to use for them and its fits in their hands perfectly"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Love it.  Wish speaker were clearer but meets my needs"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Extra flimsy. The first one my son broke the screen when he got mad. The replacement lasted a few months longer but the casing by the usb port and charger has become damaged and we can't charge it now.  My son is 10 and this tablet couldn't take the wear. I guess I'm glad it wasn't expensive since he broke the first one but maybe a sturdier one would have survived"}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "Clarity is not good. Poor photo. Would not recommend"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "I received the NeuTab NT Pro 7\" Quad-Core Tablet as a gift before I go into the hospital.  This tablet will enable me to do the same things as if I am using my desktop at home.  For example, I will be able to access my e-mail, internet, do Google searches, and Skype.  This tablet will be a useful device so I can stay connected with friends and family.\n\nUsing the stylus pen with this tablet, I find it easy to operate.  The apps uploaded to this tablet meets my needs.  Overall, I find this tablet convenient to use where ever I am at providing there is Wi-Fi available."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "This android tablet is fast, which is awesome! I have had no trouble connecting to the wi-fi internet. I went to the netflix website to try to stream a video with it (it came pre-charged, which is cool, too) and I was prompted to \"install an app\". It was easy to do with this device."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "The tablet itself is a very nice piece of gear.  The sound is good and the cameras are adequate.  The problem comes in when you try to make this work with your other computers and net work.  The instructions provided are inadequate ans contact with NeuTab at their contact email didn't produce anything.  In my case, lacking a competent 12 year old, I had to have a local computer company make a house call to get this to speak to the internet and to access email and google ( price $60.00).  You certainly need a cover for the tablet ($15.00) and if you have large hands a stylus ($14.00) is a good investment.\nIn short the $50.00 Tablet has been a $139.00 experience.  However, for what I use this tablet for, now that it actually works, the cost was acceptable."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "The Neu Tab works fine for exactly the reasons I bought it...\nI spend a lot of time in waiting rooms, and I watch videos to pass the time...\nIt serves my needs perfectly ...."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Nice inexpensive tablet.  Does what I need.  Charges fast."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I bought this smaller tablet for my mother for her to \"test drive\" before buying her a larger tablet. She loves it and doesn't want to give it up!"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Do not buy."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "We ordered this item to work with our video doorbell at our office.  It didn't work.  Was too slow to upload.  We are keeping it to use for other things in the office."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Please do not waste your money on this.  We only got a couple months use out of it when it broke (power button doesn't work), conveniently a few days after the return period expired.  Amazon should not carry this product it's a total rip-off."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "I hate this tablet!!! I got this as a gift and I can't stand it. Everything crash's on it from apps to the keyboard and os. Speaking of which, the keyboard just disappears for no reason! This would be great for a little child to screw with because its s cheap pos, but don't expect much otherwise."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "What a piece of crap!!! Received the item and it didn't turn on! It was broken!!!! BEWARE!!!!!!!!!!! DO NOT BUY!!!!! Very disappointed!!!!!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "For 50 bucks you cannot go wrong works great, durable, sounds great, i just wish i could get all apps like garage band and instagram."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "This product is awesome. Very durable. .sleek.and very good battery life!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Very nice and amazing workings love the way it boots so fast.\n\nPaul L Day Order id 110-1421619-7875423"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I purchased this tablet and I am very pleased with my choice. The case is sturdy, the display is sharp and it's quad-core chip processes information, quickly. Tested it's operation and ease of use with many apps, that, are available on the Google Play Store, all ran fine with no problems. WiFi operation was flawless. I added a 32GB Micro SD card, which, also functioned, perfectly. I would recommend this tablet to anyone!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Received my tablet and was pleasantly surprised by the simplicity and excellent functionality. It does everything you need and for only $50 its a no brainer"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "my kids love them"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "great price. very good for screen size.order#107-3172237-3337868"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Terrible junk.  Display is soo crappy that I thought I had a defective device.  Plus there was a ding on the lower part of the screen so I thought that the display was messed up because of that.  Returned it and had another one shipped out.  Display is still the same crappy resolution as the original... it wasn't a defect.\nAdditionally the touch controls are way off and imprecise.  Wished I could give it no stars.  Doesn't even deserve a star.  I want NeuTab to refund that star to me."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "It's a good product I had a damage one at first but they replaced it"}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "Arrived fast, took awhile to charge and does not inform when charge complete. Worth about what I paid"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "This device is great!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "The neuTab N7 Pro 7\" is lightweight and very easy to use. I rate it a 5 star product."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Love the tablet. got here just n time! thank you"}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "The positive--it works.  It works fine for basic web browsing.  However, when I try to run various apps, it periodically freezes up.  I would spend $50 more and get a better tablet such as an Asus Memo Pad.  Bottom line, you get what you pay for.  I wish I had not been such a tight wad and spent more money for a better product."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Sweet little tablet, does everything I have tried to do with it."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "A very useful product at an amazingly low price."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "a really capable tablet for the price.  No complaints except don't misplace the charger because your standard mini usb chargers that everything else uses won't work."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "Its a nice little tablet I gave it 3stars. Because I brought it for a game and it isn't Campatabal with this tablet"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "For the price, you're not going to beat it. My usage of a tablet is going to be pretty minimal, I just want something to watch videos on during my lunch breaks at work, everything else is just a bonus. The resolution isn't the best, and sometimes the button response isn't what I would like it to be. I feel like I'm clearly clicking on a certain key and the one next to it is selected. A longer battery life would be nice, but all of this is completely overruled by the price tag.  For the price, this is extremely impressive."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "It's very slow. Crashes and over heats. I don't have a lot of app installed. I guess that what you get for the price. I would not recommend you buy this product"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Good experience and satisfied with amazon."}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "Unfortunately, there aren't very good instructions or technical support."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "My 7 year old bought this to play games on and it seems to work well for the price."}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "Totally disappointed about this product. Sound braked in one week. Very poor WiFi abilities. ..loses the internet connection every 5 or 10 minutes. Need to restart the whole system to get  the WiFi working again for some time.  I don't recommend it whatsoever"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "love it"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "This is a good unit for the price.  It is slow and the resolution is not great, but it suits my purpose:  I put all my CD's in \"the cloud\" and have attached this tablet to my stereo (via the earphone jack).  I leave it connected to the AC charger. The audio output of the NeuTab is at least equal to my stereo's capability (a book shelf system).  In addition to my music collection, I can pipe anything available on the internet to my stereo with this unit."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "This is my 3rd Neutab. The first had a problem within the first month and you replaced it right away. That Neutab performed flawlessly for over a year ..until I walked across my synthetic flooring and sat down in a synthetic covered chair and touched the back of the Neutab causing a spark to go from me into speaker area of the Neutab. The poor thing went into a spasm that made the screen go wonky in millions of colors. After letting the unit go completely dead and repowering it, it continued to perform well for almost another year before going unresponsive. I am so glad to have my Neutab back and I will be extra careful not to zap this one."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "I love this tablet. Great value and quality. I would buy another."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "If you're used to a Kindle or Ipad type display screen, you will be disappointed in this one.  It does not view well from angles and the brightness control is between bright and very bright.  However, if you just need an extra device around the house, it is clearly functional and easy to use - and it for the price, I can't complain too much."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Round 1: Hardware\n\nThe rightmost 1 inch of the screen was completely unresponsive. Started the replacement process.\n\nRound 2: Software\n\nScreen works, all 7 inches. Too bad the software is clumsy, the touchscreen is fidgety, and the installed apps don't work. I think I'll take my $50 and save toward a different tablet."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Unfortunately, the tablet will not power on at all.  I am going to return it and try again."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Great deal! Wish there was a flash or light on the camera. Other than that works great for what I do daily...."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I bought it for my 8 year old brother. Very well designed tablet, snappy interface. He was so happy to see his 15 year old bro get him a tablet."}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "You get what you pay for - and i should have saved my money. Buggy - apps constantly lock up. Touch screen 'stops responding' to input every now and then, requiring a hard reboot. Screen is just horrible. It now belongs to my 1yr old"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "It's hard for me to write a review for this tablet. This is the first tablet I've bought in this price range. I own a Galaxy tab 4, a couple kindle fire tablets and a nexus tablet.\nI was looking for a cheap tablet that could run some mobile games that I play because I'm a dork and like to multibox my games.\nThis tablet does what I needed it to do. It was able to run my apps just fine.\nThe down side to this tablet is it feels flimsy and the screen resolution isn't that great, you really have to be directly in front of the screen to see a clear picture.\nThis thing would be fine for an adult user who will take care of it. I wouldn't recommend this for young kids, I don't think I could hold up under normal wear and tear.\nIt has two ways to charge it also which I found to be a really nice feature.\nDon't compair this to other more expensive tablets, this is a budget tablet with a budget feel, but I haven't had any issues with it, and it had all the options I was looking for. I'd say it was worth the 50$"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Excellent!"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "This product is very misleading. 7 inches is accurate but the screen is only 6 inches long and 3 and a half wide. this things actual working screen is barely bigger than my phone. which defeats the purpose of this object in my eyes .it has this flimsy plastic shell and then a thick black \"frame\" before it reaches the screen. so far it works somewhat well however its much too small to be called a tablet. Buy the new Amazon fire tablet the screen size is actually 7 inches\n\nUpdate: after further use ive found this thing barely works if at all 90% of the time. it takes up to  restarts to just get an application open. half the time i cant even turn it on and its not holding a charge. what an absolute waste of money"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "It was amazing! The screen looks as if its 3d!"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Good value.  Not as nice as an iPad, but a LOT cheaper.  Great for kids gaming."}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "I think its crap the screen dosent feel like glads more like a type of plastic it take a whil for the apps on it yo run somrtimes it cant play the app so then you need to reload it the screen looks blury the battery dosent last long don't be cheap people if you want a good quality tablet but cheap go between 100-130 yoy need to pay good to get good"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "It's good for kid to play. It's sometime for adult.\nits good price."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "This tablet is amazing !!!! And the pice is Just as amazing !!!! Thank you so much !"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "I bought two of these tablets so that i could have bare bones android devcies to use for field market research surveys around the world. The devices arrived ahead of time and are functioning well so far.\n\nPRO: This is a great value for the cost... it doesn't seem as nice as a $300 tablet... more like a $150 tablet... but for this price it's really a steal.\nPRO: No bloatware as far as i can detect. This was really important to me. I had anticipated spending a day stripping out pre-loaded apps. The device is simply Kit Kat with standard Google apps (Chrome, Youtube, Gmail, etc).\nCON: It feels a little slow for a quad core processor, but it should be more than fast enough for global field research.\n\nI will update this review after spending two weeks in the field with these devices..."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I LOVE IT ...IT IS EVERYTHING I WAS HOPING. THE ONLY THING IS ...I THOUGHT I WAS GETTING A NEW ONE. THE ONE I RECIEVED MUST HAVE BEEN A USED ONE....THERE ARE SCRATCHES ON THE SURFACE OF THE SCREEN."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Just got my new NeuTab N7 Pro tablet. Happy with it so far. I have an ipad 2, but wanted smaller tablet to carry in my purse. The reviews on this one are great, and am happy with it so far. Love the smaller size!"}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "Decent little tablet.  Video playback is excellent.  Processor is pretty fast for a $50 tablet.  I'm still finding new uses for it."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Bought for my 8yr old son and it's a perfect starter tablet!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Very happy with my new table"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Very compact but perfect as an adjunct to a full size computer"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Its one of the best tablets I've ever bought hands down"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "My grandson loves his gift!"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "We ordered and received it in a timely fashion. Fair pricing, wasn't exactly what we had expected but it works exactly for what we need it for."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Love it!! Great tablet for my son."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Super service - works like a $300.00 model."}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "Worked OK slow while connected to Wi-Fi glitched out a lot. Not a study build dropped it from about waist high on to a carpeted floor and that was the end of that. "}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "I purchased this tablet on 15 June 2015 for my 4 year old son's birthday. In using the tablet we noticed it moved at a snails pace - slow and 9 out of 10 times it does not respond to your input, I'd touch the icon to go to the full listing of apps and it would never open. I disregarded and thought it was just a glitch for that day, however it continued. Every app we download would work fine on my other android device, but when we click to open the app on this tablet, it crashes! Poor kid is frustrated by this tablet! Further to this, in August which is 2 months after purchase, the tablet's resolution is fading, now we can't use the apps I've downloaded to the tablet due to the fact that we can't see anything as the colors have faded off, can't see where to click.\nThis is the worse purchase I've ever made on Amazon! I would never recommend this product to anyone!\nNow my son has no tablet!"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "I bought this for my youngest son for his birthday. It started out as a pretty decent tablet but in less that two months the power button has stopped working. Still waiting to hear back from NeuTab support. Apparently the only way to get in touch with them is via email. I will update if things get resolved. Otherwise just find something better.\n\nUpdate: Contacted by tech support and sent me a prepaid shipping label to return the tablet. They are going to replace the unit for free."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "This tablet is very fast and also is made good great tablet for the price ."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Works well, easy to use, small and compact for easy travel. Fantastic price!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Fast timely screen . I really like the camera and Bluetooth connections .very fast delivery overall 10 ! Get u one!"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Bought as gift for my wife, she is very happy with it.  Product is as represented in reviews"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "This is a cute little tablet that does everything I need. Worth the price!"}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "Not accurate product info not exact hardware as mentioned"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Got this tablet for my children to play Minecraft on.  Really nice for the price!  My children think it is a i-Pad and they have stopped begging for my phone."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great options and features for a great price."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great product for price!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Mom loves it!  Very easy for her to use"}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "Battery life is very, very short. Tried getting onto the internet with my wifi and still cannot. I regress...I was able to get onto Yahoo for a little while ONCE yesterday."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Its cheap and poorly made. You get exactly what you pay for."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great product at a great price. Will definitely be using their products again."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "love it great price :)"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "great product for all my photography stuff, has plenty of room for all my photos and it's easy to carry instead of a portfolio!!!"}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "Tablet works fine. Battery time while in use is terrible. 30 minutes of continuouse use uses between 40 to 60 percent of battery. Stand by battery time, 8 hrs. Unplugged uses bout 1/2 of battery on full charge"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great product..thanks..my mom loves it"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "We have kindles, android tablets and ipads in our house and the NueTab N7 Pro is just as good for a fraction of the price! We are very pleased with this product and would recommend it anybody looking for a tablet!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I received my tablet today and I'm impressed with the quality. I'd say 5 stars because of how good it is for the price. The battery life is much better than I expected. Lasting over 4 hours before being to be plugged in. Very satisfied."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I love the size and will use at school because it's got WIFI"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Perfect for my 8 year old! He loves his new tablet.  Very reasonable too"}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "It wasn't what i was hoping for but i will blame myself for not knowing what specs were needed to play the mobile games i wanted, its great for 2D games but 3D games crash or lag horrifically"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Works great and shipping didn't take long at all."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Fast loading!"}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "I bought this for my granddaughter who is fascinated with electronics. The only problem I found is if she continually used it the battery only last about to hours."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Works as well as the more expensive tablets.  NOTE: It does come with a screen shield, so you can skip buying extras for now.  There's also an offer to get a cover, so you may want to hold off there, too."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "A+++++ tablet."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "it gets the job done!"}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "After owning a few android tablets and thought they were all pretty much the same I thought I would purchase one saving some money. This one was not worth any amount of money. I could not get this one to do anything. I would suggest you spend a little more money on one that works. Then after returning it I couldn't get my full purchase price refunded. What a mistake this purchase was."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "This works perfect for my son to download music and use on his electric drum set, he loves it. Great product"}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "It's okay a little slower then expected for the reviews an the wireless capability of the device slower than expected and have had trouble with it connecting 2 regular Google so overall for the money it meets the standards but I would not recommend this tablet"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "very good tablet,great camera,very light,and battery lasts.thanx"}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "NeuTab is so-so tablet.  The picture is not so good when it tilts.  Camera is also so-so.  But I am learning the android OS.  Guess it is so cheap to purchase but it is my beginning of understanding the Android OS."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I am very pleased with my new tablet."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Doesnt even work right, keeps shutting off, picture is horrible"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great product at a great price!"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Not a bad tablet for the price . only got it for using netflix and using the internet and it definitely serves its purpose."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Solid little tablet. Got it for my kid and she loves it. She can use Netflix and play games."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Ok, so, the primary reason I wanted a tablet was so I could write on a more portable platform than a laptop, so I got a bluetooth keyboard and tried using it with my android phone (an LG of some sort).  That didn't work out, so I ordered two of these (my wife wanted one, too).\n\nShe's using hers largely as a portable game machine, with facebook and the other stuff you usually do.  She doesn't need much, and she's quite content with how this tablet performs.\n\nMine is now taking over numerous functions from my phone, both freeing my phone to be useful in other ways and also preventing me from using facebook as much as I used to.  As for writing, well, I'm typing this out on one of these NeuTabs with my bluetooth keyboard, so it's obviously working fine for that.\n\nSo here's the pros and cons that I've identified so far:\n\nPro:\n* It does what I want it to do.\n* It's small enough to be quite portable while providing a large enough screen to be useful.\n* It runs everything I've tried in the Google Play store.\n* It totaly destroys the kindle fire it replaced (it already did with the bluetooth, but what was Amazon thinking when they made their own store?)\n\nCons\n* Screen accuracy seems to be a bit of a probem.  It's a minor nuisance, and it may be fixed with a calibration procedure I haven't yet found.\n* When you tap to put a cursor down, like in a url bar or web form field, you can't slide the cursor to get it where you need it.  This could be a problem with the screen accuracy already mentioned and therefore might be fixed if I can figure out how to calibrate the screen.\n* It runs slow at times, which is actually quite reasonable for a $50 tablet.  If you want high performance, this tablet isn't it, and you already know that.\n* This isn't really about this tablet, it's Android in general: I hate the nanny media volume thing.  I hardly ever use headphones, but when using this tablet as my alarm clock, I plug it into a set of computer speakers.  By morning, the tablet has decided I'm going deaf and turns down the volume.  Obviously not a good idea when it's supposed to be a loud alarm clock.  But I mention it as a con because it is something NeuTab can address.\n\nOverall, this tablet has improved my quality of life, and for that, I give it the full 5 stars.  It's exactly what I expected out of a $50 tablet."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "No kidding almost new, No Lie here. I am very satisfied with my purchase. Arrived today Sept. 12 2015. Was on it adding internet , downloading games, adding Netflix, playing games, with the charge it arrived fully charged. I give it 4 stars cause no case cover."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "This product is amazingly beautiful, it exceeded my expectations and for the price, i think it was a great buy!"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "I am pretty sure that my 1988 128K apple macintosh (back in the day that is what they were called) was way faster than this thing!  Screen res is horrible.  Took me 20 minutes to try and order something else from Amazon, finally gave up and used my phone instead.  Pitiful!  If the Chinese are going to sell us garbage then I say send the junk products back and let Amazon figure out that it's not worth their time buying the worthless stuff in the first place.<a data-hook=\"product-link-linked\" class=\"a-link-normal\" href=\"/NeuTab-174-N7-Pro-7-Quad-Core-Google-Android-4-4-KitKat-Tablet-PC-1024X600-Display-Bluetooth-HD-Dual-Camera-Google-Play-Pre-loaded-3D-Game-Supported-2015-Updated-with-Bluetooth/dp/B00N369KKY/ref=cm_cr_arp_d_rvw_txt?ie=UTF8\">NeuTab&#174; N7 Pro 7'' Quad Core Google Android 4.4 KitKat Tablet PC, 1024X600 Display, Bluetooth, HD Dual Camera, Google Play Pre-loaded, 3D-Game Supported (2015 Updated with Bluetooth)</a>"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Nice tablet for the price. Works well, Worth the money."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Have had the tablet a week now.  Great price.  Everything you would expect for an inexpensive unit.  Not very \"sturdy\", the plastic case is thin and it creaks.  Also the lens cover on the rear camera fell off the second day I had the tablet.  It's attached with sticky adhesive similar to scotch-tape; I just stuck it back on the camera.  The overall performance is occasionally a little glitchy and slow, by generally fine. The photos/movies it produces are a bit grainy.  But the unit is exactly what I expected for a low price point item. I'm not a gamer, and I'll use the tablet mostly for travel so if it holds up it'll be great for my limited use."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "Great starter tablet. Wanted something to take on vacation to play games with grandkids. Worked great."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Recently purchased this product for my child. It was easy to navigate and set up."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great tablet for my needs!!!  Thank you!!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "i my self thought it was good"}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "Its slow when uploading games an kicks you out after you start playing."}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "This I bought yesterday and returning today. I tested for the battery back up, it did not withstand for even 90 minutes continuously. This was not expected. I understand the price was competitive and at this price I cant expect more, but if cant watch media for 90 minutes at a stretch what is the use of this tablet. In specifications it mentioned 6 hrs battery backup, I expect atleast 3 hrs\n sorry NeuTab, you disappointed me"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Its a nice product.  Seems well designed and user friendly.  I'm hoping its quicker than my older Nexus device."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Buyer beware.  It doesn't work for all music apps.  I have a Groove (same as xbox) music subscription and it will not stream the music because it isn't supported on this tablet.  Which is the only reason I bought it."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "love this tablet, the picture is crisp and clear. it takes awesome pictures, and can download multiple games. i am buying for my grandchildren.never received my free protective case. order id number is 103-0176225-2877037. i ordered 2 tablets on the order id number."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great value @ reasonable price"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Awesome product for the price, only issue is the lighting could be brighter"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "It's really good for 4 years old kid. He loved it so much. Good gift my kid."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great tablet!"}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "Although advertised with the quad core CPU, it has difficulty running more then one app at a time e.g. the audio on one app stops when I switch to another app.  My old Motorola Xoom far outperforms the Neutab.  The screen almost impossible to see in bright light.  However, it is a good value for the price, and given the above limitations, I would recommend it."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Exactly what a need. it fits in my hand nicely. A simple android device and you cant beat the price. I'll probably order a few more when I ramp up on my android development."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Bought this for my son, he's had it less than two months and it stopped working. it won't charge or turn on :-("}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "it work perfect"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "This is perfect for a child!"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Worth every penny. Work well no problems. Great for teen"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Ok, especially considering the price. I bought it for possible use as a display built in to a commercial product, but the screen is so dim, I could barely tell that it is ON in daylight. But OK for viewing inside in a darkened room. Just wish the backlight could be made brighter. Almost no instructions. Still have to find out what the USB port capabilities are.... hopefully someone online knows."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "This handy little tablet is sleek looking, and switches screens fast. Easy to access buttons for on/off and volume make adjustments fast. Comes with a screen protector and charger/USB."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Good for it's price, and I use it to great effect, however it's multitasking capabilities are sorely overrated. As someone who loves listening to music, I expect the tablet to be able to play music while I use apps, however for the price of $50, I am fully satisfied with what I have bought."}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "I purchased this for my mother, who has MS and has a difficult time with fine motor skills. She was becoming frustrated with trying to text on her outdated cell phone, and I thought a tablet would suit her far better. I was excited to get this and surprise her with it, but upon attempting to set it up I found that the OS was sluggish, seemingly outdated (for what I'm accustomed  to, I personally use apple products), and the product was not at all user friendly. I returned this item and ultimately chose the Kindle Fire HD, which met her needs much better and she is enjoying very much."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "It's a nice tablet for my son.  He likes it.  Easy for him to use."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "I bought the tablet to play games on during down time between classes. It seems to work quite well so far. Keeps me entertained like it's supposed to!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Very nice tablet, love it!"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Very nice and functional"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I needed an inexpensive android tablet and this didn't disappoint!  Works great and was exactly what I needed."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "Very slow product, definitely a very cheaply made device. My mother purchased a tablet from walmart for the same price and it is 100% better than this one.\n\nCant have more than 2-3 apps open at once, battery life sucks even if its in sleep mode"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I thought that it would take forever to come but it came exactly when it was supposed too and works very well"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "The Neutab was an excellent gift for my mother-in-law. She loves it and uses it all the time."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "It totally stopped working after a couple of weeks. A total waste of money."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "3 of these were purchased for my kids. After two\ndays, one wouldn't charge. 2 months later a second one had the same problem. I am not happy."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "Solid tablet, but a little slower than I would have expected. Can get the job done on smaller tasks, but multitasking is a tall order. Happy for what I got with the price."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "it works great and it has less problems my old tablet had"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "You get what you pay for. Got this for my wife because her 2nd kindle wouldn't charge after having it for a year and a half. After purchasing this I decided to get her kindle fixed. Should have done that right from the start. could have saved $50."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "Having problems getting online but once I figure things out I like the size and ability to carry around easily."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "i love this tablet have some much space i download like 5 games and it just right in size i love the features and the color is just right i will buy my whole family one for the price im like wow i thriught it was going to be all cheap but know its nice.."}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "This is not a 7\" tablet. The box it came in measure 8\" long but the tablet itself can't be over a 4\"x6\" tablet. It is not much bigger than a cell phone. I can not say how t worked as a tablet. I didn't even take it out of the box. When I saw the size of it I just closed back the box. I am returning this."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "It's not that good, but it is what we can expect from a 50 dollars tablet"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Responsible salesman, recommended 100%"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Ordered two of these for my two boys. so far, they are happy with the product. It is reasonably priced and easy to browse."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Got my tablet....amazon u get to dwn:))"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Perfect"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "The NeuTab was everything that I had hoped for.  It does all of my work that is needed and allows my husband to play games without interruption."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "I was happy with the ease of use."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Exilent!  My Son have  this one, now my husband and I  want one, thank you"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great tablet fast no problem's on set up"}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "Having trouble keeping the games playing. Not sure what is going on so for now i am rating it ok."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I love the size, very thin. Boots up quickly. Best of all the price is great!"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Its ok you get what you paid for.  It feels cheap but its really loud  at  least.  Its slow and screen is dim on corners if you tilt it.  I only use it for  Netflix for  my 4 year old  and a few educational games.\n\nEdit:  one month of usage and the  tablet fritzed out and  will not power back on!  Highly infuriating.  I plan on spending the extra money on a nicer next time!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "it is a great tablet"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Very easy to use. The size is perfect. An awesome gift for a reasonable price. Great screen display."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Works great so far"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Nice tablet.... maybe need add flash to camera"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I like it so much I bought one more!"}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "An all right tablet for the price I paid. I think they just need to be handled carefully.  I ordered 2 for my children, ages 4 and 7.  At the moment, they are using it to play games, predominantly Minecraft.  I actually had to return the first 2 because one stopped charging after 2 days of use and the other just stopped working after 3 weeks.  Amazon has an awesome return policy.  I shipped them back and the replacements arrived quickly.  So far, both tablets are working well.  I had to reset one to the factory settings because the Google Play Store wasn't loading.  After the reset, the tablet has been working fine."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "I have had this tablet for a few days now and think it is a great deal for the price. I mainly got it to put books on for school and it works great for that. I have also watched a couple shows. My only complaint is that the calibration of the touch screen is slightly off.  Pairs with Bluetooth and wifi just fine."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "This device is 7 inches, not the screen.  I should have payed closer attention.  The screen is impossible to view unless viewed from straight on.  The screen SUUUUUUCKS.  I have a hard time seeing it, even when straight on.  So far it is FAST.  It took all my usual apps and Go Launcher without a problem.  The camera is terrible, but you should have suspected that.  When I put the SD card in, it recognized it immediately and I was able to access it immediately.  So far, I haven't been able to get it to screen mirror.  All in all, I'm pretty impressed for $50, but the screen is my main complaint."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Good little tablet.  Great value for the money."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I purchased 2 tablets and I am very pleased with the quality"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "The best tablet I have purchased yet. All my RCA's broke after about 3 months, and that was the good ones."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "For such a little thing I can still see it, with my glasses of course."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Bought it for my 14 year old for school and he loves it."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I ordered this tablet for my nephew. Great tablet for the price. Perfect for a child to play games and watch movies on!"}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "its okay tends to lag a bit"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Really nice and very cheap product, perfect for emailing, watching TV, and all the things you need to do on your tablet"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I got this for my son and he absolutely loves it, it came packaged appropriately and brand new and arrived at a good time. Not too big but a decent size. Seems durable. Downloads good, works great with wifi, he says it has plenty of space for him to download music and games. He loves it!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "as advertised, easy transaction, would buy again"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "This is the worst tablet. It freezes and shuts down more than it works. The longer I have it, the worse it gets. I keep having to hard shut down. And even when I boot it back up, it still acts up. I have to bang on it to get it to move a little bit . I would NOT suggest this thing to anyone. Yeah, I know, people will say \"what do you expect for $50?\"...I expect it to work more than it freezes and shuts off...that's what I expect. If I could give this tablet a Zero, I would"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Nice deal. Working fine."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "cant beat the price $50 love that\nthe camera sucks worse then horrible, they shouldnt even bother putting one on it, its that bad\nbattery is ok and actually charges back up quite fast (so that's great)\nscreen doesnt appear to get that bright either,even on its highest setting\n\ncame with a screen protector which wasn't mentioned in the add,,which would have been nice if they said\nthat, because add said people who bought this also bought...and then showed the screen protectors which\nI wanted and bought and paid extra for cause everyone else was doing it and then low and behold came with\none anyways so I made an extra purchase that I didn't need too!!"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "This unit has good audio quality compared to another unit purchased at a similar price.  The screen is responsive and Android 4.4 is a great + for the money.  Time will tell how this holds up but so far so good."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I bought this for my 7 year old granddaughter and she loves it.  It is easy to use and very durable."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Got this for our grandson. He is thrilled with it. This is a great, affordable gift that is a big hit."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "The products fitted my grandchildren needs"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Bought this as a birthday gift for my grandson and he loves it! My daughter said it is sturdy and he was able to download the games he like to play including a texting app so now he and I can text!! She says the built in economical WiFi makes for a definite plus!! Now I have been told my granddaughter wants one just like it for her birthday in November!!!"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "this tablet sucks. the screen is blurry and it cuts off in the middle of application its horrible and i hate that i spent any money on it. I would only accept it if it where a gift. it has even been a month and i already had to take it to repair shop because it will not come on."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "We bought the NeuTab N7 Pro 7'' Quad-Core Tablet for the basic stuff as well as for a very small child, videos and games.  On the first charge, I got through just one day of use before needing to charge up again. Perhaps there are battery saving things I can do to make this better.  The bottom line is that at this budget price, I didn't expect a lot but I got soooo much. Like the option of using a micro SDHC card but we haven't gone there yet. Nice to know we can though. Everything works just fine and we have no complaints at all.\n\nWe received all the basic accessories, manual, charging cable, screen protector USB cable, and USB wall adapter."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I just got my little tablet and I must say I really enjoy it. I first had an iPad 4, then an Nexus 7, and this one is the perfect size for me. It fits well in my hand and is very responsive; everything is operating without a hitch. I can see myself having years of enjoyment and a happy wallet."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "I purchased this model for $50 rather than the $120 that it originally retailed for. I think had the price been higher my review would be lower.\n\nFirst off this is a very light tablet. I would be very concerned if I dropped it, the plastic case seems like it would shatter instantly upon impact. This can be a bonus as its small enough to fit in my back pocket without me noticing it, but on the other hand if I sat down with it still in my pocket I'm certain I'd break it. Just keep in mind that it is a very light (and presumably flimsy) tablet. This is exactly what you'd expect for a $50 tablet, however.\n\nThe screen does not perform well outdoors. Even at maximum brightness you can't see anything on the screen when outdoors. To me this is not a problem since it doesn't have any type of cell connection so I planned to use it almost exclusively indoors. Just make sure you don't have any sources of light shining directly on the screen.\n\nThe unit comes with a pretty good processor (for the price) but with only 512mb of RAM. This is the only truly negative factor with the tablet; you really have to make sure as few processes as possible are running in the background otherwise you will have some serious stability issues. A few apps crashed as I was downloading multiple updates. Had this been a more expensive tablet I might want to expect a little more.\n\nAs I said in the beginning its a pretty good tablet for the price. The one thing I would say is don't' expect to be able to play many games. A few games work but the low RAM will prevent several games from even booting up.\n\nAs far as the software itself, there is one issue that led me to return the tablet eventually. For some reason I was unable to update several Google apps on the tablet, including the \"Google App for Android\" app. This became a problem as the google search function was completely broken. I could search the web with Chrome but not with the Google App. Every time I attempted to update the app in the Google Play Store I received an error saying that the package was not properly signed and that I needed to uninstall and re-install the app. However, the Google App cannot be uninstalled on this device (this is not true on all Android devices and must presumably be particular to the install of Android 4.4 that NueTab puts on these tablets). I contacted NeuTab's customer support about this issue but received zero response. Had this been from a major manufacturer (Dell or Samsung, for example) I would probably give this fewer stars, but given the price I kind of expected as much. After much experimentation the only option left to me was to root the device and install a fresh version of Kitkat.\n\nIn the end I returned the tablet because if I'm going to be rooting a tablet I'd rather spend the same amount of money for a used tablet with higher system specifications, which I did.\n\nIn all, it was a decent tablet for the money, and I only returned the tablet for the reason above. Instead I ordered a used Dell Venue 7 tablet which has more storage and higher RAM (although sadly a slower processor) than this model, but is used.\n\nIf you're looking for a cheap tablet that will run email (although sadly not Google Inbox, for some reason) and web browsing, a few word processing applications and some games for $50 or less than I would recommend this tablet (presuming they fix the issue with the Google Search function). Just keep in mind that, due to its low price, you get what you pay for."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I think it's a great product. Love how it comes with free tech support. I wouldn't change this product"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Good tablet for the price."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "just unboxed this produce. looking great"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "awesome tablets, good for kids and adult!"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "This product stinks. Not even able.to download adobe flash player even going thru ngeeks.com. doesnt show on tablet and the online textbooks won't work without the flash player. Even spent money on an app for flashplayer access still kothing. As cheap a tablet as price. Went from originally giving four stars to 1 waste of money!!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I LOVE IT IS VERY RESPONSIVE NICE AND CLEAR,FAST, A LOT OF APPS COULD USE A BETTER CAMERA BUT I DID NOT BUY IT FOR THAT, IT WILL DO I WILL TELL MY FRIENDS TO BUY IT THANK YOU."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "great product for price"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I order my new tablet from Amazon.com Friday evening, Saturday morning before 10:00 am I had my\nnew Neu Tab N7 Pro 7\" Quad Core Google Android. Packed with all the accessories and ready to go.\nI also received a gifted to which I can not wait to redeem. Thank you Amazon.com"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "I bought this as a gift for my dad, who has never used a tablet before.  The price is definitely right.  The storage is good for the price, and is easily upgraded with an SD card.  The tablet came with a charger and a screen protector.  Before we could get that on, the screen got scratched.  That was ridiculous.  So put your screen guard on first thing, because it scratched really easily from some sand on the table.  The camera is weak, but for $50, I wasn't expecting the best in the world.  I was sad that there wasn't a flash on it.  So far, he's enjoying the tablet and I'm enjoying him learning about newer technologies.  Thanks!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "perfect"}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "This tablet is very slow, a waste of money."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I bought this for my husband so he doesn't have to look everything up on his phone, but is still portable... He loves it!  It does everything he needs it to do for his sales job.  Thank you."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "me ha funcionado bien"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Got one of these for my father. He loves it light weigh and simple interface. The tablet does everything he needs it to do well which is watch movies, check email, and listen to his music. The only knock he has on it is the speakers aren't that loud but that's not a big deal as he hooks it up to an external speaker."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Very practical and innovative. Perfect size and performance. Exellent Item!"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "This was a complete waste of money.  I purchased this strictly for us to have a second tablet to use for looking things up while we're in our living room/kitchen area where there is no computer.  This is the Yugo of tablets.\n\nFirst, the screen on this tablet is weird-I don't know if it's because I used the screen protector that came in the package, but you have to hold it just right or the picture looks distorted-it has an odd effect that reminds me of those old baseball cards that you can turn at a different angle and it looks like the player is moving.\n\nThe place where you plug in the charger is not made very well--when I went to plug it in the first couple of times I thought they gave me the wrong charger because it was so hard to connect the two.  The plastic around the plug was not evenly cut which seems to have been what caused the fitting difficulty.\n\nThe battery life is probably the worst thing about it, though.  I have only had this thing for a couple of weeks and don't use it that often [because the screen] and the battery drains crazy fast.  For example, I charged it yesterday [because it went from 73% to 2% overnight while turned off] & I watched the battery life drain by 3% as I went to facebook and looked at the news on the visible screen--I didn't even scroll down.  I lost a percentage point clicking from the home screen to facebook, then another percentage point once I got there and a third when I clicked back to home.  And I don't have a lot of apps running in the background, either, I checked.  It's a bit nerve-wracking trying to browse the internet while simultaneously watching the life drain out of your device with literally every click.\n\nIf I had it to do over again, I'd get another brand--although this seems inexpensive by itself [minus the case], it's actually pretty expensive for something that fails at what it's meant to do.  Even though I only wanted it to use for web browsing, it is sadly not up to that simple task.  I don't understand how this has good reviews from people who use it for gaming unless they have it plugged in the whole time because it seems like that would drain the battery way faster than internet browsing."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Got it today and my son hasn't put it down. He loves it and even taking selfies smh lol. Love it"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Works really well, a lot better than the nextbook I bought earlier in the summer."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "I just got it today and so far I really like it :) it's easy and fun to use!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Terrific for the price"}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "This was an okay product but just a few months after it broke on me. I am disappointed with this product"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Having never heard of this company, I took a chance and bought this tablet based on it's good reviews here on Amazon and it's great price. I am very glad that I took the chance because I really like this tablet. It works great and looks great. My grand-kids are all fighting over who gets to play with it. I have another tablet of my own so now I actually get to use it when they are here. It took me all of a minute or two to set it up and it was streaming Netflix.  For it's price range it is exceptional and has everything that you could want in a basic tablet. I was so impressed that I actually went ahead and bought the larger tablet -&nbsp;<a data-hook=\"product-link-linked\" class=\"a-link-normal\" href=\"/NeuTab-N10-Plus-10-1-Inch-Octa-Core-Tablet-PC-Google-Android-5-1-Lollipop-System-1GB-RAM-16GB-Nand-Flash-Bluetooth-4-0-HD-Dual-Camera-HDMI-Output-Google-Play-Pre-installed-3D-Game-Supported-Slim-Design-Black-Back-to-School-Limited-Time-Offer/dp/B00ZB5T65O/ref=cm_cr_arp_d_rvw_txt?ie=UTF8\">NeuTab N10 Plus 10.1 Inch Octa Core Tablet PC Google Android 5.1 Lollipop System 1GB RAM 16GB Nand Flash Bluetooth 4.0 HD Dual Camera HDMI Output Google Play Pre-installed 3D Game Supported Slim Design Black (Back to School Limited Time Offer)</a>.  I just received it today so haven't had a chance to open it yet, but am expecting the same quality as the 7 inch tablet. I also bought a blue tooth speaker to go with it. I am very happy with my purchase and think that you will be too."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great Deal great product"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Specs are great just over heats and the screen isn't that good"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Lasted only two months. You have to press hard or multiple times for the touch screen to work. It was very slow. The reason why I bought it was because it was cheap and durable. Turns out it was cheap and weak. I dropped it on carpet, shattered. It was cheap, but for $60 I expected to get something durable at lease."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "This is a great tablet for the price. My kids love it."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Excellent product! Great price. Well packaged, and shipped quick! The resolution of the screen is fine for watching movies, tv. I bought it to use with DSLR Controller and my Canon SL1. Works great. Having Wi-Fi AND Bluetooth is a plus. As is the capacity to add 32gb on a micro-SD card. Tab is fast and responsive. It is NOT an Ipad, didn't need it to be. This meets my needs at a great price."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "OK,but not durable"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "We got it for our sons. They just it today and it works great. They able to play all their games and more. Got to buy another one soon for the don't fight over it. But I'm happy I finally get my own tablet back."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Was totally please with this product .The instruction was easy to understand and quick. It has all I wanted and more. The price was the best around."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Bought this for our 7 year old and she loves it!  Easy for her to get around and very user friendly."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Love it"}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "Don't liked"}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "Nice tablet it's ok its not as good as those expensive tablets but it does the job for those basic things.."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "very nice tablet, works well, very happy with it."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "I haven't used it yet, so I'm rating it in the middle. Upside--I am a teacher, and I am looking for inexpensive tools to give to students for Web-based learning.  Downside--Wow, it feels like a weak case. (That's one reason I'm filling out a review--to get the free protective case!). I am a Mac user, and I'm accustomed to iPads, but for web-based learning this machine should be adequate."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "great tablet!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I ordered this product to use with my GoPro cameras and preview the video I'm recording.  It works great for this purpose and is an excellent deal!  I recommend this product to anyone looking for an inexpensive tablet to surf the web, stream video, email and other day to day activities."}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "(Will Update this review once second tablet has been delivered)\n\nI am now on my second tablet. The first one arrived well packaged and all looked good until I started using it. The headphone jack would not work and the screen started splitting the red and greens when streaming Netflix, Hulu etc. Also a green bar appeared on the bottom of the screen while streaming videos.\n\nAmazon customer service is amazing and had already shipped a replacement before I could even get the first one repackaged! Kudos to Amazon and lets hope the replacement works as it should."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "iuy"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "It's great, my son loves it. I'm giving it 4 stars because it has less storage space. More space will be wonderful. That aside, it's a great tablet for my kids!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I like this so much. It has screen recording so you can make videos"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "It was necessary to return this product to NeuTab.  It would not charge and I could not use it. I sent it back and NeuTab provided a label so I could ship free. I received a repaired tablet instead of a replacement.  So far, it seems to be working just fine.  I purchased this for my granddaughter for a birthday present. It was a bit disappointing to have to return it and wait for a replacement. I am finding it difficult to use because the typeface is so small that even with reading glasses it is hard to read. When reading a book and expanding the type, the full page is not visible.  It is not for me, but my granddaughter likes it.  So far it seems to be charging and holding a charge."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Was broke"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Really like this product I would recommend it to any one"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I love this little lightweight tablet. It does everything I need it to do. It's wonderful and very affordable!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great product and shipping"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Worked right out of the box...my son was very happy."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Bought this tablet for an 8 yr olds birthday present. He loves it!! Easy to use and set up. Would definitely buy again. Great price and shipped fast."}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "I understand that this is the cheap, low end tablet and reviewing speed and display quality would not make any sense. However the speaker on this device is terrible, not strong enough and not clear. For my courtesy I have tried phone headphones and the sound was as it was supposed to be. Watching video or listening to music on this device is so unpleasant irregardless is it HD quality or not. My desire was to give my mom a simple device to listen to music and watch videos. Now, I feel that I have wasted my money and if I haven't threw away the box I would definitely return this device back."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Awesome tablet! For the price it is a must have!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Excellent, I love it! Congrats for your service"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Just received this tablet today and I'm impressed.  It's fast and accurate . I bought this for my dad and he couldn't believe it was priced for 50$ ."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "I bought this tablet for my daughter to play simple games, but the WiFi took hours to find our router. It only connected to our WiFi for a about 2 weeks and stopped recognizing the signal.  The screen hurts my eyes and is not as clear as our Kindle.  I should have just saved a little more and got a Kindle Fire.  If you work as hard as I do for my money, wait and get a better brand.  I only found a contact for the brand website and no troubleshooting page.  I am still waiting for a response from the company as how to fix this issue."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Fairly priced. Tablet was received quickly and it has been useful to me for reading newspapers online and visiting other sites.  I still have to test its camera."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "it is a very good tablet i like it very much"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "This tab has connecting issues and no number for customer service...I promptly returned it."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Do not purchase this item! Not worth the cost!  Have had the item for 30 days and already the screen has a green line through the bottom portion of the screen which is bothersom when trying to watch a movie."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great item for the price. Easy to navigate and use. Pocket size tablet. It's not a razzle dazzle item, so if you're looking for all the bells and whistles, remember what you're paying for: a basic tablet for basic needs."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "get your bang for your buck, it's the best cheap tablet on the market"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "the battery life is short, it was delivered late by 2 days, the power button is stuck so i can no longer turn it on, it fell off my couch ( family member fault) but screen broke..."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Absolutely perfect for what I needed.  Easy to use. Great display.  Good product."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Piece of crap slow"}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "It lags sometimes but other than that its good with apps, web surfing and Netflix  for a starter tablet."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Just received this evening and so far very pleased and surprised for the price of how well it works!"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "i like it very much but its headphone jack does not work to well with my headphone but other then that its great a lot of apps for it and movies are great on it"}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "Its pretty slow most of the time and feels cheap. Unless you remember to exit out of all the apps (hard task for people who have never owned much technology) then it will not charge. It not bad for someone's first tablet but I wouldnt buy it again."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Nice tablet for a starter tablet.  Only issues we have had so far is a couple of game apps that don't work well with it. Juice Cubes and Farm Heroes Saga."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "It's great. It's easy to use.  Good product for price."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "great item! bought for my nephew to be able to play his games through the app store and it works great! have had it for about a month with no issues! great buy for the price!"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "This is a good tablet, however it has its issues. Some of which include limited viewing angles, short battery life,screen lag when plugged in,and quiet speakers.. Other than those things the speed is good and fully featured. This tablet is perfect for a casual user on a budget, but if you want to get a lot of work done I would spend a little more money on a better tablet."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "It is ok"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "its ok for the price sometimes it stops or i have to tap 2 or 3 times but still pretty good nice picture i like it"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Exactly what I wanted."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I love the tablet it works great can't go wrong with it"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Just as described. Works great."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Easy to set up. A good basic tablet for someone who doesn't need anything fancy; easy to understand."}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "Poor quality screen with very short battery life. (a couple of hours if your lucky)  Good speed and adequate storage but NOT a good choice for video or gaming."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "So far so good.  The detail of the pictures are really good."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Good 1 propose tablet or Ereaeder"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Two attempts to get a working tablet!  Quality Control is terrible.  The first worked for a few days, after charging unable to restart, just blank screen.  The replacement came and worked overnight, but while setting up email it started flashing and crackling especially when I touched any hard control such as the power button or volume.  Will be getting refund.  Do Not Buy This!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I love it very much. It runs really fast, camera is good for a tablet. love thats its easy to hold and carry around with you. and for a tablet its really loud when u play music and stuff"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Got this tablet for $50 on Amazon. This is a good starter tablet. Battery life is decent. The AC cord buzzes when it's plugged in (w/or w/o the tablet connected to charge it). Overall happy with it."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "There nice tablets"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Awesome tablet. Very responsive. No lagging playing games or streaming videos.  Good resolution while viewing straight on. I liked it so much I ordered a second one for my daughter."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I love my tablet"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Just got my new tablet.  So far it's just what I was looking for."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "If you took this tablet into the commode with you, not only would the battery die before you were finished, your fecal matter would be both better looking and of higher quality material.\n\nAs for other reviewers saying this tablet is perfect for a child: yes, if this child happens to have the expectations of an orphan, if they receive a pair of socks on Christmas and a beating on their birthday, they will love it.\n\nAvoid. No stars."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Love it !"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "So far the tablet performs well and I like it."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "This tablet is just the right size. I can drop it into my purse so it's handy when I need it. It keeps its charge for a good amount of time.\nSo far I have found this to be very user friendly and would highly recommend it.  Since it was so inexpensive I really didn't have high\nexpectations but was very pleased."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "After 1 month of use...I am reminded that you get what you pay for in life\n\nIf spending $50 on a Tablet sounds cheap...YOUR RIGHT...Its CHEAP...Poor/low quality graphics"}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "It is ok for $50. Better than doing everything from a phone screen. A few things that I'm not so pleased about - 1) the screen design has uneven lighting so it is hard on your eyes.  2)The battery doesn't last very long. On continued use even with the brightness all the way down you're looking at a few hours for just basic surfing. 3) The AC adapter doesn't make contact properly with the prong inside the tablet, so at first I had to pull the plug out of the receptacle about half way for it to charge, now it doesn't work at all. The only way I can charge it is to use the USB adapter and that requires that I keep a computer on. For these 3 reasons I can't give this tablet more than 3 stars."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "This thing is great, at a great price."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "awesome tablet the best"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "My son loves it! He loves the white. Perfect tablet for a 5 year old!"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Bought this for my dad for fathers day. Read the reviews saying it had a good camera, etc.... it sucks. Wish i hadn't purchased it."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I dropped my Dell venue 7 and cracked the screen. I gave up as the internals were screwed up. I have been lost since I broke it. So I decided to replace it , with a lower cost model. Well this NeuTab  Pro7\" really amazed me! It does everything the Dell did ! It is lightning fast, it has great color and graphics! The directions were well written and not is 23 languages with pictures for steps! A well built little tablet that will surely do everything a much more expensive one does!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I like the tablet, good product.."}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "its too bright, it hurts my eye even if the brightness is at its lowest. the neutab n7 is utterly garbage for 95% of games that i play usually crash 3 minuets after starting the app. this tablet is not design for gaming. It is not the app its self that is causing the crashes i know because i was comparing this junk with my brothers nexus 5, the apps are not a fault. I even went an extra mile and rooted this device to maximize its full potential, yet it still proves to be worthless in the gaming area. ive wasted my time rooting, and my time buying this. I own pre-paid android phones that are cheaper, and does a way better job than this junk. i would had given this tablet a 1 star but because it streams videos pretty good which is the only good thing about this failure of a gaming tablet, i give it a 2 star, only because i can watch a lot of videos without experiencing any problems.\nThe tablet feels cheap, and i found a piece of black hair stuck in between the screen and LED lights that means it isn't removable without completely taking the screen off, which really annoys me and i didn't do it since i might break it. The product also comes with a screen protector but it is not pre-installed for you like most tablets (stupid lazy people). so tough luck for people like me who hands shake and sweat when dealing with delicate operations such as perfectly laying down the screen protector without any air bubbles.\nin the end i'd say this tablet isn't worth the money, go buy a cheap phone you will experience better everything."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Gift for my grandson"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "not worth spending money on this, very little battery life"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Just what I needed. Great price."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "absolutely! love it. price is perfect. handles well. thank you"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Very pleased with this product. I use it basically to just view trail cam pics in the woods.it works great"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Can't beat the price for a nice compact tablet. I was surprised that it worked as well as it does. We just got it a week ago but so far so good!"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "First off I was impressed the tablet came mostly charged along with everything you need to get started. Cables, charger, screen protector and support text information. It has all the features you will probably need and it does have very good display resolution much better than others I looked at. I have it for about a month so far and it's performance and speed is very good. It charges quickly and the battery life is not bad at all. The only exceptions that I experienced are some reboots out of nowhere which have subsided. The other thing, and maybe it's me, it's touch display is very sensitive and the rear of the unit itself is rather lite in respect to durability. I would be careful not to squeeze it too hard or even think of what would happen if dropped. . I do own an apple air and am always concerned about damaging it and/or worse losing it. With the NeuTab that is not a concern. It can fit in your pocket. Overall you can't beat the price for this kind of performance and the included features. It is way less expensive then others."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "If I could be more exact I would say 3.5 out of 5 stars, The tablet itself is a deal for the price the only things I would like for it to improve on would be better resolution on the screen and a better touch screen. But overall very good for the price"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Perfect for what I need , very happy with this tablet. For games and Facebook"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I bought the tablets for my nephews and they LOVE it!!! It is awesome and well worth the price!"}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "Bought this for my son and the battery doesn't even last 2 hours and I charge it to 100%."}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "I un-boxed mine today, and I have to say it looks pretty nice. It's not something amazing but functions fairly well for asking price. The only issue I am having with it is there is no sound coming from the speakers on it. I plugged in some headphones and it worked fine but there is no sound coming from the physical tablet itself. I already spend a good amount of time messing with the sound settings to try and get it to work with multiple restarts to no avail. Would not recommend as it seems there are several others with this problem."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "I just receive my new Neu Tab N7 Pro 7.  For the price, it is okay."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "I brought this tablet for my sister, she likes the size the weight and all she can do with it. She is blind in her right so the HD is a great plus for her. Would buy another one."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Just got it out of the box and works flawlessly. Looks to be a higher quality tablet than the Dell it replace."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I received this tablet at the AADE 2015 conference and love it! This is an excellent tablet that I use for patient and student education. It allows for interactive patient education that is visually appealing and very easy for patients to understand. It also provides a convenient way to order additional diabetes supplies. Thank you!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Works great I would purchase it again."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "I found this tablet to be a cheap and fun ,with basic Android capabilities, although its not the best android tablet out there it is the best out there for the price. I find it to be very good for watching videos on you-tube or Netflix although the viewing angles are lousy at the correct angle it still has hd. thank you for reading my review!!"}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "It scratches way to easily but other then that works good so far."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Arrived on time and packed well.  Tablet performance is better than expected for price paid.  Connected to Wi Fi with no problem and stays connected."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I received a NeuTab N7 Pro 7\" HealthSlate as a result of my registration for a professional conference.  I assumed it would be another cheap and useless take-home product. Not so!  I was extremely and pleasantly surprised by the quality of the NeuTab. In fact, it was the ONLY take-home gift I bothered to take out of my suitcase to show my college-age son.  He, too, was impressed with it.  I'll definitely be using it in both 1:1 and group teaching sessions."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "I was impressed by the positive reviews here and elsewhere, but that was definitely not my experience with this product.\n\nI ordered this for my son who is in the hospital for an extended period so he could watch movies from Amazon, Netflix, etc. instead of just what they have on the hospital TV. The first one we got had a problem with the battery. It wouldn't hold the charge long enough to watch a whole movie. Eventually, it died completely. We got a replacement, and that one never worked at all.\n\nI suggest if you order this tablet you save all the packaging so it may be easily returned if necessary."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I bought cheap stuff before. But this NeuTab can compare to much more $ tablets"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Excellent thanks"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "The tablet served its purposes and that was to have my grandson, age 3, to have his own tablet and not use mine.  What i like about it was that is was fairly easy to set up and get him to play toddler games and learn at the same time. I believe this will help him once he starts pre-k and he loves to learn."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Nice tablet for the money. My 12yr old daughter loves it to death! And it's pink, her favorite color!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great product"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "I bought this tablet for my son's 6th birthday!  He absolutely loves it.  There has not been any issues this far.  It is great for him watching movies or playing his games which is all I wanted.  It is a little heavier than I anticipated but that is minor.  Very pleased with this purchase so far!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Very pleased with the handling of my order."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Excellent.. I loved it, nice resolution and very fast. I bought for my 8 year old and he takes it everywhere."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Pretty awesome tablet came with everything and was better than I expected."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I Love it keeps my four year old busy with learning games he doesn't stop I installed things to teach him to write by tracing the letters and math , puzzles etc. Getting another one in August bought this one in July :)"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "My child have truly enjoyed this tablet!  Small convenient and sleek for my 7yr old!"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Awesome tablet.order was fast and easy to use."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "it ok as a gift but camera is terrible also display is not good but again not bad to giving away to kids"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Great so far!!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "As I reported to NeuTab directly, this tablet is a perfect choice;  size, color, micro chip access, everything!  Waiting on the case but feel it will be a great fit also.  Where was this tablet when I got my first computer a long time ago.  Perfect for Seniors!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "All of you looking for a great tablet for 50 bucks..This Pro 7 is terrific. I look at a lot of them before buying it. I got to tell you its just great."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "So far I love this tablet....can't beat it for the price"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "I like the portability of the tablet and ease of use. The screen is responsive and wonderful display."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great replacement for the Nexus I had.  Great product for the price!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "A great product. Battery life is short, but everything else is great. Very useful for small tasks"}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "At first I was very happy with this tablet. The longer I have it the less it works right. About a week ago it started by not updating my apps. So i rebooted it like many reviews have said to do. Now it is not even recognizing my google account. Great for small apps or games but be careful.\nApril"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "I purchased the neutab 7 tablet for my handicapped son, so he could listen to Sirius XM radio with my online subscription. However, the tablet is not compatible with the Siriusxm app so I ended up going to Walmart and buying a Samsung tablet. Not happy!"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "At $50, there isn't a lot to complain about."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "My kids seem to like the tablet. However cannot seem to find a way for the SD Card to work with the tablet."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Good little machine, runs fast and is responsive. Running minecraft pocket edition with no problems, the rest of the applications I use are not very intensive as they are more just data retrieval. It does run a bit warm to the touch, I do not think the plastic cools as well as the metal cased ones. For the money there was nothing else even close."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I like this tablet it's excellent just what I was looking for, I had a fast Wi-Fi connection and it is very fast nice product"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Bought the for the kids. It works great for them. Good tablet for the price. The battery only lasts a few hours but good for the price."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "This is my first tablet. I am enjoying the product."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Easy setup, easy for my mother-in-law to use. Loved it."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Perfect for my son. He LOVED it and hasn't put it down since it was delivered!!!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "My kid is enjoying on it and It's worthy"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "my grandson loves his new tablet. i love it also screen resolution is outstanding plus you can add  an sd card for more games unlike the last tablet plus the price was right, it worth every penny"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Awesome as Advertised"}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "Okay, I knew what I was getting myself into when I bought a $50 tablet. The reviews I read said it wasn't the greatest, but it's good for the price.\nNow that I have it, I really wish I would have spent the extra. (4 of these don't equal one $200 tablet. No way!)\nIt feels cheap in my hands. All plastic cover, that makes squeaky noises when I handle it. The screen feels like there is always something on it. Not smooth. The colors the screen display look like they're coming from a CRT monitor with a crumby video card.\nWhen tilted from the bottom (not by much) the colors get inverted. Tilt from the top, the colors are relatively the same. Side to side, the colors are fine.\nIn all, it's a wash. If you need a cheap tablet, go for it. If you're looking for something cutting edge or at least current, go somewhere else.\nI'm already having problems with the WiFi cutting in and out, and the programs locking up.\n\nOh, I will say, the packaging for this device is Top Notch! No Joke."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "Nice, cute, fast tablet...however not compatible with UA, LOT Polish, Lufthansa airlines apps and certain games on Google play store unfortunately. Otherwise good buy."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Very cheeply made and you can only do one thing at a time"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "This is a solid little tablet for the price.  I wanted to have a few tablets around my classroom that my students could use for Google Apps, so I bought this one.  It's what you would expect:  not visually stunning (the screens a little shifty with its lighting) or super fast (although the Quad Core does a surprisingly good job), but it does the job.  If you want high end graphics, or serious multi-tasking, this isn't for you...but, for the price point, this is definitely worth the buy."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "It is a very good tablet. I love it."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great tablet! Love it!"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "I sent this tablet Back cos after charging and not turning it on for 4days I had 2 percent battery and I had to hit the apps button multiple times also got no response from manufacture."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Love the tablet came quick n my lil girl loves it"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Awesome product I loved it ! I'm thinking about getting 2 more! Great product recommend it."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Super fast shipping but product came in white instead of black"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "This is a really cheap device. I was hoping to use it as a monitor but wouldn't recommend it for any purpose."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Exactly what I wanted and easy to use.  Love it!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great tablet for the price and my needs!!!"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "I had a Samsung Galaxy Tab 3 that broke, I just wanted an inexpensive tablet that  would do the same things. This does. Did not need to go top of the line for a basic tablet."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Cool little tab! Had to search driver for PC. Once found worked well."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Excellent value.  It's better than I expected. "}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Really great device"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "great tablet for the price."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Fund my tablet very easy to use.  Haven't use to give a solid review"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Easy gaming fun to use\n."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I just don't like the camera."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "I bought the Neu Tab 7 for all the list of features it has noted. I have yet to use some of the features but it looks great overall."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "A good low cost tablet.  It is an excellent tablet for the cost also has Bluetooth capability."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Bought this device for my children. They are very happy with it. They are able to use the play store, play music. etc."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Very Great Tablet for the price love it."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Bought this for the new Great-Grandpa to Skype with and it is great.  He can see his great granddaughter who is 600 miles away any time he wants now."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "very easy to use.....we have several android products and all are fairly similar."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Bought this tablet for my  10 yr old and he loves it! It good quality and has everything he wanted on it. Came with a screen protector that and has 2 options for charging! Would buy another!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I really love this little tablet! I bought it for my 8-year-old son so he could play his games in the car. I didn't want to spend tons of money for something that may get destroyed by my kid, but I wanted something that could handle some of his more sophisticated games. The NeuTab N7 fit the bill. It's at a great price, but the tablet is surprisingly fast and can handle all the apps. It seems to have pretty good battery life too. I am quite happy."}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "You get what you pay for. Not amazing but not bad either."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Loving my new tablet . it matches so well with my portable bluetooth speaker. Nice screen size."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I recieved my product today. very fast shipping. I am pleased with this product and would recommend to anyone looking for a non expensive tablet."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "`am close to 60 trying to keep up with younger people this  is great . just ordered one for my wife she all loves it.got connected to internet AT&TU-VERSE .SO MUCH YOU CAN DO WITH THE tabet i`am enjoy it"}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "Bad screen and it cracked after 2 weeks. It was an okay tablet a bit sluggish even for the price, I've had tablets in the same price range they weren't this bad. I'm going to buy an RCA tablet, it costs about the same and its screen is much better."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I bought 2 of these for my almost 3 year olds - for the price they are awesome! easy to use and get started. Very happy with my purchase and so are they."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Four Stars  - Very good for the price.\nJust got this tablet today & it was fairly easy to set up. Apps run with ease, wish the speaker was better quality.\n For the price, this tablet is better than expected."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "thank you for sending the package with no delay and in good working order. it made a great b day gift."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "Real small. Works so far. Typing makes noise. it heats up fast. Hard to see screen from the glear screen. The touch screen is senative. Hoping it works longer then two years tho what does anymore."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "The only thing that I have found that could make this product better is if there was a way to have a version of Microsoft Office on it!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Easy to use and comes with everything you need, withstands drops and hits, comes with a screen protector as well!!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I just bought The Core4 Quad it is a very nice product for the price. This is a replacement for my Google Nexus 7 that broke when I dropped it, and does what a lot of more expensive tablets do. As other people who have written reviews on this have said, you get what you pay for. Generally I will use it for email and reading e-books only. I will keep this fb free."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "This tablet is great it has quad core processing and a great camera."}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "Battery life very poor, also overheats and apps keep abending."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Not a bad tablet- especially for the price. My only complaints are battery longevity and the way it likes to randomly quit out of the apps that I'm using on a fairly regular basis. But, I only paid $50 for it, so I'm willing to deal with it."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "workable"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Beautiful"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "chose this for the grandkids. They seem to be delighted, it holds lots of games."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "This is the perfect size. Plus its awesome thing to keep my son busy while traveling."}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "Wasn't what I expected"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Works great; the battery life is kind of short, but it lasts for what I need to do."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "It didn't even work. Return it the very next day. Got another 7'' tablet, and that one didn't work either."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "great for friends who use it for music download."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "or#104-2710083-5393028  So far seem user friendly,and dose what i need."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "It did not work a forth of the time I returned the tablet but I never received my refund"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Bought this item on May 5 2015 and the WiFi won't stay on and it is June 26 2015 don't know how to see if I can get it repaired or replaced very disappointed in this product it was for a gift and now it doesn't even work"}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "Smaller than I thought but it works for my husband he just wanted to play games"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "For the price it seems to be a good product. I like how I can use it as a second screen while mobile and using my Android. It has a rather slow speed for doing downloads and updating the screen. The two camera lenses is a nice feature."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "It works good for the basic need that I have for it."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "love it! Love how fast everything loads on it."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Not good. The first day it started acting up and went blank! Disappointed my son."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "This is a nice tablet for the price! I bought it for my mom and she is really excited to use it to browse the internet and stream videos. I played some games on it and it ran pretty smoothly. The camera is nice as well. Good so far!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "perfect computer for kids also"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great tablet. Shipping was on time and I'm enjoying my new device"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Works very well for an 8 years old.\nShe was thrilled with her birthday present"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I could not believe my eyes when I received the tablet. It is extremely wonderful. When my sister saw it, she said that she has to get one, and I know that she will do so. Thanks very much."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Love it best tablets ever"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Save your money"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "I brought it new and it stopped working after about 3 wks."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Its bigger than I expected... its light weight...I hope its as good as it looks"}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "Slow connection, takes forever to download applications and search books. Times out connection often."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "You get what you pay for. I paid $50 and I got $50 worth. My only two complaints are that your can't look at the screen from an angle or the picture doesn't show up right and the battery life is short.  Otherwise, it works well. I got it as a second junk tablet to play around with."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "I'm just going to be blunt. It's only good for using netflix and youtube. Browsers always crash. Need to be view at an angle or tilted due to glare. Good cheap tablet for media watching."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "We bought this tablet for my 6 year old son's Birthday.  It was a great price and easy to set up.  I recommend this tablet as a starter for children, or it would even be great for an adult."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Best tablet for the price kids love it"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great little tablet for the price. This is exactly what I was looking for in a tablet the Bluetooth compatibility was the biggest selling point for me. I wanted something I could watch Netflix on while I was out and about without being tethered by a cord. There were several reviews complaining about the video quality but I see no issues considering this is a $50 tablet (not a Samsung or iPad which it seems people are comparing it to) Even with the brightness all the way down it is very easy to see. The sharpness depends on what your watching (Netflix's seems a little fuzzy but other videos are sharp so I'm thinking its just Netflix) It's definitely better than my ProntoTec and my daughters iRulu (which are comparable in price). With Kit-Kat installed I haven't found anything so far that I can't download. The only thing I had a problem with was getting the protective film off (some people complained the screen feels cheap, that's just the protective film) but that was a very minor issue. Over all I'm extremely satisfied."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Amazon Prime always delivers on time every time! Great little tablet."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Just got it and haven't had a chance to use it much but it seems to be exactly what we wanted."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "bought during the \"better than Black Friday sale\"  GREAT PRICE>  really good 7\" tablet.  no trouble opening it and learning features.  as someone who is computer illiterate, i find this exceptionally easy.  much better than my phone.  memory good and can be expanded with sd card unlike the kindle.  downloaded netflix and picture quality great.  good buy!!!!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "So far, I like it!"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "good tablet"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "so far this product is great and the price is even better. Not the best quality, but is good enough with the price given."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Order# 106-3256657-8563408\nBought this item as a birthday gift for my wife..she is very pleased with this tablet. It arrived very fast..Thank you for a great quality product that keeps up with the competition at a very affordable price!!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "For only $50, this is a GREAT tablet! Add to that, with the selller NeuTab you can get a free case, per an offer they have. Anyway, I've not had this little thing for very long, and I am absolutely loving it!"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Charge fully, shut down.  Next morning battery dead.  This happened several times.  Not an error of leaving tablet on.  Inexpensive, yes, but not worth the aggravation.  I am hoping I can return it!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I got this for my 2 grandsons and they absolutely love it"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I purchased two of these because i couldn't beat the price and the tablet.  I loaded everything on there for my children and they are working great.  I plan to watch them closely and see how well they keep functioning and will re-post another review here in a few weeks.  These are great tablets for the price and even if not for the price they are functioning very well.  You tube streams properly, so do movies, etc.  We purchased the expansion cards bc of the limited memory and an external battery charger.  I noticed my kids were able to get a good 3-3.5 hours of continual play on these on full charge.  The external batter charger ($9.99 3200mah) works very well when they are at low battery and could possibly play 3 more hours (which they shouldn't be doing).  I just wanted to test these out to be aware of their battery life and the next day we let them die down and plugged it up to the external battery.  The sound, the screen image quality is great and going from app to app is quick.  I have an ipad and a windows surface...these work better than the surface IMO my husband keeps having windows problems with his he commented he should get one of these.  we also purchased the cover folio that goes with this as my kids may drop and didn't know how these would hold up so i wanted to help these little tablets along as much as i could.  oh and the head phones work great on these as well.  i haven't had an issue only on my son's where the wifi was flickering on and off but not enough to stop him from streaming his video and it froze one time that i know of but i was doing a bunch of downloading and setting up his tablet so that may be it; however, i am keeping an eye out on these issues and have asked my son to let me know.  i disconnected wifi and reconnected with password and it still flickered but again it didn't stop the streaming.  Overall, extremely happy with these tablets and i highly recommend these for any age. will re-post progress in a few weeks."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Just received it. It looks good. sleek and pretty. Will see how it fares but first impressions are nice."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I got the NeuTab N7 Pro 7'' Quad-Core Tablet to replace my 8 year old grandsons RCA 7-inch tablet.  He uses it mainly for games and watching you-tube.  All of his apps work great on this tablet.  With Bluetooth we plan on using a wireless headphones, printer and a keyboard to make it even more versatile.\n\nThe basic accessories, USB cable, charging cable, screen protector, manual, and a USB wall adapter is more than the RCA provided and I haad to buy separately.\n\nOverall, he is very happy with the NeuTab N7 Pro 7. Its an excellent buy for a tablet that works and performs well for its price."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Good for the price, a bit slow, camera could have been better, glitches a bit......truly no real complaints."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Absolute incredible tablet for the price. My aunt loves it. Could not get a better tab for the price"}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "Battery goes over fast.!! Barely connects to internet. Drops connection alot. Not as what I expected."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "It's great for the price but the battery life could be better"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "This is my first tablet and I'm really enjoying it. It is pretty easy to navigate and after a couple of days I'm still learning new things I can do with it. The screen is easy on the eyes and the resolution is excellent.  Product as described great value."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "So far I love the product.very good price!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great deal for a great little powerful tablet."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "I think this is a really horrible tablet. I bought it for my niece had to send it back.  First it came with factory fault, only some of the icons I was able to use.  Also I had problems when I'm using the internet, it would just automatically kick me off website when browsing."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Its a nice tablet i already downloaded a bunch of games"}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "this tablet is nice but I do not like the quality of the camera."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Seems like a nice tablet. Purchased it to replace a five year old nexus seven. The display is going to take some getting used to - can't seem to find the right angle to view it so that it doesn't look weird. Also haven't figured how to focus the camera correctly, something which I would have expected to be an auto-focus thing. It comes with a screen protector, which is nice. Make sure you remove the protective film from the screen before installing a screen protector, as the touch screen doesn't respond to touch with the screen protector on the factory installed protective film.\n Charges up quickly, which is good because it also discharges quickly. Not a bad little unit for the money."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I have used it for one day and I love it. It was so easy to set up my WiFi, email accounts. I love the fact that it came with Google Chrome. The camera feature to video chat works very well. I have used this to talked with my Dad, and he said he could see me very well. The colors are bright and the battery life seems to last for a good 5 hours before you need to charge the Tablet. I haven't had enough time yet to use all the other apps yet to add to the review. It has the play store app which is great; I have downloaded a few apps already and it was very quick. So all in all, I am very happy with this Tablet for the price"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Ordered this for my son, he has been wanting a tablet to take the place of his laptop. Price was great but the tablet is even better!!!!! Just as good if not better than more expensive tablets!!!! Does everything that he needs it for. Very pleased with this purchase!!!!!!"}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "I just opened the box and want to load some games for my daughter, but the Wifi will not recognize my home router modem.  The Wifi says authenticating problem, but excellent signal. If I can't figure out the problem, it will be returned. It is useless if I cannot use it in my own home."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "OMG\nI love this product . So easy to setup and it has great graphics . ''\nThought it was going to be like others but not.\nThank you"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "So far seems to be great product for the price, functional, fast, scalable memory, etc. Love it, great investment!"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Great deal, good product."}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "Resolution not that good"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I love this android.  it is everything I expected and more. delivery was fast and I would definitely recommend to my friends"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "This is a great little tablet for anything you do. The main purpose for mine is taking notes for school, and it works great! Highly reccomend! I'm using it to write this review!"}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "It was a gift certificate.  After ordering I received it promptly.  After about 1 1/2 months the display suddently total failed.  I contancted NeuTab (Amazons replacement had expried) via Email.  Although correspondence was somewhat slow, I assume they are very busy, they agreed to replace it after I sent in my broken one.  Unfortunety it was lost in shipping.  However NeuTab replaced it anyway with a new one. They even checked it out before shipping.  I am new to using an Android Tablet.  So I am having start up confusion, however it seems to be working very well. It seems to do and will do everything that I want.  One of the hardest things to do is to attach the screen protector without leaving air bubbles.  It would be good if the protector sheet was applied by someone who knows what they are dong.  The touch pad on the new one works very well.  The 1st one had touch pad issues.  It wold also be good to have a better manual (or a link)  on how to use android for people like me."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great tablet, very light. And easy to use."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Very nice tablet."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Best tablet for the price. It does not have a bunch of apps preinstalled which is nice so your can get what you want without a bunch of things you don't use and cannot get rid of. Cameras work, video chat; no problem. Opened approximately 5 apps at once while in voice chat and it did just fine with alittle lag. Have not even used bluetooth yet but looking forward to taking advantage of wireless keyboards etc. This is my first tablet and it is exactly what I wanted."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Very nice"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "It has great sound, it charges fast, the Bluetooth works great, overall a good tablet!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "A great device for the cost loving it"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Received this tablet in a timely fashion. easy set up, great front and rear camera, lots of great features. Bluetooth great all for a bargain price."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great Price, Tablet isn't a powerhouse but for the price it can't be beat!!  My son loves it!!  Extremely fast shipping. I May order a few more for the other kids for Christmas..Or even one for my self"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I received this as a gift for my birthday. I'm not a huge fan of Android operating systems so I was a little hesitant at first. After spending a lot of time with this tablet I have actually grown to like it! The 1024x600 HD display is so vibrant and clear. The processor is very fact, apps download in no time, and it's extremely easy to uninstall apps. The system is very easy to navigate. I found the camera quality to be very good, and I have no problem streaming videos (which is way it was bought for me)! At this point I've only had it about 1-week and there are still things I would like to do with it to explore everything about it. I also smile whenever I restart it (sometimes I do it just because), as I love how it comes up and says \"KitKat\" (my favorite candy bar)!!!"}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "The product has very poor connectivity to wireless networks, also does have areas on the screen with few sensibility from touch."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "It was  great , on time delivery  thanks"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "keeps shutting down, does not stay on."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Very easy to use. Love the video maker."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "I love it! Im trying to learn how to get my video playback from speaking spanish?? The picture is beautiful!!"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Great overall product, the battery life is a little short, but good overall"}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "Can't Expect Much for the Money But It Is Rather Slow, Not Good Picture Quality & Mine got Bumped off the Sofa 16-Inches High And lands On the Back Side of the Tablet Not The Screen side And the Screen Shattered You Would think it would be Much Stronger than That."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Great product, as advertised.  Battery could be better."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Got this with prime one day shipping. Seems like a fantastic tablet for $50! Lots of people complain that the touch screen doesn't recognize, but they probably left the screen plastic on which you are supposed to remove before use. People also say its slow, however I did not see anything too slow. The graphics are amazing, a bit too much so. Ran Netflix on it and it worked almost instantly with playback. I would suggest it, but if you abuse it you probably will see why others don't like it."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "Loved it when I got it but it runs really slow and I need help with that to be satisfied. Secondly, lots of common apps aren't compatible with the device and most apps I do download shut down very quickly or never work."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Like this tablet but doesnt have a long battery life."}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "poor quality"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I had never heard of this tablet before but decided to  take a chance and purchase it for my grandson. It has turned out to be to be great!! The tablet was packaged very nicely and shipped very fast. I am not very electronically knowledgeable but the instructions were easy for me to understand and in no time this tablet was customized to my liking. The color on the screen and clarity is great also. I have not had a chance to take any pictures yet but I am sure they will be great. I would recommend this to anyone interested in purchasing a good looking and excellent working tablet."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Ordered black and got hot pink even though the box said black. Took four days to connect to full wifi. Speaker only lasted two days. No quality with this product. No promises were kept. Had to throw it into the trash. Will never recommend any of their products. Can't even get a replacement or refund."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "I am a gamer and a writer, I needed something that can work for me on the go and without having to touch my time on the phone. This has worked superbly in the pinch twice already!!! may not be the top of the line or anything. But, it gets the job done and allows me to show others my manuscript!!! I am happy with it!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Love it."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "Seems very functional and internet speed is adequate. Not yet sure about the battery life.  Has good sound."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "I think that the power buttons and the volume buttons should have been inside instead of outside the frame because it is too easy to hit them by mistake when you rotate or put on a stand to watch.  I also think that the speaker should be either in front or in the frame because it is kinda hard to hear. The unit does get warm and the battery seems to drain quickly. This is my first Tablet, so  I am still getting to know it. Over all I am very pleased with it,as it was a birthday present to myself, and I believe I am the only person in my building to own one. (Tablet PC)"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "This is a good tablet for anyone who is looking for a great deal.  It has been working great, and is a good size for anyone.  Also it came with a screen protector, so you don't have to order one separately."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "It does everything I need it to do. No problems. It is not a 1000.00 dollar Ipad so I don't expect it to work like one. Good deal."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "The tablet is alright. it can play games that you would want except sometimes the games crash if the tablet gets hot. battery life drains pretty fast compared to my smartphone. Touch is also sometimes, rarely not responsive. I would buy it if all you're going to do is game, youtube, read books and browse internet. I was pretty let down on the camera. I guess thats to be expected. However...I didn't find it acceptable by any means. it was like looking at a 480 x 640 resolution for the rear camera. 2mp should look better."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "The tablet arrived quickly and in perfect condition, It works as a good if not a little better than higher priced tablet. Would recommend to anyone looking for a quality tablet for an affordable price. Will more than likely pick up another one as a gift, it is actually that good."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "made my granddaughter's day."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Brilliant. Fast.  Simple. Amazing price."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "We bought three of these for our kiddos. I love them they were easy to set up and easy for them to use. Would recommend great product for the price."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Thank you so much we are enjoying them."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "Eventhough the battery lifetime does not last long, it works perfectly for the purpose that I wanted it. The performance is really good. One of the best tablets I've ever tried."}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "It's what you pay for, it's honestly nothing that'll blow your mind in speed, but it is cheap, and it can do a nice amount of things. I just prefer to use my Samsung Galaxy Note 4 for my heavier tasks."}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "Both were broken on arrival"}
{"rating": 4.0, "product_id": "B00THEMRX8", "review": "bought it for my 8 year old and she used it for educational purposes only.  Did exactly what we wanted to do......work."}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "Don't expect great things from this tablet. Not too bad for the $$."}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "Led screen seems a little weird, like there is a shadow. Over all, you get what you paid for. My Mom needed something for her Candy Crush, as her Nook died. She seems happy with it. The camera is not worth even taking pics with. OS is like that of most tablets, there are a few different things, but they can be changed."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "My (old, slow but trusty) ASUS notepad bit the dust when it slipped from my hands and the lens cracked.  This little number has already proven to be nimble, easy to operate and a whole lot easier to handle (physically) than its dinosaur forebear.  Top that all off with an amazingly accessible price - Hot damn!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "very good"}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "It sent back within 2 weeks.  Had too many software issues and the charging cord would never fit right.  Customer service was great in trying to help fix the problems."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Purchased this as a birthday gift for my almost 8 yr old.  Very happy with the product.  Instructions are easy to follow as well."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Its good one"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I love my NeuTab N7 Pro 7\" Quad Core Google Android 4.4 Kit Kat!!  I have a Samsung Tab 7.....not jearly as powerful or reliable as my new NeuTab! I can access my online courses from my NeuTab where as on the Samsung there was no way. My NeuTab has not froze up or shut down like my Samsung does. All around it is just the better tablet all together!!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Very good tablet for the price. Small but im not into huge screens. So impressed that I'm buying my grandmother one."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Good quality for the money"}
{"rating": 2.0, "product_id": "B00THEMRX8", "review": "Ok"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great product! Easy use!"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "I love the tablet it just dies quickly"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "You get what you lay for, apparently."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Great Product"}
{"rating": 1.0, "product_id": "B00THEMRX8", "review": "This is the worst item I've ever bought on Amazon, the lowest rating, and such a huge disappointment.  My son used it a handful of times and it broke, he didn't want to get in trouble so he didn't tell me for 9 months, acted like he lost the charger, and by this time it was brand new, but past the warranty. I will see this name and run because the pad just stopped charging/turni ng on."}
{"rating": 3.0, "product_id": "B00THEMRX8", "review": "My son and i love the tab but the only thing is the table is slove when im trying to go to YouTube"}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "These are great products for a wonderful price. We bought them for our grandchildren."}
{"rating": 5.0, "product_id": "B00THEMRX8", "review": "Very good"}
