{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Some of the big pluses for me was that you can plug in the charger and still have a usb port free, the mini hdmi port to plug it into your flat screen TV, and of course the low price! My kids have them and love them! Their only complaint and why it only got 4 stars is some apps like instagram and snap chat are not compatible with it."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Came on time and have had no problems with it"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "works great ,  using  it  now  to  respond."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Very happy with this item and the timely delivery of this item."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "Great working order. One big scratch on screen in corner that wasn't disclosed. Otherwise, sale, delivery, and overall experience positive."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Do not buy this if you plan on plugging it into a Windows computer to access data, or load movies, books, whatever.  I have tried using this on several computers ranging from Windows 10, 8.1 and 7.  Support was very short with me and simply stated that the Android device is not compatible with ANY version of Windows."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "This truly amazing laptop does it all, if you are in the business of revenge and dirty deeds.\n\nAfter reading reviews here and on other sites, it became apparent that this device was crafted by a team of extremely fiendish gremlins and evil faeries. The sheer volume of people that became frustrated with the operation of this device only confirmed my observations.\n\nI ordered this device for family members and people at work that I truly disliked, I even got one for our back up baby sitter that always denied using our children's iPads.\n\nThe effects were magically delicious: complaints, profanity, dismay at being unable to return or sell the device. Our targets of disdain were literally stuck with these cursed devices in a perpetual quandary of not wanting to use the exasperating object and the inability to give away, let alone sell, the vexing piece of tech.\n\nIf you're looking to cause someone some additional stress or to lose whatever hair they have left, order them a dozen...\n\nEdit: I find the commenters taking this obvious sarcasm seriously to be quite delicious."}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "If you want a small device that will be consistantly inconsistant, this is the perfect device for you! Try typing a search request. You will be constantly amazed at how only a small part of what you typed will appear on the screen! Then, with only that small part, the device will usually switch you to a completely new, unrequested screen,  or make the cursor disappear. Sometimes other things will happen.\n\nI have struggled with this crazy device for only two days, and already this morning I find that I have a strange twitch in my upper lip. My lip twitches only when I use this amazing device.\n\nWould you like to stress someone out? Buy that person one of these RCA 10 Viking Pro devices! In only a few days, their demeanor will change."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "I should have listened to the reviews. It wouldn't even boot up past the Viking pro 10 page. It just sat there for hrs!!!! I tried a hard reset and I got it to open up. Then no voice command installed was stuck on the screen. I couldn't get pass that, so I restarted it again and it was stuck on the Viking pro 10 screen again. I already knew it was a lemon. Sent it back."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "School reasons. Still not convinced on the battery life"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Perfect This Lap Is Perfect My Girl Using It For School She Loves It  #TeamRCA"}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "Came with box damaged and inside the tablet looked used. No screen protector that comes on a new one and bits of plastic under the screen. It works good tho."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "Good for the value"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I bought this laptop for an old lady to use and it definitely does a great job that met the needs of its user.  This little laptop can connect to her TV and stream videos on a bigger screen.  It also allows her to check emails and online surfing.  For such a cheap price, it does so much more than I expected."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "My daughter loves it! Works great"}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "It seems to be a regular old tablet with a keyboard which is cool , ordered it for my highschooler to use in class for google drive, but it is sooooooo sloooooooowwwww to do anything!!!! I may return it."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "love it"}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "Too slow, barely useable."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Easy to get around on."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Worked 1 time then conked out. Returned. Got a Lenovo instead. It works!"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "I received a tablet that would boot and then shut off immediately before being able to log in. (Yes battery was full, and i followed various online discussion board help threads attempting to solve the isssue.)\n\nThis has been a sort of nightmare scenario as this was a gift for a hospital patient and when it failed to work its an embarrassing and frustrating experience. I spend a lot on Amazon every year, and have always had a great experience, but this was so upsetting this is my first negative review.\n\nAmazon support was amazing and issued a refund immediately. I purchased this same one with that balance (on request since the patient wants this tablet) so I will be giving the new one a try when it arrives tomorrow 8/27/19.\n\nAs of right now I can not reccomend this defective product. I will update my review based on what happens with the new tablet tomorrow."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Muy buena , very good"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Works with all playstore apps I've tried so far.\nIt is lacking on memory, so it can be laggy at times, especially when it has woke up from sleep trying to play catch up. Let it catch up for a few minutes, then use it."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Its great"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Bought it for my daughter birthday she love love it"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "I didn't want the product so I sent it back"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "I like that this product is lightweight and portable. I can carry it with me to keep up with my classes. Great job RCA."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "i have been using this tablet for two weeks and love it. It is very easy to separate and reconnect the tablet and keyboard with the pull apart magnetic design. I also like the keyboard touch...responsive and not clunky. Another plus is it doesn't weigh too much considering the 10 inch screen.\ni am certainly not a computer geek, but  i am pretty picky about what I spend and what I get for my money. This tablet delivers a lot for a very reasonable price. Finally being a bit of a fashionista, I love the rose gold color...makes me happy as I answer email or pay bills."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "It's ok..just ok . Maybe it's me . But it looks like a toy.. maybe it's the blue.. I just don't know..  maybe I should of ordered the black .."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "If giving zero stars was an option I would. I can barely open documents and you can't even watch a YouTube video. My ASD son got this as a present so it's unfortunately past the return date. 100$ paperweight."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "This tablet has a nice picture and the little key board is great, but that's about all that is good with it. The camera is junk, it gets hot fast and the battery is a joke, it only last for a few hours. Besides everything else that is wrong with the tables it is very heavy. I have another tablet that this was replacing and it is still better than the new one.  Worst money I ever spent. Thought it would be a good table being RCA, I was wrong."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "My daughter really loves this product. It looks identical to the picture."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Bought machine on March 11, 2018 last night while my husband playing a game screen  started flashing then went dead. Know it's a cheaper tablet but hoped it would last longer than 5 months. Guess it's true you get what you pay for. Would not recommend to ANYONE. I would rate as minus stars if possible."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I use this to wind down at night in bed.... to check email and Facebook, to play a few games, and do some online paint by number coloring.  Only issue i have is that my wifi at home is not that great therefore the tablet/laptop goes off a lot.\nKeeps a fantastic hold on power.... 3 to 4 days before charging."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Read the reviews and decided for $90 cant go wrong.  Upon opening the box the plastic felt cheap and the tablets felt heavy.  Then I remebered I only paid $90 and was trying to make it out to be like I paid $800 for them.  More than likely you are buying these for your kids and the plastic on second glance is actually really durable.\n\nPros:\n- Good resolution\n- Good screen size\n- mini usb, regular usb, hdmi\n- snazy colors\n- price\n- the many andriod apps\n- detachable screen\n- Kids are entertained\n- Front and rear camera\n\nNeutral\n- 32gb storage\n- Plastic casing\n\nCons\n- Old dc plug for charging (is this still the 90s?)\n-  only able to get akward cases due to the location of buttons, ports, camera."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Use it for everything"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "quite happy so far.  only wished it held a longer charge but four to five is fine."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "It gets hot, shut off on it's own, stick alot and need to charge often."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Excellent product, easy to use and to carry."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "You get what u buy just do research before purchase"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Had this tablet for a couple of days. I'm pleased with it overall. Speed is acceptable, apps load in a reasonable time. It seems sturdy enough to last with normal use. Graphics qualities are decent, not high definition by any means, but didn't expect that for the price.\nThe only drawback I've found with it is: I can't get it to connect with my PC for file transfer using a USB to micro USB charging cable. I have to load files on a flash drive, & move them from there.\nOverall, for the price, it's worth buying."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "I purchased 5 of these in November, 2017, and they turned out to be perfect for my grand kid's school work.  They worked fine until August 3rd, 2018.  One went on the blink that day, and another one 'died' on the 5th.  Since they are within a year of purchase the manufacturer is responsible for repairs.  Talk about a joke?  I have filled out the 'repair/replace form three times this last week, and I have yet to receive anything except more instructions on filling out the 'repair/replace' form.  In fairness, I purchased them from another store, but they are the EXACT same thing!  I am old enough to remember when RCA was a top of the line, trusted producer of electronics, but that day is long gone.  Their piss-poor service is just adding insult to injury, IMHO"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Bought it for my girlfriend, she loves it.\nShe uses it to surf the web and do shopping so that way she isn't always on her phone"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Terrific!!  Great price!"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Works for my 8 year old.  He's happy.  I'm happy."}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "It is ok for a petite person. Not for someone with big hands. Keyboard way to small. You cannot cut and paste."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "7 days of use update\nI am a college student. This laptop fits my basic needs as:\n- web surfing & install android app\n- good docs / excel or powerpoint (get app WPS)\n- youtube\n- google assistant (work quite well)\n- light and portable & readable size\nBattery is around 6 hours normal use (reading PDF & slides)\nCamera is a weak point\nSound is OK\nNeed to familiarize with smaller than normal keyboard (not too hard)\nHighly recommend. Dont forget a case with it."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "At this price point this tablet is a steal!! It does everything I need it to do and then some. The USB port is a great bonus as I use it for my portable printer. This tablet is literally better than my HP mini IMHO."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "So far it's been pretty good. As of right now it is starting to freeze and slow down"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "great for kids to have for their own and adults as well"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "It's not completely like the picture but it works amazingly  and I love all of the different things that I can do with it"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "No good!!  Maybe I was too eager about the price or maybe I just didn't read the details.  This is definitetly a \"laptop\" from the '90's.  It doesn't stand a chance to the laptops of today.\n\nThe camera is 2 pixels.  2!!  Do you know what type of fuzzy silhoutte of a person this produces.  It is not worth the battery time, not to mention trying to record something is quite impossible.\n\nSave up, get a better laptop that produces better images, better system, and overall better quality.  Worth the extra dollars."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Just what i ordered perfect"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I saw lots of reviews of this product on YouTube, It's a decent tablet which has enough functions for a college student like me & it's easy to carry with my backpack. Basically I decide to use it to watch videos and do some college assignments by google doc. The most thing I like of this product is it contains keyboard and mouse pad screen, which is very cost-effective product.\n\nI haven't got it so far cause by the delay of free shipping, But I'm expected and can't wait to have it."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Love it"}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "The touch screen stopped working after 2 weeks, It is a piece of junk. I intend to send it back, it is useless."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Garbage. I burn the battery every day getting updates from 9 years ago. which means i never get to use this thing aT ALL. 1 hour just to turn the thing on then 6 hours of updates. then WEAK!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I bought this for our son for his birthday and he wants to be one it all of the time. I have zero regrets about buying this. My husband calls me a tightwad bc I don't spend money. It was perfect price and just what my son hoped for his 11th bday.\n\nPlease note these images are of it still in the package. I don't have any images if it out. My son loves it and it's a great buy."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "For the price I'm still trying to find another tablet that match this one. Is a bit slow for my taste, the touch display is not as responsive as I would like it to be. The downloading of files and the way the tablet stores them is a nightmare.. Overall it is a great product for the price paid."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Love it. Went from 7 inch to this to watch movies on in bed."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "very portable and geta the job done. great bang for the buck!!!"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "love it."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Great for insurance sales"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Excellent"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "THE ABSOLUTE WORSE! Within 2 hours received errors when trying to use camera, tech support advised I could do a hard reset EVERYTIME the camera needed to be used. Within 10 hrs screen is black and  Im unable to even power off. Total junk even for the cheap price."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "Looks very nice out of the box. Slow speed. Nice display. Takes forever to open apps or web pages. I was just looking for basic functions, but just set it up and extremely disappointing prossessor speed . My adroid phone is much faster. Probably better for  a kids first tablet. Going to  research how to somehow speed it up."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Don't waste your money. I had it a few months and then it just quit. Wouldn't turn on anymore. Just stopped without any notice."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "love it an got a secont one"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Excellent buy. Nothing nearly as good for this price! 6yr old loves it! His first RCA tablet took more drops & (yup) out-right FLIGHTS across the room (when internet or video would drop/buffer) and survived 2 yrs of much use. Was time for a new one, this is twice as 'powerful' as his old Viking II, I can only hope it's HALF as durable. Fast, great picture, std sound is fine.\n\nOnly complaint - NOT very good at  'grabbing' wifi signal - as compared to some other products, but works outside within decent distance from our home wifi"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I love it"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Super cute & the tablet can separate from the keyboard. It works very well, but definitely not as well as a laptop."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I got this tablet for my dad. And it is working perfectly. He loves it!"}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "I have had this ablet for 6 months and a few days ago I can't get it to turn on, it will not work at all."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Battery live a bit short"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I love the little tablet.\nUnfortunately, Google is stuck on wanting my credit card info to prove I'm an adult, and I say that Google can just F off.\nA lot of the things I could do with this tablet, I can't.\nBut hey, it's a great little tablet, and I bought it to replace the old 10 Viking Pro that got stepped on.\nDoes anyone know how to get rid of the Google crap?"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Love it"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Very nice tablet. Very strong and not flimsy. The tablet snaps off of the base easily. The 12yr old girl and 10 yr old boy that received them loved it. I want one for myself."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Bought this tablet for my daughter.  She loves it."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "I got this product for my daughters to replace their old RCA that the screen happened to get busted on (mommy didn't see it under the covers and like Bigfoot stomped the screen on accident). They absolutely loved the color and that it was a 2in1. We did the whole open package read the instructions and let it charge then they were off playing in it downloading this and that and watching you tube like normal. At the end of the day though it had lost completely all of its charge! The battery is obviously not very good at all! Very disappointing not only to them but to me as well. They weren't on it but I'd say 4 hours total all day. All of their other tablets have kept charge longer than that. Also noticed this morning that its already starting to bog down. I got on it to do the whole mom check and make sure nothing bad has been installed or viewed and it was already starting to take more than a couple seconds to load! They did download 8 games varying in sizes from ~20MB to the biggest ~90MB. There are no contacts, pictures, videos, or audios saved on this yet even! I'm worried this will be one we will have to return sadly :(. It is super cute and love the 2in1 feature. It just didn't last long through family use."}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "I had high hopes, but it is really slow. I just use it for business. I use it to charge with Square and to schedule appointments online with Square. I have had a lot of issues with it just going into Safe mode, Wi-Fi not working, etc. Wish I spent more money and bought something a little higher end. Though I do really love that it includes the keyboard. That is the feature that really made me want to buy it."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Very nice!"}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "I bought this thinking I'd use it instead of a laptop for an upcoming international trip. I decided to take the laptop instead. The tablet is really heavy (it weighs almost as much as my 13\" MacBook Air) and has poor wi-fi connectivity and sound. OK for weekend car trips, for the price I don't have to worry about accidental kid damage, but not what I was hoping for."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "My daughter loves it. They only bad thing about this laptop/tablet  is that sometimes some of the keyboards don't work and sometimes they do. Is very frustrating when you're trying to write something especially when the ENTER key don't work. Still my daughter wanted to keep it, everything else works great. She only used it for some school apps, play games and watch YouTube videos. The keyboard thing must be only because my was defective I'm not saying they all have the same problem.."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Great value for the money. I don't know why I didn't give it 5 stars but everyone has room to improve!"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Screen cracked and scratches easily"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "sent back cursor moved by itself and froze up. retirned"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "I ordered a 10.1 inch, 32GB tablet. I received a 7 inch, 16GB tablet. I`m using it now to type this review, and it's nearly impossible. The keyboard pictured is drastically different than what was delivered. This has to go back. Will look for a more reliable seller."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Great device for the money. Took it on vacation to Ireland and it worked great"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Let me start with, if you're looking for something like an iPad or Samsung tablet, move on. This is a low end tablet. However, in comparison to similar priced tablets, this one is great! We bought this for our son to watch kids YouTube, mainly. It feels decently sturdy and keyboard is a great addition. It made setup much easier (which takes a little while, be patient). Sound is what you'd expect from this category of tablets. Very pleased with the OS. I liked that I could set this up as a kids tablet from the beginning but also access all the other features when I need to with my account. Very happy with this!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Bought this for my daughter. She loves it, spends most of the time watching YouTube. Works great and easy to use."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "This tablet is great, especially for the cost. I love that it comes with a keyboard especially. The only downside is that the picture isn't especially great and that sometimes the keyboard can be finnicky.  This doesn't hinder the product though and you can beat it for the price."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "So far so good, it's really an entry level tablet,  , The sound isn't very realiable , All in all ,it gets the job done, not too bad for the price"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Wouldn't tether to hotspot"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Won't tether to hotspot"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Good for the price. It's pretty inexpensive, so I'm giving it a break. The keyboard isn't bad, takes a little getting used to, but I have no complaints about it. The trackpad works well also.\n\nMy biggest complaint is that the battery is unpredictable. Sometimes it will be fine in stand-by for days, but other times, the battery will show nearly full, and I'll walk away for an hour and come back to it refusing to power on; the batter is now dead.\n\nMy second complaint is that it's a little slow. All I use it for is to view pdf documents and making notes using OneNote, I don't feel like that should tax the cpu much, but it does respond slowly sometimes.\n\nOverall, it's a good buy for the price, but don't expect to have a replacement for your high-powered laptop here."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I really like this RCA Viking pro it works great thank you"}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "The tablet is in beautiful physical condition, however I constantly am waiting minutes for videos to load with constant buffering. It's not just streaming services that are slow on this device, but when I go to type it seems to not be able to keep up with me. Being so used to quick and easy-going devices, this is a good test of my patience. I wouldn't buy it again honestly. I didn't pay much for it which is why It gets 3 stars. I understand I get what I pay for. I was thinking it would be because of the low quality camera, tiny size, limited features, and short battery life that would bring the price down. Sadly, the actual device is just in no rush to load anything ever. Its not my home wifi to blame either, I've used this in different locations as well. If you have this device or just ordered it, I'll be sending you good thoughts."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "great price and awesome quality can't beat it!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "My son's bday present he loved it"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I would love everything about it. Some apps require long screen so need to flip and not use keyboard. I do enjoy web and movies"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Good quality for price point. Just have reasonable expectation for what you ask of this tablet. It's a bit limited in Ram so not great for multi tasking or heavy editing/gaming. But it's a solid build, good battery life nice keyboard. Awesome choice for internet surfing and light app use. Consideing price. Also like the expandable memory and HDMI out."}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "A good tablet for an Android, but runs very slowly a month later..."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "We had it a month and it quit working..."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Received tax 10 in tablet very disappointed been charging for 6 hours and it is not charging. Turn power button and it didn't charge. Want a refund and send a new one not refurbished one box was over old."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Got one for ten your old grandson. Perfect! He is still super happy with it! He plays alot of games. This has the memory and ram perfect for that. It also has parental controls so i have to put in a password for every game. It can be annoying i guess at first but best."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I bought for my mother and she loves it"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "It is very slow and keeps restarting for no reason."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "My son loves it. I have purchased several tablets for my kids the last couple years and they usually quit working or lag. The keyboard feature is what really sold him. Easy to add/remove feature.\nSo far this tablet is fast, clear and has great resolution and plenty of storage. I recommend this."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Perfect tablet for me! Love the size and the way I can remove the keyboard thank you. Well priced, also"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Never worked properly. By week to was totally gone. Returned."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Waste of money. Doesn't stay connected to internet and  very slow memory.  Bought to only watch Netflix and occasionally browse internet, but it cant even do that. I would light it on fire if Amazon wasn't going to let me return it."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I love it.  I love how I can just use it as a tablet or a laptop.  The memory storage is good so far."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Excelente"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "froze a lot and was glitchy"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "My 8 yo granddaughter loves it!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I was pleasantly surprised to find that the operating system on the RCA RCT6303W87DK 10\" Tablet was chrome based as is my Chromebook.  It syncs with my laptop automatically.  The keyboard is nice, but the keys are a little small.  Still, better than trying to type on the touchscreen.  I use this almost exclusively for song lyrics as it's much easier to carry than multiple songbooks!  It is very handy to have and I am enjoying it."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "It's good for playing games and getting on Facebook. I use it for learning game for my kids they love it."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Worst tablet every. Restarts in the middle of things, updates and causes freezes all the time. Apps don't run right and key board is worthless."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "I bought mine and it came fast but with a password needed and aftee i factory  reset they need the old  users email and password"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I like this 2 in 1 combo. Keyboard is good, equiped with lot of aditional keys. Very quality product in this price range. Works smoothly most of time, even if I use to put it on the edge."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I love it have not had any trouble. works great ."}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "Pointer jumps around way too easy!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Amazing tablet//computer duo for the price. Its a bit small but its pretty true to the picture. Works well, functional and cost effective!!"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Great and functional but doesn't have great camera quality"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I saw a few poor reviews before I bought this, but I'm very happy with it. Most of them seemed to be people who didn't know what they were buying. This is exactly what I needed to have."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Its horrible.  It freezes.  It simply is not more than a game.  Not an effective tool."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "We ordered 2 of these for the in-laws. The PC is now gathering dust. They love sitting in their recliners looking through FB pictures and checking email and news. Best Christmas gift ever!"}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "I work as an ABA therapist, and I needed something I could bring to work that would run our data taking websites and software (which only require a browser), and the processing on this was not high powered enough. Im not super surprised given how cheap it is, but it is definitely a very slow machine. It would be fine for kids, or for grandparents, etc., but if you need to actually get work done I wouldnt recommend it."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "This is a nice starter 2-in-1.  If you don't expect, or need lightning speed.  I bought 2 of these one for my 14 year old daughter, one for myself just to watch movies, you tube, or play simple play little games on, ie.  Card games, picture drawings etc.  If my daughter or myself were to damage one, they are not expensive to replace.  I'd give it a five * if the seller sold it as a 1gb, what it really is. It's not an 8gb ram."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I have really enjoyed this tablet..  If anyone is thinking of buying a tablet. I would certainly advise them to consider one ."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Horribly slow"}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "If you are looking for a tablet this is it. Its not like a laptop at all."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "really good. use for school and my teacher is super weird when i get  it out"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Purchased for my girl friend and she loves it!!! Thank you. John"}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "Was not expecting it to be a great tablet due to the price and specs, but slower than expected and the camera is low quality.  1GB memory just doesn't cut it, but it will due cause of the features I wanted (android os and detachable keyboard). Still a good buy for the price, just need to know what you are getting."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Just awesome and very crystal clear screen, I bought 3 of these. My classmates love it, and they bought it from me - so I always have to buy another one."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Perfect for my 6 year old. She loves it!! Easily set up for children also!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Amazing very good of you need something simpler not high tech"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Really have been enjoying my tablet!! Was a little disappointed because it won't let me do certain things because its not a real laptop. I cant swirl on my website, which is why I bought it But overall it was a great buy!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Easy to set up and begin use. Love it.."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Very nice"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "If I could give a negative review I would, I purchased this last month and it's already messed up, the touchscreen doesn't work and the keyboard isn't working either, RCA has to be the worse, and I'm pissed because of the money I spent because I bought it for my daughter as a birthday gift."}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "Really good. Did have some defects in it. Would like to get another one without the defects but it works good and very easy to use."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Love it"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Love it , just what I need it!!!"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "the touch screen does not work"}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "It broke the second day, I guess my granddaughter is too rough on it."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Been using my every day for over a year. I like it and a steal a the price I paid."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "This is a great tablet"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "First one i received wasn't so great. . keyboard didn't work and tablet keep freezing but the replacement works amazing!! Love it!!"}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "Great & terrible. I loved this little laptop (see below), BUT... I bought it specifically for writing productivity. Unfortunately, the RIGHT-SHIFT KEY is located to the far, far right, and the PGUP KEY is where the right-shift should be. So every single time I go to capitalize a letter, my cursor jumps to a different location in my text. That means constant correction, which adds keystrokes, time, and errors. I'm afraid this problem is a deal-breaker for me since the 10 Viking Pro doesn't function in the sole capacity I needed it to. Sadly...returning.\n\n(NOTE: This laptop is fantastic in every other way. Perfect for the price-point.)"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "This is a great,  versatile tablet that is holding up well to lots of use by my children and me."}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "Did not hold up well!"}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "Attaching keyboard is easy. Turning on takes awhile to load. It has a habit of hesitation when entering info or doing a search. Kinda wish I had spent a little more money on different brand. But for now it is working."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I bought this as gift for my boyfriends birthday. Its so nice I should have gotten myself one too. He loves it !"}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "Had to get a refund which was hassle free. It didn't last a month before the screen froze  & it became inoperable ."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "The price was unbelievable, and it works great."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Terrible battery. Lasts for only an hour. After 2 months it would no longer power on."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Very good product, I use it every day and functions very well."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Purchased as a gift for his mother, she is learning to use a computer for the first time at age 83. She is doing pretty good with it, easy to work with. The keyboard is an added plus, she has poor eyesight but she can see the screen pretty good. Feels like a real computer than a tablet/"}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "not really laptop more like iPad to me"}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "Edit: it did turn on after a full charge several weeks later but the touch screen does not work anymore. I plugged in a mouse,  and most of the functions are running again\n\nFor the price, it worked wonderfully and as expected. However, mine up and died randomly after less than 4 months of use. It turned on just fine, I locked the screen while I grabbed my charger from the other room, when I came back and tried to get back on it, it never turned back on.\nOther customers online had this similar problem and more often than not there is no fix. It wouldn't even factory reset."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "nice"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Cord broke after 4 months breaking something inside tablet contacted RCA to return it returned from repair stopped working again less then 2 weeks later wish I hadn't bought it for a gift or any other reason"}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "Am having trouble my works i live it love the color only one thing wrong it want last long LG without being plug in watching movies and etc.  I need to get one with the 6 hour battery this one want last 30 mins without being on charge! I brought insurance so what do nithing do! I don't want to wait 2 or 2 days when I got to have it and I hadont it ship over nite. What do i need to do with battery cuz ibwant b to keep my tablet i love it!"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "does the job"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "This was a PERFECT laptop. No problems at all but it doesnt do everything I needed a laptop to do."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "these rca computers are pure CRAP....a waste of money....you will pull your hare out trying to get it to work.....save your money an buy an apple."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Perfect upgrade for me! Love this tablet! Great price! Exactly what I was looking for!!"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "easy to set up and works great, one thing to note it doesn't have manual book for people not familiar with this type of device, after I got it set up as am familiar with them I found a pdf of the manual installed. It comes with several apps some people may use  which I didn't like as had to uninstall them, reason  for 4 instead of 5 was aggro I am having still trying to uninstall Google chrome as it is not the browser I ."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "I brought two of these for my son's for Christmas and they was very happy. The only thing they didn't like about it was the start up when cutting it on it's slow. But when it's running it has a good speed to looking up stuff and move it from screen to screen."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Its not charging anymore"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "My niece had it for like 2 weeks nd it stops working was trying to return ND get replace"}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "I got what I paid for."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Great tablet for the price.  Easy to set up and use. Downloads quickly.  Good looking. Love the little key board.  No need to spend big bucks. This one does it all!"}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "it's my daughter's she says it's too slow"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Great Price"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "After a week it stop working"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I originally bought one of these for my wife a couple days ago. It replaces her Android that slowed down after 4 years. I bought this from another major on-line site at $30 less. But even at $90 on Amazon, this is a real deal. After a couple days of play, I liked it enough to buy myself one. The screen resolution is high enough to provide excellent HD video at 1280 by 800. And for day to day use, it's much more than adequate. This unit, when connected, gives it a true laptop feel, however, it will separate into a free standing tablet away from its keyboard. It has a high quality feel brought on by its specific attention to its design. It was designed to be both, so it serves well in both modes."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "microSD card slot does Not work."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "It is very useful and works great. But it is more tiny than expected."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "Nicely constructed, but the unit runs slow as molasses. Also, the right shift key needs to be larger. I'm always missing it. I was going to take this to Europe and use it to read books and follow audio tours, maybe do some video recording, but I'm more than likely going to return it"}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "Very slow om the operating system. I do like evryrhing else it can do but todays day age i need something quicker"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Great product. My boys are having a great time with this tablet."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Small, convenient to carry ,with keyboard to set at table .  Bought a small mouse to go with it."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "My daughter was sitting on the floor, if slid from her lap, and the screen shattered... worse than Apple products. It \"fell\" maybe 2-4 inches."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Love it"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Beyond extremely disappointed. I received the tablet 4 days ago and each one of those 4 days this tablet has frozen mid-use. It won't turn off and I end up having to reset it...sometimes more than once a day. Not happy whatsoever."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "For the price okay"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Worked great til I dropped a box on it sigh."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Bigerr than expected"}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "Got this for my niece. Not great quality. The keyboard is horrible. Doesn't seem very sturdy, and the touchscreen reacts sometimes weird. Sadly, I passed the return window."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I have to say it is very amazing for the price. Mine has Android 6.0 aka Marshmallow the processor performance is decent. I can do just about everything with the Viking Pro that I can do with my LG V30. I play games and movies from Vudu, Crackle and Amazon Prime. The only thing that is lacking is the camera's. But even so it is good but not close to my V30. I use a Micro SD and an external iHome keyboard and mouse with a Sabrent 4-Port USB Hub I can even use this to print to my HP Laserjet printer through USB. The HDMI works perfect to my ASUS VG 248 monitor. The Bluetooth works with everything from headphones, earpiece, external speakers or Uconnect in my vehicle. The Wi-Fi is 2.4GHz only as best I can tell but it doesn't miss a beat. I am seriously thinking of buying another and so far I have no regrets at all and I would recommend this unit for beginners or pros. I do suggest that with most all devices with a screen to take out the accident insurance that was offered: Asurion 13 Month Tablet Accident Protection Plan ($100 - $124.99) that costs $10.65. Try it and be surprised:)\nSold by: Asurion, LLC $10.65 also this case. Infiland RCA 10 Viking Pro Premium PU Leather Stand Cover Case https://smile.amazon.com/gp/product/B01MXYHMCI/ref=oh_aui_detailpage_o06_s00?ie=UTF8&psc=1"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "my daughter is 8 years old. I loved the product but my insurance for this product never came"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "slow but the right color"}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "The screen too small"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Wish I could give it zero stars. Never worked. Piece of junk. Dont waste your time."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I got this today and I gotta say it's AWESOME. I WILL buy more of these. For this price this should basically be illegal lol."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "good to work with\neverthing was good"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "This will be a ongoing review of the viking pro. Had this tablet for a week now.  Every so often will I turn it on a little window pops up saying system no responding.  But I push OK it clears up.  First this is not and I mean is not a tablet for gaming.  It does play a couple of low graphic games OK but not any high graphics games.  I use the tablet for net surfing and watching you tube.  Camera hmm is just that there and front one is there.  However the placement of the front camera is stupid.  If you have the keyboard it is on the left side not the top. I will see if this plays videos from prime. The you tube videos are OK when playing them.  Speaker is OK.  My wife likes this she says it is better than her one tablet.\nNow keep in mind this is not for gaming,  but so far I like it myself and plan on buying 2 more.  will update as time goes on"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "I fully understood, going into this tablet purchase it was a cheaper tablet.\nPros: Keyboard, making it easier type; and a nice display.\nCons: It's thicker, even sans keyboard, then I would've liked. It feels cheap. Example being the power buttons wiggeled in the housing.\n\nThe main reason I went \"Nope, sorry you're going back\" was simply, during set up trying to put in the \"draw your pattern\" to lock it, took me five tries since it kept \"disconnecting\" my finger from the screen. Same with the \"repeat pattern\" then to throw out the three stock apps that I didn't want, took three tries to hold/drag to the trash bin.\nI don't have any neurological issues that result in me not pressing/removing finger from tablet. So this was all on the screen side.\nThe inability to trust a tablet to respond to touch was a massive no-go for me.\n\nCould've just been THAT tablet, but since it was brand new in box, I have no desire to roll the dice on another."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "I wanted to love this tablet.  It has such great potential.  I love the idea of it but it does have its flaws.  I found out it does not have the capability to pick up 5 GHz WiFi signal, only 2.4.  That's a bummer.  The screen looks like plastic, but I'm not sure, I was disappointed in that but after using it it does give a nice picture.  This thing was slow as molasses when I got it first set up.  It did hold a charge for about 6 hours.  It took 2 hrs 20 minutes to charge from 20 percent.  It took forever to download apps.  It was lagging a lot.  It was making me want to throw it against the wall.  I tried everything.  Went on YouTube and did the tricks to make tablets faster but nothing worked.  Found out not compatible with 5ghz.  Researched more on WiFi.  I went to my router page and changed some things around and read up on routers and realized that was my biggest flaw.  Updated my router, and changed the channel used and it became much better, not great but descent.  I realize now that living in condo and sharing channels with lots of people will slow you down.  Also I just don't have the fastest internet service if not using my 5ghz.  My router is getting to point where it could be called old.  I know this tablet could be faster with better WiFi.  Movies work fine, apps fine, some little slow to pull up, like amazon.  Any who I do love it and I found it at the price of 60 dollars so no complaints.  Absolutely love the hardware.  Love how it connects keyboard to tablet like a surface.  Overall I do love this tablet, just wish it could pick up 5ghz signal."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Great product"}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "Bought elsewhere. 1st one quit working after 3 weeks. Current one does not hold battery charge for more than a few hours, but takes many hours to recharge."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Wow...  This was a HUGE waste of time and money.\nSooooo slow...  It took 45 min to download the application I needed.  It took my phone less than a minute.\nDid not want to stay powered on.\nCase was extremely cheap.\nI would not even buy this for a child..."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "My daughter absolutely loves this gift"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "This product is perfect for my everyday life. It is portable, and has a long lasting battery for long nights of working on projects or just messing around on youtube. I love the two in one, using the keyboard to type up school papers, as well as using the tablet to port around with me and keep kids I babysit at bay. Over all, this is fantastic."}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "You get what you pay for. But don't buy it unless it's for a child or grandparent."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "This tablet is great especially for the price I love the keyboard and how it detaches the screen is very big making it easy for you to view things"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "My son love the tablet the fact he can separate it & take it with him then later attach the keyboard to do homework on it This was my second order because the first didn't work but Im glad I took a second chance on the product."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "good dealing kept me updated"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "It a good unit to set by my chair, but has a slow OS.  I very happy with the price I paid and use it all the time!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Awesome product & price!!!!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "great computer worth the buy"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Less than 90 days, the tablet has crashed several times with hardly any use.  It is not returnable after 30 days. :(\nWe have tried all the suggested repairs to no avail.  Will not buy RCA electronics again."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Advertised falsely less than 1gb of ram\nI was expecting 3.2gb it claimed 32gb but I know better but a missed decimal want unthinkable."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Will not turn on after a month."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "I like the style and weight of this tablet. I find it very slow in switching aps. The battery life is the real downfall. I have had one game ap open, a word game ap and in 2 hours he battery needs charging. Sure can't rally go somewhere to use unless I know I can recharge it."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Kept freezing, keys hard to type. Sending it back"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "poor quality!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I like all the features of this table"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I received my RCA Viking Pro about 4 weeks ago. So far, no complaints. It is small in size but not flimsy.  I use public transportation and it is easy to carry in my shoulder bag. I use it for homework mostly and to look at Netflix or Hulu."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Not the fastest, but still good for the money!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Great."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Very handy."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Says it runs on Windows 10 in the specs, but it runs on Android. I bought it exclusively to use a program that needs Windows 10. Not the fault of the product, but the listing should be cleaned up. I returned it and purchased an ACER One10 that does everything I need."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Purchased this for my 10 year old for Christmas... she absolutely loved it and its very user friendly for her."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "All the reviews were great on this tablet, so I decided to go with these for my girls for Christmas.  They worked great to begin with, and then out of nowhere they shut down and wouldnt come back up.  These things didn't even last a month.  My girls aren't young so there was no mistreatment to the products.  Within a week both just broke! And honestly, good thing I didn't purchase from Amazon because I wouldve been stuck with the crap junk! I bought from Walmart, so there was a 90 day return policy, Amazon normally only gives a month or so; which I bought these in November. Anyways, I do not recommend these these things to anyone. I have always thought RCA was a pretty good product...until now."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "My son loved it.  Good price."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Our grandson's favorite Christmas gift."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Neatest tablet we have bought in years. My 16 year old son loves it. All the ports and flexiblity anyone would like."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Very user friendly. My granddaughter loves it!"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "TOO SMALL EXPECTED IT TO BE BIGGER"}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "It did not come with a charger"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Very good service and shipping and the RCA Tablet is fine and works weell. ThanksVery Satisfied."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "This is a great little tablet/keyboard combo for the price. I have had it for over a month now and have no issues except even on the brightest setting it is very hard to use outside."}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "First the charger pin broke. Bought a new charger. 6 months after purchase it will not turn on. Like it for six months."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I have had this tablet for years it's better than a Samsung"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I am more than satisfied with my purchases from Amazon and I have no complaints to register for any of them."}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "2 stars for now. I've enjoyed the tablet so much yet I just got it on Thursday night, it's Sunday night and it's already not charging. I'm trying everything I can but I will be throwing a fit and returning it by Tuesday if nothing works!!"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "SOMEWHAT DISAPPOINTED"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "very unhappy with product and support.  unit was defective,  while typing letters would jump all over page.  sent in for service.  I had to pay return shipping.  it took a month to get  a replacement.  this too was defective. support wanted me to send it back for service again.  I said I wanted a refund.  they said they could not do it, service was the only thing they could do.\nkey board is too small to use, keyboard falls off.\ndifficult to set up.  hard time to get it to print."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Very good it was a gift for my mom for her birthday"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Product Died! Ordered new charging cable to keep the fix simple. No Go!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Fantastic coulor. My wife loves everything  obout it."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Decent tablet. Keyboard works well. Surface touch not as sensative as I would like, but good deal over all."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "It did not work when I got it . I have to send it back for refund."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Love it!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Love it. Easy to use."}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "It is poor quality.  Very slow upload of anything. No clear instructions packaged with the product"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Awful just awful Ive only had it for 3 hours and it will not turn back on and Ive been charging it for 2 hours!!!! Dont waste your money!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Good value"}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "Price should have been an indicator that it was probably going to be clunkier and more hiccups than competitor chromebooks that were double the price (or more).  It works, just touchscreen and keyboard require hard pressing and surprised how slow it ran out of the box."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "honestly its a good 2 in 1 tablet i mean its not a laptop killer but it definetly gets the job done"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "For the price, not a bad item at all. Bought it as a Christmas gift for 2 teenagers and they absolutely loved it. Camera doesnt take good photos at all, but its a tablet with a detachable keyboard..."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Not user friendly, and after one days' use it won't charge"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Great product. I purchased it for my 25 yr old daughter and she loves it. It's lightweight and she's able to tuck it in her purse."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "I bought this for my daughter for Christmas, I should have known it was too good to be true. 3 days after Christmas, the tablet quit connecting to wifi. Our other devices connected just fine so I know it was the tablet, I factory reset & it still didn't work. I am returning the tablet & will be purchasing something different."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "I bought this item here at Amazon this May 22, 2017. I am not happy with my purchase at all. I don't know why I waited this long to write, but here we are. This was supposed to be a nice present for my mother's birthday, and knowing that she is not an intense tech-user, I just wanted to give her something with a decent sized screen to be a tablet in which she could watch videos, listed to music, and be able to use quick office tools for light use. I have been disappointed completely, it is not what I expected at all. The performance of this device is just incredibly bad, freezes all the time, and it cannot even run YouTube alone decently, the sound is almost non existent. Every app opens and work really slow, it is so annoying. So my mother hasn't been able to enjoy this to any extent. It's sad. I lost my money, period."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Good, a bit slow but for the price is ok."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Small and efficient"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "I really like this so far. I can't seem to use any Amazon apps on it but it's my only complaint. They speakers are not great but ok enough for a tablet. I would give it a five star if Amazon worked on it. Also buy a case with it!!!"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "So fare so good. I am on it now writing this review. Setup  is easy. Size is convient. I can stick in my purse and go. You can whip it out during the day, response to emails, work online. So fare I am enjoying it."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Do not buy...... Touch screen won't work. Called RCA customer support and I've had better conversations with a tree after 1 3/4 hr listening to a a recording about how great their products are. Save yourself the grief."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "I would probably love it but when My husband opened it Christmas morning, I found a cracked screen. I am going to try and return it for a replacement and then I may give it 5 stars."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "So convenient.  Bought for my granddaughter and she loves it.  Small enough to fit in her backpack.  Powerful enough to play her games and apps.  Good for school tasks as well.  Not a real computer, but sufficient for her needs.  She's 12 years old."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "This tablet is perfect for my pre-teen. Small and appropriate for school work and fun tablet use! We like it a lot"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "It was what was expected, recommended"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "This tablet is REALLY slow. Can't even play games like fruit ninja without intense lag. Waste of money!"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Would not have bought a 5.0 Lollypop if it wasn't for a young, 7 yr old.  This young child will be using if for skype, movies and mostly games.  So it will be fine.  Loaded up quickly and everything else loaded up fine.  Apps, etc."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "This was the perfect purchase for my 9 year old! He needs a computer to complete his homework each night and since I was always nervous about him damaging my laptop I decided to purchase something that better suits his needs. I bought this in combination with a screen protector and case and it seems like it will last him a long time!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Purchased this as a present for a friend"}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "IT'S OK FOR EMERGENCY BACK UP, LIKE AOL EMAIL.  REALLY LIMITED GOOGLE, ETC., NO SKYPE SUPPORTED.  KEYBOARD TOO EASILY REMOVEABLE WHEN HANDLING."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Gave it to my daughter for her birthday and she loves it, so far no complaint."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I recently purchased this 2-n-1 laptop and I love it. The only thing that I do not like about it is that I don't know how to copy and paste with the keyboard attached."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "had a 7 inch tablet previously that i was also happy with, but finding a 10 inch screen & the fact that this tablet already came with its own keyboard fabulous! camera is great, sound quality fine. wifi pick-up could be longer range, but still fine, and coming with like 32 gb of memory (plus more if you add a little card to the slot, which i did) is soooooo much better than just 8 gb like my first tablet had. so much more room for fun programs! :) would totally buy again. :)"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Good deal for the money.."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "wonderful item but battery drains unreasonably fast"}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "Decent quality for the price. The OS is slow but bearable. Easy to add/remove the keyboard. Keyboard is cramped and difficult to type on. Charges quickly using the charger but doesn't have 6 hours of life - more like 4.\n\nI'll update as time goes on.\n\nUpdate:\nChanged from 4 stars to 3\nIt continues to become slower as time goes on. I have uninstalled some apps I had installed but that doesn't seem to have made a difference. After it's been powered on about 2 hours it really starts to lag and requires a shutdown/turn back on for any kind of speed."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Both 2 five months ago and one will not turn on or off and no details for a warranty."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "got here on time , great condition, runs alittle slow for a high Performance but nothing a little tinkering won't fix.\nWould by again if need be"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Got this as a early Christmas gift fianc loves it"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "great little laptop/tablet. a little slow to browse internet but only a little"}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "It is much slower than expected, and I cannot seem to manage the cursor correctly - it jumps all over the place. I was traveling so missed the return window, unfortunately. Very disappointed."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "Works ok but is plastic"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I like all of it."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "It's absolutely and completely everything needed and a nice large size."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "very good basic tablet, works well connects to web fast"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Charger broke, key fell off. Got a new charger but it does work right. If I still had the box I would return this piece of trash."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I puchased this a few months ago and I'm very satisfied with it. Does everything I needed it for and is much less cumbersome than my laptop. Great price too!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "It seems to be a great tablet, I had the 7 inch, it sill works too, but I thought it would be nice to have the back camera function too & more memory. I didn't remember how to tell it to store my office documents on the SD memory chip, but I copied the Lost Directory to the new SD & now both have all my files. I downloaded some great scientific calculators on it & tell stories on the SD memory chip & I take a lot of pictures too."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "This is the biggest waste of money. I recommend spending a little more and getting an iPad or cheap laptop. This is terrible and incredibly slow. All this is going to be used for was browsing online and I can barely get it to load chrome. Horrible product."}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "The keyboard lasted around 4 months before it randomly just started inserted the letter 'e' whenever it wanted yet when I hit the 'e' button nothing happens. Guess I'll have to shell out more money now for a new keyboard? Just buy a real tablet."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Ready to go right out of the box. Easy to set up, google operation. Tablet removes easily, keyboard functions well."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "VERY nice tablet. great price, and good quality."}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "Can't stand to touch the screen and nothing happen. If I had known it would be so slow to process simple requests, I would have certainly looked for another tablet - even if it was more expensive."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "In order to save time, I'll list the pros and cons of purchasing this device:\n\nPros:\n-Large screen\n-Comes with a keyboard!\n-Runs android, and easily connects to the internet\n-Zero lag when running 7 games simultaneously\n\nCons:\n-Comes with a surprising amount of preloaded software\n-Not easy to root (I broke mine in an attempt to do so), thus preventing you from using things like Cyanogenmod\n-Cheap-feeling plastic exterior\n-Can't find recovery images ANYWHERE- you break it off of an insurance plan, you might as well buy a new one.\n-Speakers are the worst ones I have heard on a tablet. Use a bluetooth speaker or headphones instead.\n\nIn all, the \"Viking Pro\" 10 inch tablet is a decent tablet, though low-end. It makes for a great burner device for school or a perfect gift to a child. For more intensive computing needs, get a higher-end tablet or a laptop."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "My son loves it! He had one and he dropped it, so I bought him another one. He never leaves home without it!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Love it"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Nice works great"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "wonderfull product"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Great product at a low price. My 7 year old son downloads apps and streams youtube and netflix on this daily. If he's happy, I'm happy"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Great product."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Gift for my daughter and since she's had it she's used it a lot. No problems with this tablet and lasts for hours on battery. She doesn't have any complaints with it at this time and its been about a year give or take."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Stopped working after just one week of use."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "It's an okay tablet for the price. Nice big screen, fast enough for watching videos, skyping and browsing. If you don't want to spend more than a $100 on a tablet, this one is a good deal for you. I bought it only to browse social media pages on it and watch movies and TV shows on Kodi program."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Excellent tablet with a good sized keyboard. Very well made. Easy to use and I'm very happy I chose this tablet."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Good quality. Got it for my wife. She isn't a fan of smartphones or computers. She is pleased with this."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Great back up when my main pc is down"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "The dock isn't much but like the tablet fine, good stuff"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Battery gets very HOTafter a short period of time. Also the power cord has a lot to be desired, it feels like it will break off a very soon."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Didn't work! Waste of money"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Ordered at the end of July stopped working at the end of Sept. Almost half the touch screen stopped working and weeks out of warranty period....lightly used and only left the house twice so not beat up just stopped working."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I love this Tablet!! Easy to use and its delivery was better than expected."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "I just opened the box and noticed MANY-MANY-MANY Cracks in the screen.  The shipping box was fine but the product was so severely damaged I just re-packaged it and sent it back.  I will order another one but I hope the one I get next time had been to RE-HAB for its CRACK ADDICTION!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Excellent"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "This product doesnt even deserves a star. Purchased this and it doesnt work need software  change and a host of stuff. I don't recommend anyone to buy this."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Terrible tablet, it lasted 3 months before it would no longer turn on. Replaced it and the second one did the exact same thing. 3 months then dead!"}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "I got this tablet as a Xmas gift Dec 2015 - it seemed ok at first but it kept slowing down more and more with use.\nThe battery used to last about 4 to 5 hours in use but only last about 2 to 3 hours after a year I gave up on using it for a replacement laptop -I got it to replace an old Dell D410 that was just getting to slow even with Linux on it. So I really don't recommend this tablet- My Alcatel cell phones are faster lol\n1 gig of ram is not enough for anything these days.\nI suggest spending a few more dollars for something better."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Great for the price"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "great"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "ok."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Charged me twice for one tablet."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Can't even get on the wifi"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "When I open my box I was happy. I haven't use it yet but I know I'm going to be happy with the 2 in 1 because I had an tablet from y'all product."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "It's good for browsing and casting\nProcessing is good\nStorage is good\nCamera sucks"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Excellent tablet.  Very reasonably priced.  Does everything I need."}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "Bought this as a birthday present for my daughter. Would have given more stars, however the actual box it came in was extremely damaged and tablet didn't appear to be NEW as claimed whenever we opened it."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "My son enjoys it emencly.  Great graphics good download speed"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I love it.  I didn't have a laptop or a tablet and now I have both...all in one."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "top notch products at an outstanding price"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Works pretty well.  Turns off to often"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Very pleased."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Bought this for my boyfriend, he loves it."}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "So this was a gift for my mother and it seems that after four months of everyday use, the battery no longer holds a charge for more than 40 minutes. I am sure there is a manufacturers warranty, so hopefully my Mom kept the documentation that came with the device as it was brand new. I will update this review with the results of my attempts to get this issue resolved."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "This was one of those products that was cheap and underestimated because it fits every little need it's your night time go to streaming device I can play Netflix and high quality 720p they can play movies without stuttering judder and can play music and games and do plenty of browsing and the keyboard works just great with all the shortcuts it's a great system I would recommend it for the price and if you want something different I would recommend the RCA Windows 10 version also I would recommend this product to anybody I'll give it great reviews coming from Nexus 7 and other quality products it's cheaper alternative that everybody should own"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "I ordered this RCA Table for my husband.  Just the right size and so easy for him to use.  He is not really a computer  person but he learned the workings of this tablet right away.  Would recommend this tablet to a friend."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Worse tablet I ever purchased, didn't load videos correctly, when auto rotate was off it be still rotated, other than the amount of storage on the device being somewhat efficient, nothing else worked as it originally said and I wouldn't recommend to anyone buying this device, spend a few extra dollars and buy a Kindle fire or another well known brand because I only had my tablet for 3 months and I feel like I was robbed and what replacement warranty I wasn't offered one and at time of purchase there were no offers of any kind,, this product Sucks!!!"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "I'm rating it reasonably high because it has performed well so far and is my first Android tablet. It was one of the lowest priced for a 10-inch android tablet so it's not fair to expect it to outperform tablets that cost two to three times as much. I use it to run an aviation tool and find the battery runs down in about an hour which is sooner than I would like. Some of my friends say theirs lasts far longer. I'll be getting external battery to fix that. Otherwise I've been happy."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "great item perfect for travel!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I love this tablet cause it has more space on it better than any other tablet that I had order"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "love it using it now"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "My son is 11 years old and he loves this tablet / all most computer :)\nGreat for the money and he is happy ! Good buy"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "I usually don't leave negative reviews - I'll put the energy into a review when I REALLY like something, but the activation energy for negative reviews is usually too high.  I just feel that I owe it to others to offer my warnings about this paperweight.\n\nI thought I was being conscientious by going online and finding an independent review of the RCA tablet - the one I found (a vlog) was apparently done by someone on the take.\n\nSo, yes, you get what you pay for.  The reviews say that the sound system is poor - that is true, but it's about what you'd expect for a $100 tablet.  The video resolution is adequate if you aren't too worried about high def.\n\nBut this thing is  S  L  O  W  !  !  !\nWhen I use it (because I'm too cheap to buy another one for at least a year after I spent $100 on this one), I turn it on and then put it down, pick up my phone, and play a word on Words with Friends.  After that, it might be ready to use.  Then I click on an icon, maybe my email.  Put it down, go to the kitchen to get some more ice in my drink, chat with one of my adults-living-at-home-children who happens to have arisen from the deep for a brief period, then go back to the tablet to see if the email app has launched yet.  Probably not, but I needed to pee anyway, so I go take care of that.  Speaking of which, if you use your tablet to distract you while you undertake more extended activities in the bathroom, forget about it, unless you opt to cut out all fiber and fluids to make those visits considerably longer.\n\nOn top of being slow, or maybe related to that issue, it freezes up for extended periods.  I might be in the middle of tapping out an email, and it will freeze for 221 seconds or so (I counted one of them this morning), then a message will pop up saying \"Outlook app is not responding.... close it?  wait  ok\".  If you are unfortunate enough to actually own one of these, I suggest selecting \"wait\".  You've got about 75% chance of it coming back to you with your partially completed email intact, so it's better than closing it out and having a 100% chance of losing it.  Oh, and forget about playing any type of game that has a time factor.\n\nSometime during the next 11 months I'll conveniently leave this thing somewhere for another poor sap to find, mysteriously having erased all connections to my personal accounts.  Then I'll do a bit more research before I buy a new tablet/pad."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Got this for my 8 year old it works good and have no problems for the price this tablet can't be beat."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "takes a little getting use to.  works just right.."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Wonderful:)"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Description said Android 6.0 (Marshmallow), but it was 5.0 Lollipop. Sent back."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Product received was new as described, and on time.  Kathleen"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "The tablet falls off the keyboard way too easy after a week or 2 but over all it's a really good laptop for the price and the weight to it feels nice"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Oh ya I will never this junk tablet or whatever they call"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Been almost a year. Granddaughter loves it."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Needed a portable laptop in a pinch and this worked great. It is slow but manageatasksIts great for things like surfing the internet, doing word docs and simple apps.\nPros: portable, cheap, good for simple tasks, decent battery life\nCons: slow, closes programs at randon, not a ton of storage"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "as advertised"}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "I really love this except for one major flaw. I'm used to using my right pinky to shift and this has the shift key way too far to the right.  Should have eliminated the up and down keys and put the shift more in the position where it is on a full size keyboard.  I love it as a tablet but I find it nearly impossible to type on."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I had one for about a year when my cat knocked it off the nightstand, and I will only replace it with another one. User friendly, great picture, and stores a lot. Always happy with my RCA Viking Pro."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Bought it for my sister-in-law for Christmas.  She never had a tablet.  She absolutely loves it and takes it wherever she goes."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Terribly disappointed in this tablet.  I bought one for my son for Christmas.  It worked okay, but the screen cracked within a few weeks of getting it.  I tried to have it replaced/repaired only to discover that it cost more to replace the screen than I paid for the tablet.  I replaced it with another one just like it from the same seller.  That one worked for a week and then would shut down within 5-minutes after my son turning it on, even then the device was fully charged.  After wasting close to $200, I'd just as soon buy him a new iPad mini.  I would not recommend buying these refurbished devices with limited warranties.  You get what you pay for."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "It was exactly what my husband needed."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "Specifically ordered this model from this seller vs others since it was advertised as coming pre-loaded with Android Marshmallow (6.0). Upon opening the box, all printed details on the box state the item is loaded with Android Lollipop (5.0). A small printed sticker is placed over the barcode that states it is Marshmallow, however, upon booting up and setting up the device, I confirmed that it is indeed operating on Lollipop (5.0) with no available update. Somewhat disappointed, however, since the device was purchased as a school requirement for my son who is in 5th grade, it will work just fine.\n\nThe tablet itself is fine, keyboard is handy, and will work well for what he will probably be using it for. Decent quality low-budget tablet."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I couldn't be more please.  Definitely worth the money. Would recommend to anyone.  It's taken many tumbles (little ones have gotten their hand on it) and it just keeps on going."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "This \"tablet\" is a total joke. You have to try numerous times to get it to respond and runs ridiculously slow and I have tried several different WIFI connections.  Do not buy.  Just throw your money in the trash."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "just as stated and came quickly, perfect for our 9yr old, heck thinking of getting one for myself."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Nice tablet, but the keyboard stopped working."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Worked great rite from the box"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "This is an RCA Viking Pro tablet and we love its size and performance. Have used other inexpensive tablets and they glitched out rather quickly. This one is definitely a favorite."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "SUper laggy returned it"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "The screen is fine, but the keyboard came with some defects. The t button doesn't always press on the keyboard. It slow to reconnect to wifi after being left idle. So far that's been my only issue, and I can deal with that. I've already dropped it a few times and it hasn't lost any functions."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Love this tablet. The keyboard makes a big difference for typing."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "The keys keep popplng off!!"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Product did not work when it arrived.  I purchased this as a gift for my mother's birthday and was totally embarrassed and upset when it didn't work."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "good"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "For $103 this tablet does a fine job, no complaints."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I purchased this RCA Tablet a couple of years ago and it is still working as well as it did when I purchased it."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "We have fell in love with these tablets. They are light weight, easy to navigate, holds charge great and connection and capabilities are excellent. We purchased one and within two weeks purchased the second. Very satisfied."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "started out great, easy to use good picture quality, did what I needed. Battery life poor, but I expected that. Today, after owning it for 2 1/2 months it completely quit. Won't turn on, at all. Back to square one. Stay away! I should have!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "works great.."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Great for the price. A little slower than others but does everything I need. The detachable keyboard works great."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Great item , Also Nice Looking And Very Easy to Use."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "great little tablet !"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "At first I thought RCA really? The sub-par TV manufacture? Then I read other reviews and thought, what do I have to lose? We've purchased over a dozen of these for our students to view books, report hours and manage work documents on and so far so good. It would be nice if they had a little more battery life, but depending on how you are using it I suppose it is pretty acceptable.(5-6 hrs) Haven't had one yet that did't function out of the box like it should, so that's a plus. I'd say it's a hard device to beat if your not looking to spend much on one. I'll probably get my granddaughter one of these for Christmas to play games on, because the seem to be pretty sturdy as well. We'll continue to purchase them in the future unless something better comes along. 4 out of 5 stars only because of the battery."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "In general it is a good tablet, the only inconvenience was the screen glass, it is not very resistant."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "It's a little slow, but for the price range I imagine that's normal. For the price it's pretty amazing, I'm happy with it."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I love it.  It's great to have a keyboard.  So much better than a phone for movies."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Up until now I have always purchased the more expensive tablets. This thing is super fast everything works perfect I cannot see me going back to the four and  $500 tablets again after owning this"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Very good"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Yes I love it. Thought it was bigger than it is, but I do love it."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "I bought this item specifically to be able to take pictures and then upload them for work purposes. The quality of the camera was horrific. I had not looked into the camera quality before purchasing. By the time I realized this, it was past the 30 days. Unfortunately I am stuck now with 5 of them."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "It doesn't work it worked for about a month and now just a black screen very dissatisfied I don't know what to do if it had any kind of guarantee or not"}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "its a good value but the video hardware is outdated, causing my favorite game app to not run."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "True value for money, suppassed expectation."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "very pleased with product...as described"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "great item"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Tablet is awesome, but delivery took forever"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Great product especially for the cost! Love that I can separate keyboard from tablet and feels more like a laptop when I need it."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "It works better than I expected.  I haven't had any real issues.  I do find this takes quite some time to warm up when I power it on."}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "I bought this to browse the web and read books. It is EXTREMELY slow opening apps, turning pages, etc. I have had it for a while and love the large screen, but I have factory restored it a few times just to clean off some of the apps I've installed, to see if it speeds up, it does not."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "My son loves this tablet.  He can use it like a small laptop or to play games on it like a tablet.  I like it so much I bought a larger one for myself."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "this tablet was bought for my daughter. It very quick, easy to dettach, almost like a netbook."}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "batter backup is poor and it takes lot of time to charge the battery."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "exceeds my expectations"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Loved it, speed is great, my grandson enjoys it, perfect for on the go. Easy to manage"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "MUY BUENA"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "This tablet is great!  The small size and weight coupled with USB and HDMI connections & max 132GB storage allow me more flexibility when traveling locally and away."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "Was not expecting iPad quality or features and wasn't disappointed. I just wanted an inexpensive tablet for viewing downloaded Netflix shows on the go or in bed. It does strange things almost every time I use it, like stopping playback and returning to previous screen all by itself. The most frustrating is not responding to either finger or capacitive pen touches. Or, I'll touch an option, the popup will close, but it doesn't complete the action. I've had to try sometimes as many as 5 tries before it with respond properly. Other times, I can touch it several times before it responds at all. Nut, like I said, I wanted a cheap 11 inch tablet and that's exactly what I got. On the plus side, and this is another reason why I bought it, is it has an HDMI out to connect to the TV, so I can also watch Netflix on my bigger screen since I don't have unlimited data on my internet provider. I can download some shows and movies at free wifi hotspots on the tablet and watch them at home. I'm just hoping it holds up for a year or two."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "It's great and easy to use. Also like the keyboard"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "This is not a goof machine . It's super slow that I can't do nothing on it"}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "When I received this item the table would not work unless the keyboard was plugged in and even then it worked every now and then.  I sent this item back"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "love this table and good price"}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "I bought this item based on the 4 star rating. I have had it for almost 12 months.\n\nThis is not a good tablet.\n\nHere is a list of my issues that it had from the first day:\n-Extremely Slow ( I have performed several factory resets and nothing helps, I have almost no apps installed).\n-Takes more than 12 hours to charge to a full charge and drain very quickly.\n-The mouse on the keyboard functions partially.\n-Over all not a good product to use.\n\nMy final comment would be that the product is very slow and not really functional everything takes a couple of seconds to open and minor commands would make the tablet just hang up.\n\nI really wish I could exchange this device for a faster device more stable device."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "its a great for when I go to work or on a trip!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Better than expected .You should get one"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Its a good start out tablet for kids."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Worked fine for about 2 weeks, then it would not hold a charge. I had to travel and could not take care of it right away.  Came back contacted amazon, is 6 days past the one month return period, so they cannot help.  Contacted RCA directly to see how they respond.  So far tablet dead with 15-20 days of use.  That is what I call low quality."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Good tablet for the price. It can do everything I need it to, which are admittedly simple tasks.\nMy only complaint is that it seems slow at times."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "love it"}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "The keyboard makes you keep typing things over. The lightning screen button does get the brightest. Over all, it's okay for the money. It does not connect to certain wifi."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Gave it  to my mom as a gift and she loves it. Its not as fast as brand new tablets but it definitely works for paying bills and so on while you're on the go."}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "As other people stated, mine completely stopped working after a month. And only used it a few times. The screen said it was re-booting and then would go all black. Tried the factory reset, and everything possible to fix it with no success. However, I had it under warranty. But it took almost a month before I got it back. The only thing they told me was they would try and fix it and if not then they would replace it. So I got it back and I've used it now for a few months ( about 15 times) with no problem so far. I purchased this tablet for 2 reasons. 1. It had good reviews overall and 2. I bought this for half price on a Black Friday sale. Maybe I just got a bad tablet becuz I see a lot of ppl seem to like it. But thought I'd share my experience. Just becuz it stopped working on me after a few times I personally would not recommend this to anyone."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "will more then get the job done .. I bought it for a travel tablet in the RV - will use it like a smart phone but without the bother of voice calls."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "my son and I got this, and we love it"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "good computer good price."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Product came with someone else's information stored in it. I cannot even get it cleared to use it even after doing the complete reset."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "DOES LIKE IT SAID IT WOULD"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Still trying to get acquainted with the new tablet. Love the keyboard though! Very nice product."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "This tablet is amazing...LOVE IT!!!!!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "received in great condition and as promised"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "The worst tablet ever ir lastima a week! Its nota working at all .it brake the screen and ir totally stop working i can t Even inlock screen"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Item arrived on time and ready to be used right out of the box."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Not only does it not work, I cannot print the outside label to return it"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Very fast and easy set up. Works great. My son loves it."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "Keyboard is too small and is only useful for a stand."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I love this!!!!! I logged in on my bf account and got it for school. Now my bf want the tablet went up $25!! He's jealous!!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "!! Good mini tablet !!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "got this for my grandson when he comes over and he loves it. He plays all of his games on this."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I have had my tablet for several days and I love it! Be sure you get the 6.0 version. It is much faster and has more items in the store. I got mine at a local store for pickup the same day. You can run Microsoft products for free! You can download the apps and not use the cloud. Also you can print on a regular classic printer or print from the cloud. Nice to have a choice! I noticed someone complained that there is not the 360 hinge on this, which I think is a plus. I like this better. It gives you the option of using as a light weight tablet stand alone without the keyboard. I own a 360 device and I like this option better. Its very quick to switch to different position. You just remove, flip screen reverse and you are ready for tent mode, or stand mode, or tablet mode You get all the positions that you get from the 360 mode with the extra option to remove the keyboard. More flexibility. Nice while traveling by plane. Give it a try. I use mine more than the expensive 360 device. Sound is louder than my other device. Screen resolution the same. I can run more apps on this than my other device! A no brainer!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I actually have two of these that I got on Black Friday two years ago and I have to say that I am pretty darn impressed with them.  I use one mainly for heavier work; word processing, on-line sales, and the such.  The other is more my entertainment one, as I have been loading it with movies from flixster and vudu.\nI had been concerned that I was running out of space on my movie one as I had both the built in memory and the 32 gig card full.  I had read conflicting reports about running a larger memory card, so I decided to give it a try.  I bought a sandisk 64gig card, powered off this tablet that I am using right now, popped out my old card and popped in the new and powered the tablet back on.  I then went to the settings menu, then storage, but it didn't see my new card.  I told it to mount and sd card, it saw the card but said that it was formatted wrong and asked me if I wanted to format it.  I told it to, the tablet formated the card, and promptly told me that I had successfully installed the sd card and that it had 59.4 gig of space available to use.  Where did the other 5 gig go?  Who knows.... but I am now going to see if I can get a 128 gig card and try it.  I expect that should work just fine also.  By the way... I am running Android 5.0.1 right now.  So this thing is bone stock.\n  My only real complaints now are that my heavy lifter tablet is starting to have a fairly short battery life, 2-3 hr, but I have spent a lot of time using it while charging it and gotten it pretty hot several times, so that is more my fault.  That also probably explains why that one is slowing down some as well.... heat tends to kill the processor.  Again, my fault.  The other complaint.... when I go to use a real computer or laptop, I start trying to touch screen stuff all the time like I do with my Vikings!!!!  OOOPPPSSS!!!\n  I also like the fact that it has a full size USB port, a micro USB port, a seperate charging port, and some goofy HDMI port that is kind of hard to find the cable for.....  But hey... it has bluetooth, will supposedly cast the screen, I have never tried, and hooks up well to my WIFI and is reasonably fast with not a lot of hangups in it.  I have dropped both of them multiple times, crammed them into backpacks and knocked them around, and basically not given either of my Vikings an easy life, and they are both still kicking.  So yeah.... I very much like and recommend them."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I actually have two of these that I got on Black Friday two years ago and I have to say that I am pretty darn impressed with them.  I use one mainly for heavier work; word processing, on-line sales, and the such.  The other is more my entertainment one, as I have been loading it with movies from flixster and vudu.\nI had been concerned that I was running out of space on my movie one as I had both the built in memory and the 32 gig card full.  I had read conflicting reports about running a larger memory card, so I decided to give it a try.  I bought a sandisk 64gig card, powered off this tablet that I am using right now, popped out my old card and popped in the new and powered the tablet back on.  I then went to the settings menu, then storage, but it didn't see my new card.  I told it to mount and sd card, it saw the card but said that it was formatted wrong and asked me if I wanted to format it.  I told it to, the tablet formated the card, and promptly told me that I had successfully installed the sd card and that it had 59.4 gig of space available to use.  Where did the other 5 gig go?  Who knows.... but I am now going to see if I can get a 128 gig card and try it.  I expect that should work just fine also.  By the way... I am running Android 5.0.1 right now.  So this thing is bone stock.\n  My only real complaints now are that my heavy lifter tablet is starting to have a fairly short battery life, 2-3 hr, but I have spent a lot of time using it while charging it and gotten it pretty hot several times, so that is more my fault.  That also probably explains why that one is slowing down some as well.... heat tends to kill the processor.  Again, my fault.  The other complaint.... when I go to use a real computer or laptop, I start trying to touch screen stuff all the time like I do with my Vikings!!!!  OOOPPPSSS!!!\n  I also like the fact that it has a full size USB port, a micro USB port, a seperate charging port, and some goofy HDMI port that is kind of hard to find the cable for.....  But hey... it has bluetooth, will supposedly cast the screen, I have never tried, and hooks up well to my WIFI and is reasonably fast with not a lot of hangups in it.  I have dropped both of them multiple times, crammed them into backpacks and knocked them around, and basically not given either of my Vikings an easy life, and they are both still kicking.  So yeah.... I very much like and recommend them."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Great tablet. Arrived fast and works great!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Very nice setup! Well worth the price. Can't believe it is as low cost as it is."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Was going to use this for a project I have to finish soon. So opening this up made me very annoyed, and that's saying it politely."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Didn't even last one year!"}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "breaks easily"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Do not buy waste of money. I bought three of them not one works. The first one gave me a green screen with lines in it. The second one the operating system was flawed it just did what it wanted to without keyboard or touching screen. The third one doesn't come on the thing powers up on occasion but then you turn it on (pressing the power button)and the thing doesn't come on."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I just go my package and so far I'm really enjoying it! It's perfect for writing and working when I don't want to use my large laptop, it is able to use Microsoft word which is something I haven't found in a lot of other tablets and what sets this one apart for me. So glad I purchased this item."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Decent piece of equipment for the price.\n\nPros:\n-Good resolution\n-Clear sound (actually better than some laptops)\n-Easy initial set up\n-Connects/disconnects from keyboard easily\n-Can use touchscreen while keyboard connected\n-Has front/rear cameras\n-Not heavy\n-Sturdy build\n-Easy to read keys\n-Round power plug instead of micro UBS\n-Will support additional 32GB SIM card\n-Good battery life but would suggest keeping it plugged in if streaming video or online\n\nCons:\n-When multiple apps/Windows are open there is no \"close all\" feature/icon\n-Does NOT support all games/apps on our Samsung phones and Lenovo tablet\n-All ports and power button on left side (not big issue for us but may be for others)\n-Volume control on keyboard only (it is possible to adjust on tablet when they're separated)\n-Hyper sensitive finger pad that if brushed by anything may change what you're doing (got used to it quickly to avoid issues)\n-Came with space taking Wal-Mart and Sam's Club apps (we deleted them)\n-Wouldn't suggest giving this to children under 8 years of age (make sure child is aware of product and uses common sense when detaching keyboard)\n-On/Off button is small and it takes a couple seconds to power on\n-No % power battery display, battery icon only\n-Camera is 2 megapixels (don't use it, so no biggie for us)\n\nWe ordered this because the micro USB power port in the Lenovo Yoga tablet became loose and wouldn't charge. We kept having to push it in and put weight on one end in order to charge it. Was very pleased to come across this tablet. The power supply, Android friendly, size and price were the selling points. We use it for entertainment only like Netflix, YouTube and a few game apps. We were very disappointed to find out that we couldn't download some apps that we use frequently. Regardless, it's a nice tablet for the price and we'll be keeping it. Nice to see RCA still making products.\n\n**DO YOUR HOMEWORK IF YOU PLAN TO DOWNLOAD APPS!!!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "great I love it"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Great for movies, internet. I do not care for the keyboard. It falls off and some keys are in odd places, not qwerty. But you can type o it in a pinch. I use it more as a touchscreen tablet and leave the keyboard off. Could use a stand for movies, and a longer power cord."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "bought for my daughter, she says everything works perfect and loves it"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Only had for about a month now, but so far it's been great.  Better then expected!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Very simple and easy to use. Bought it as an anniversary gift. It was in the box. No scratches, dents, or cracked screen. Has an HDMI port, a flashdrive port, and one other that I am not sure of. You can still touch the screen when it is connected to the keyboard. It is easy to attach and unattach the tablet. It feels like a magnet type, but it has has ridges on both the tablet and keyboard that locks it into one another. If I had to say something bad I guess it would be you can push the tablet part back a lot like you can with a regular tablet, but we really don't mind. I am going to get a second one for myself! I think schools should use these instead."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "So far we are very pleased with these tablets! They were bought for our children. They were on the cheaper side of things and the kids were between wanting a tablet and/or a laptop.. This made them happy.\n\nMy one issue is that 1 of the tablets was manufactured 2015 while the other 2 were 2016. No big deal, except that the 2015 one has a few quirks.. Like certain games that work on the 2016s, say incompatible on the 2015. And while the 2016s are running Android 6.0, the 2015 is on Android 5.0\n\nIt's slightly frustrating, but not enough for me to scream about. As I said, so far - they work and the kids are happy."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I'm really pleased with my purchase thus far! It works great with my WiFi. The keyboard takes a little getting use to - gotta keep your wrists off of the pad or the cursor jumps. And I had to remember, it's also a touch-screen, no need to scroll with the arrow keys! LoL =-) ... After I've used this a while, I'll try to remember to come back and add to my review. But for now, I'm TOTALLY satisfied!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "great rca to run ubu on thi"}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "I bought two of these and paid $75.00 each.  One for my daughter and one for me.  It was our first tablet purchase so we didn't want to spend a lot of money.  My daughter's works great and is a good basic tablet.  Mine is slow to start up and sluggish at best on internet sites.  We both live in the same house so use the same wifi connection.  I like the design and the ease of use on this tablet but I think I got the \"slow one\" and my daughter got the better one.  Since we only paid $75.00 for them I can't complain.  Now mine is having trouble charging.  I have to jiggle the power line to get it to stay in the tablet.  Then it charges pretty slowly.  I'm sure I am not getting a good connection.  I don't use the keyboard at all like I thought I would.  I usually am using this table when I'm in bed at night so the keyboard is not very comfortable to use lying in bed.  We purchased a different cover to allow the table to prop up, it won't do that with the keyboard on it because the little \"leg\" that is attached to the cover is pretty weak.  You only get one angle with the little leg too.  All in all this is a great learner tablet for two novices.  I'm 68 and my daughter 49.  We mostly use our laptops for the internet but I have enjoyed having a tablet at night to browse the internet.  I like the 10 inch size because I like browsing decorating sites.  Smaller tablet would not give me as big a picture.  So if you are looking for a good beginner tablet I would recommend this but next time I am going to upgrade.  And as a side note my daughter is not having a problem with the charge connection.  Hers is fine, it's just mine.  Must be a manufacturing defect of some sort."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Awesome. It is cheap and good for games and YouTube"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Great little tablet and hold a good charge.  You can set up 2 profiles so we can both use it, easy to download wifi printer. Does everything and more than my Chromebook.  Price was excellent, so I can travel with it and not go nuts if something happens to it."}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "So many bugs :(."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "It was a good tablet while it lasted. It was as fast as you can expect from a 90 dollar tablet. It was all great until I dropped it on my leg from about 6 inches and it broke the screen and it no longer responds to touch."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Just love it.... excellent purchase at a great price."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "Bought this to take photos at photo booth. Photo quality poor. Disappointed in that, but works well to send email etc."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Just terrible, it keeps freezing and the slowest computer I have ever had. Even slower than dial up! Would NEVER let anyone buy one if I can help it. I wouldn't have given it any stars."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Not bad for the price"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "owned this tablet for seven months. it has lines running through the apps and only half a xcreen is coming up. if you but this be sure and get the extended warranty. otherwise your money is thrown away."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "it was a gift and I haven't heard any complaints so its all good. As far as I know, everything is working fine."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "It was a great thing to have."}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "Very small screen. It has an ok resolution, but it isn't very touch responsive"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Bad video quality and turns off for no reason worst amazon purchace i ever made"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Excellent purchase"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Purchased as a gift for our daughter, arrived on time, perfectly packaged.  She loves it, would recommend to anyone."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I love this tablet I get on Amazon every day with it Very easy to use download games and everything excellent"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Very difficult to set up.  Asks for Google account information; not just your Google email, but your name (not password) to verify your account.  Which didn't work, despite retrying several times.  Don't try to tab between fields here, \"tab\" means go to next page.  The keyboard has a touchpad, which is nice, but the click action of the touch pad is way too sensitive.  Try to move your cursor and it thinks you've clicked.  It forces you to sign in to a Google account; I have several, and it kept saying \"There's no Google Account with the information you provided\".  I double checked my name spelling on every account (never know, maybe I did \"Mike\" instead of \"Michael\")... no joy.  Had to create a new account, what a waste.\n\nSet up is REALLY LENGTHY.  Don't expect to be using this notebook quickly.  It wants you to answer myriad questions, agree or decline various invasive and privacy-unfriendly options, etc. before it actually lets you use the tablet.\n\nEventually it got to the point where it kept asking over and over again  if I wanted to add any more email addresses.  I kept clicking \"Not now\" and it would come back to the same screen, asking me to add more email addresses.  Boy, they really want me to give them my email addresses! You can't seem to get past this screen.  I finally turned it off.  Maybe I'll try again tomorrow, or maybe I'll just return it."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "It will not stay on. It says auto reboot and restarts everytime I turn it on."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Worked for 3 months. The company that sells it will not help me even though I purchased a 2 year warranty."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Great upgrade for me.  Had a much older tablet (Android 2.) which this replaced.\nVERY handy to have a keyboard, and that it separates easily is a bonus."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Had I known I could not just plug a USB  cable to my Windows computer and use the computer's File Exploder to access the files on the tablet, just like I do with my Android phone, I would have not bought the tablet"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Excellent little tablet. Great condition. Great price!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I cannot say how well it will be working in a few months (several folks seemed to have had longevity issues) but so far, it is a surprisingly good little device.  I read the reviews from folks who seem to be disappointed that this tablet, which is at the low end of the cost spectrum, is not a solid device like the ones at the other end of the price spectrum...  seriously?\n\nI am and IT manager by profession, and I have to say this is the most I have enjoyed a new piece of tech in quite a while!!  I even used TeamViewer to remotely control my desktop with this just to see if it could......  worked great!\n\nIf you want an ultra light, super high res laptop, buy one.  This is a great little sub-$100 (walmart) tablet\n(p.s. The pretty decent feel of the keyboard was quite a surprise)"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "I only have complaint the wifi does not support 5g cnnections.  it is ugly but serviceable and a good value"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Awesome works great and lots of memory to store all my movies on it and a real keyboard"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Great item. I have bought 4 of these at different times for grandchildren. Very sturdy."}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "Frustrating.  Bought this to read newspapers and books; and read my emails, etc.  While I have very fast wifi, this unit is frustratingly slow loading and moving around in publications."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "it is dead! only two months!"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Really like it, but the keyboard is pretty heavy and cumbersome."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "They r great but one of them just turns off and on and isn't charging"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Love my tablet, use it everyday."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Don't buy this. It stopped working less than a month after we got it."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "It's been great for me! The only complaint I have is the cord that came with it didn't work so I had to go to the office store and buy new one."}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "Not easy to use"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "GREAT"}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "The camera quality is cheap. But that's what to expect."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Bought this for my grown daughter as a Christmas present and it lasted for approximately 2 months. It hasn't been dropped or mistreated in any way. It just simply quit powering up."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "love Love LOVE my little laptop-looking tablet! Everyone that sees it, wants it. No one believes it was such a bargain! The only issue i have is the not-so-great speaker, but an external, bluetooth speaker does the trick. I don't need eardrum bustin' bass or 'fingernails on the chalkboard' treble anyhow, just enough volume to Facetime or hear a movie/watch tv from my app's.\n\nAs with any computer/IT device, much depends on the internet service you use. For surfing the web, my little Viking Pro tablet just zips right along! But even when it's offline, it handles all the apps I have installed with no problem. I have a good anti-virus that also cleans up needless files, etc. to make sure it runs smoothly.\n\nThe only other issue I have is that I like to listen to sleep/meditation tones when I go to bed, but there is no customizable timer for the display. It's either 10 mins, 15 minutes or 30 minutes, and the display goes off and shuts down whichever app I'm running.\n\nStill and all, would I recommend? Youbetcha!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Great product  works great . the only problem is the screen off button should be some were else are not there at all."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Its okay. I got this for my lady friend, and it seems to work for her needs. It was a great parting gift."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "greate it works fantastic. my wife is verry happy with it"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I would recommend this device to all my cohorts. The keyboard is icing on the cake."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "It works fine. Image quality isn't fantastic, but that's to be expected with this price tag. Great starter tablet. I've also come to notice that the touch response is a little delayed. in other words, it's slow."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Decent for everyday use"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Great good"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Great price for this tablet no issues at all"}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "Decent unit for the price. The resolution and brightness leaves a bit to be desired. The speaker and sound adequate at best . All in all not a bad unit."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Many people judge this tablet wrongfully without even have the knowledge that rca is a great names in electronics history. Don't listen to the negative reviews if you understand that this is meant for what the companies description says it is and can do. Reliability wise it is very solid. Performance wise it out performs two other 200.00 brand name androids I own. This and many other of the rca tablets are great values in a low price device. I am a Android developer, so that lets you know about my perspective.. And no I'm not in any way shape or form employed by any manufacturer. If you're thinking about this item, go for it."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Just my size, I love it. It helps me with my everyday things I need to keep track of."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Charger fell apart in my hand they had glued it. Power button came loose. Wouldnt hold a charge. Used it twice before stuff started falling apart. Rotate screen took forever to rotate. Sent back. Box said new but..dont say what do you expect for 118 $. I expect a product that at least takes 1 year before falling apart."}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "Potentially the slowest buggiest Android 6.0 tablet ever.\nOK, so for the price I had low expectations for multi-tasking etc. Still, even with those low expectations I am let down by this tablet.\nIt's not that it doesn't work, but it's slower than my 3 year old Samsung Galaxy Tab on KitKat that I wanted to replace after dropping it and smashing the screen.\nThe apps take a LONG time to open, and then when you want to go back and view the home screen it takes a good 20 seconds before the apps on the screen show up.\nDon't try using the tablet while it's charging via mini-usb either. If you do, the screen has a mind of its own. Typing words creates a bunch of spaced gibberish and backspace or highlighting won't delete. It charges, but that's about it.  Possibly the reason it comes with an old fashioned charger.\nEven now as I type this on the tablet itself the volume display keeps opening and closing even though I'm nowhere near the volume buttons on the keyboard or the display and I'm not even charging it. It's a buggy/defective UI. Typing this with the awesome (but small) keyboard and the cursor keeps jumping up to lines I typed above.\n\nI love the keyboard and magnetic attachment to the tablet. I love that the tablet goes into a 'desktop mode' when attached and that there's a 'mouse' like part on the keyboard.\n\nFor $109 the display is adequate without being bright, but it's good enough I suppose.\n\nBattery life - I really can't comment. It came fully charged and drained by the end of setup and downloading from backups. I've recharged it, but so buggy I don't think I'll give it a chance to discharge again.\nI've had a lot of android devices and none have ever behaved so poorly... especially a newer one (2016 model?!?!).  I'm happy I purchased from Amazon as I'll be returning the product and the extra warranty I purchased.  I'll spend the extra few $ and get something of a better brand/quality.\n\nSeems they put more thought into the keyboard than the tablet.\n\nFew other things to note - the entire thing is plastic. The tablet is light.. it's nice that it has premiums that Ihave never seen on other tablets like all the ports for HDMI, USB, SD Card etc and ability to connect a mouse. Also like that you can choose SD as your default storage space.  Still - just can't deal with the buggy OS.\n\nBluetooth is another problem. Fine for music, but for video the lag between the picture and when the audio actually gets to your ears is about 1-2 seconds delayed. Worse than watching an overdubbed karate movie by far.  I use the same bluetooth headphones with other tabs/phones and pc and don't have a noticeable delay, so it's definitely the tab.\n\nDuring the writing of this review the screen automatically shrunk down this app multiple times now, and the aformentioned volume pop-ups. Also, no type correction options popped up, even using google keyboard.\n\nHope this was helpful to folks making their decision.\n\nLet me know if you have questions.\n\nR\n\n(updated to correct typos)"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I gave this to my ten year old daughter as a Christmas gift and she loves it.  It works wonderfully and she has had no issues,  I'm thinking about getting myself one.  You really can't beat it for $100."}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "My low rating might be from a steep learning curve after 3 and a half years with my Kindle Fire.  I have not found (so far) such normal things as an address book for E-mails.  Can someone help me with this?  And.......there are a number of other issues that hope to figure out eventually."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Very good for the money."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Best $99 I have spent in a long time. Love the detachable keyboard. Great buy."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "This is one of the Best Device I have ever Bought....I'm happy it has A USB port it makes it easy for me to Download pictures straight from my Camera..."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I purchased it as a gift for my son who teaches English as a second language. He Loves it. It meets all of his needs and allows him to have some form of technology away from his home computer. He didn't expect an expensive tablet to do so much."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "My husband just loves this. its big enough for him to see the screen while playing his games"}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "Could have gotten a new on for the price of this refurbished one .. tablet is slow .. I don't use it .."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "Basic poor resolution otherwise ok."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Great fast shipping. As described! A++++"}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "Pros:\nNice screen resolution.\nYou can charge by micro usb (slowly) and by included charger (rapid).\nFeels sturdy and durable.\nKeyboard has many quick key fuctions for settings (volume, brightness, search, home, playback, etc.)\n\nCons:\nYou cant flip the screen from the keyboard. You have to separate and reverse.\nThe screen touch response could be better\nKeyboard is tiny. Fat fingers hit varient keys during traditional typing. Sometimes I need to type with only index fingers.\nOS is a bit slow, but tolerable.\nOnly about 6 hrs of battery time, but charges quickly on supplied charger.\nCamera sucks.\n\nOverall, especially for the price, its a decent tablet. Dont expect greatness, but it is definitly enough to get you by. Im glad to have it."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "using the heck out of it and it dose fine"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Did not order this that I know of."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Brought this for my wife for her B-Day, only 1 of several of many gifts and you'd think that she won a car off Price Is Right. She LOVES the versatility of this tablet and I just can't say enough about it. Would absolutely buy this again."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I use this with a bluetooth mouse for taking notes in class and doing homework at home so I can get away from my desktop which I use for creative work. This is literally faster than the laptops provided at my college's computer lab. For the price, I don't think you can do any better."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "Does not access WiFi signal as well as other tablets that I have."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Works great. Not exactly light weight but like the detachable keyboard for travel"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "husband has one like it works o k"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "*I had to deduct one star because since I purchased it, the screen cracked. I wasn't treating it in anyway differently than what you should or should expect to treat a tablet, so I think it probably was a cheap, weak screen. I purchased a new screen and installed it myself. It works fine now. When you have to buy stuff that should haven't broken in the first place, my satisfaction goes down and the expense goes up.\n\nThis is perfect for me. I can take it to class (it's smaller and weighs less to carry than my laptop) and use Microsoft word to take notes. It's fast enough, and it plays some good games. The ability to use and download the kindle app was another big thing for me. The keyboard is really only useful for writing or taking notes, but it's easy to pop off. All in all, I am well pleased. As long as this this lasts a long time, the 5 star rating will remain.(had to downgrade a star after about a month or two of use)"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "(When I bought this tablet - twice - the prices were $56.25 and $62.50.  I'm not sure I'd pay the $100+ that it's selling for now.  I bought refurbished and have had NO issues.)  I love this tablet.  I don't use the keyboard much but like having that option.  There wasn't much to clean off with regard to things already installed (like some tablets etc come bloated with extra apps that slow performance).  The performance was already quick.  I will say if you don't use it for a day or so that when you first start using it it seems a tad slow but I've realized that it's uploading and updating things.  So I allow it time to do that then it's super fast.  I bought one for myself. Loved it. Then bought another for my mom for her first tablet and she loves it too!  If you're looking for an economical foray into tablets, here it is.  I use it for email, on-line shopping, banking, youtube-ing, and a couple old school games (like Bejeweled).  I am not a gamer so am not sure what its performance would be on graphic-heavy system-draining things like that, but am optimistic.  I am VERY happy with this purchase."}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "Incredibly small. My iPad is bigger. Took screen protector packaging off and when doing so the screen indented.\nI use mostly as a tablet bc the shift button isn't in the same place as a normal laptop which screws me up.\nIf it had a better keyboard it would be perfect"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Love it so much..."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Love it. You can't beat this tablet for the money. Its not as fast as some but its all I need."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Awesome device for an outstanding price.  Does everything it was purchased to do.  A real plus over other tablets in that it has a detachable keyboard.  I am thinking about buying another."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I purchased on a whim.... Was hoping to buy another tablet but this one was cheaper and refurbished. And I was like oh no.... But when I received it 2 days after purchase and came with no scratches no bumps no nothing wrong... Ran smoothly and plays my movies on Netflix perfect I am happy with my choice with it. Keyboard works amazing. I am very happy with my purchase and even more happy that I decided this device."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "This tablet has worked well for my son to use for school..."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Bought this as a gift for my brother-in-law. He absolutely loves it! I will definitely buy this again!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "It's a good laptop for anyone to have i woulf recommend it"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "nice tablet"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "My three sons love these and they do everything we need them to. They can write their essays on them and print to our wireless printer. They can their games and watch their favorite youtubers and Netflix. Just perfect."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "This computer incluye camera back and front?"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "This tablet is not working it keeps rebooting why won't recommend to buy"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Just recieved the device this afternoon, A week early, thanks Fedex. I'm extremely pleased so far, has performed as advertised. Thanks, if anything changes I'll let ya'll know, lol!!!!"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "LITERALLY arrived today, and it didn't work from the get go. Doesn't charge. Doesn't even turn on. I just wanted something simple for school, and this product totally ripped me off. Don't buy it."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "It will no longer connect to Wi-Fi. Had for a little over a year.  Camera takes bad quality pictures."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "My husband loves it.  So handy and easy to use."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "This was purchased for an 88 year old client.  It looked a little cheesy when I took it out of the box, but it works great, screen is clear & crisp, and it responds really well.  It's perfect for her to be able to play games and get email."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Great deal and it is just what my son wanted for Christmas .. Works great"}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "The tablet works very well. However, the detachable keyboard was rather spotty in its performance. Overall I would rate this fairly good purchase for the price.  Just don't get too excited about using the keyboard."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "works very well"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "It is the best $99.00 tablet ever!  No joking folks.  It meets the listed functionality, you know Graphics, GPS, HDMI, memory, speed--and the battery REALLY does last 6-hours.  Having 32GB storage is nice and in particular when you insert a 32 GB micro chip in the slot for the first time you are given two options (1) Normal storage for books, movies, pictures and music (2) allows you to install programs you get from Google Play.  Be advised, not all programs are installed on the micro-chip just certain ones selected by the tablet.  Note, the tablet comes only with a power supply and no other cables. With that said, the tablet has OTG, HDMI midi, Micro-USB and a standard size USB ports, so you should have these cables on hand. One thing I noticed comparing this tablet to my 3 other tablets: the audio is much louder, but I still use blue-tooth for music, movies, and the like.  As of today I recommend this tablet.  The detachable keyboard is a nice feature.  Just hope I get years of service from this tablet."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Works great for surfing the web reading news ."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "Very slow"}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "its ok"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "He loves it!!"}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "The only major issue I have with these tablets is that they can only be used with Wi-Fi. Unable to install SIM card, so can't connect to service provider. Wouldn't have made purchase if I had known, since primary reason to buy was for road trips."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Damaged in first week.. key board stopped working item returned... tried again"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I got the RCA viking very fast I love it"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Enjoying my buy. Still learning about it daily."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "I'm not a high tech person so it suits my needs for the $."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "the second one we ordered all the keys work!!"}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "Gave it to my grand kids and purchased me a chromebook.  Especially didn't like the key pad and mouse board."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Reviewed this before."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Got this for my 12 yr old.  She loves it.  It does the job"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Love it!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "What can I say,  The wife is happy with it"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Good"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Screen was cracked. Product box looks used and damaged. Very disappointed"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "It is a nice tablet for the cost, comparably.  It is not quite as fast or responsive, but I frankly prefer a desktop PC anyhow.  It took a bit to get used to the android apps, and had to download flashfox to use flash in a browser for a favorite website.  It is useful & nice to have.  It is not a Microoft Surface or an Ipad, but it is a fraction of the cost."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "There are programs we are unable to download for my son due to it not having Windows"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Great tablet. Very satisfied with performance."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Bought this as a temporary fix when my second Kindle stopped charging.  I will never look at another kindle.  Both died before the end of 12 months.  The RCA has been used daily for the past 10 months and never failed in the least.  The screen is large and clear.  Processing is fast.  There are HDMI and USB ports as well as Bluetooth and wifi.  I paid less than $70 for this tablet and find myself using it in place of my laptop more often than not."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Works great"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "The tablet stopped working after two days.  I was very disappointed. I wouldn't trust ordering electronics from amazon again"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "The keyboard is pretty much trash. It had buttons falling off within a month. The tablet itself it really decent for the price."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "I got this table for my mom who is getting up in age. She has been able to use it with ease and appreciates that it is similar to her phone. The largest down side she is currently seeing is that running video apps such as Netflix really drains the battery. However we are going to test it out to see if this is just the app or the devise's own video processing."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Fed Ex just delivered my RCA 10in tablet 32gb keyboard included. It was 4 days late which was annoying and it was an inconvenience. But just started it up without the cord it came with which was cool that I didn't need to plug it right away before even powering it on. The screen looks bright, touch screen works good and responds fast, and the keyboard works well also. It looks and works great for the price!  :) but today is the first day, I'll have an update in a week. But so far very satisfied with my purchase."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "O.k. I forgot I didn't write a review for this, until I stumbled upon the corpse of these piece of junk, in my closet. Did NOT hold a charge, and when I tried to ask the seller about it, I was basically told \"What do you want ME to do about it ? I will NEVER but another RCA Product again."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "My 11yo son was given this tablet as a gift. It works great. The touch screen works good as he prefers the touch screen to the keyboard. He streams videos and movies with no problem or delay. The camera isn't the greatest but for searching the Internet and playing around, it's a good tablet for the price."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Bought this for great price. The tablet is a great size.  We bought it for our 9 year old son. He feels this is as good as an Ipad and doesn't understand why ipads are so expensive when you can have a great tablet like this. He was able to download games from our google playstore for no additional cost and loved this!  The Keyboard is nice, but I admit for me as the adult, the keys are kinda close together. I can hit two keys at a time if I'm not careful.  I just force myself to slowdown a bit.\nI like the durability of the tablet. It's a bit thicker, but feels really light in weight. It seems to be more durable that the average tablet.\nIt's got a nice size memory. I love the ability to add in an sd card for more storage- especially good for pictures.\nIf you're looking for a nice tablet for the price, this is great!"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "I got this at walmart and worked at first now having a problem the touch screen isn't working only used it 2 times!!! Never getting this again. Seems nice 10.1 screen 32gb doesnt work properly. Get a galaxy or ipad instead."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "The tablet been working great but the keyboard had a letter fall off and some are loose. What needs b done to replace the keyboard."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Everything great , works great And got it on time.. Thumbs up"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "perfect size- this was a gift for a 21 year old - loves it- does everything she needs and more"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Bought this for my wife to replace a Kindle Fire tablet that has become unreliable. So far it has proved to be a very nice tablet especially for the money. There are certainly less bulky tablets with higher resolution screens available but for what we paid this has proven to be a superb device so far. My son likes to play Minecraft Pocket Edition and it runs very nicely on here. Battery life is so-so...about 6 hours with mixed use. One minor drawback is that it does not use micro usb for charging. That would have made it really convenient."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "MY GRANDDAUGHTER LOVES IT"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Works perfect.  I really like the MINI HDMI and USB 2.0 ports (also has microUSB). My wife has an Apple Tablet.  It is a little better in performance but, with less connectivity and much higher price."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "good table for your basic social media and email"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "so far so good.  works great and I have had no problems with it.  glad I picked this one."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "love the touch screen  will be wonderful for activities planned for it."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "What a waste of money.  Sitting here Christmas Day after having spent the night before setting it up.  It keeps dropping the wifi.  Then I go in and shut it off and turn it back on. Only to have it drop it again 2 minutes later.  I understand that it's not a very high end tablet but at least it would be nice if it worked at all.  Very FRUSTRATED!!!!!"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "There was no power cord and no contact number. Had to return it"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Great little tablet. I just started going back to school and its been quite handy for pdf reading, checking email, and reading books. I have a few games and they seem to run just fine. The one issue I have, which i assume will take some time to adjust to is that when I'm typing, ill occasionally touch the trackpad and it'll move the mouse and move where I was typing. Other than that, its a great little tablet!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Quality buy on this tablet  very easy to use and reliable."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Sorry I haven't written a review it's because it's intended for a suprise for thewife"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Good."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "The product appears to be okay, but trying to get tech support for issues that can't be fixed without their help is very difficult. The tablet appears to have been in South America and time zones and some other items makes it very hard to use. I would suggest that tech support have a phone number or some way of communicating with them so that the buyer can get on with life."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "My parents each own one of these.  We were extremely disappointed that even if you can load a bunch of movies onto an SD card, you still can't watch them.\nApp are a bit more fun than on the phone as the screen is bigger but ehh...  I'm not sure I saw much value beyind that."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "i like that the rca viking pro has the portability of a tablet and a laptop."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Sweet!  Faster than my laptop and easier to use on the go! Love it, it was a birthday gift for my husband who is computer illiterate, he uses it every day and he really loves it."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "its so good i love it"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "The RCA 10\" VIKING PRO Tablet that I purchased was a reconditioned unit at a lower price.  It's in like new condition.  Works great!  I use it with a Bluetooth mouse and speaker.  I like that it has a full size USB Jack.  Not all tablets have them.\n\n  I  was expecting it  come with a battery charger with cable and original box and info sheet but it didn't.  It came by itself wrapped in heavy thick bubble wrap.  I'm still happy with it and the savings.  For me, it was well worth it."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I've had this tablet for eight or nine month, now.  I use it daily, often all day and half the night.  It's had enough use that for normal use, it would be several years!  It's still as good as when I first got it!  Long battery life and when it's finished charging, it has a smart charger that stops when the battery is full, so you can't over charge and hurt your battery.  Plus, it charges fast.  It's a wonderful, wonderful tablet!"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "I bought this for my sixth grader to use for school. It's a very good tablet for the price. It meets the school specifications. And it's pretty durable as he is very rough with his electronics."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Had a little difficulty getting access to Amazon Prime Streaming Video, but am happy now."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "I will never buy another tablet from RCA . Flimsy screen was under warranted had to pay $30.00 and did not get my original tablet back got a new one was not informed of this from RCA. Now I have to replace all programs and go through a security process. The repair co is Venturer Electronics INC Lockport NY US 14094 Not a reliable co. DO NOT BUY AN RCA TABLET . The fact that the email of return & repair did not state a new one would be the replacement."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Love my tablet. Best one I have ever had. Simple to use, very satisfied with my tablet from Amazon."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I was so mad it came after it was suppose to. Which ended up beinpast my sns birthday but well worth it when he got it."}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "The tablet itself is ok the keyboard isn't good for nothing ,uncontrollable not accurate when, typing, using the Arrow"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Great price and excellent device!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I ordered this tablet for my Aunt 2 yrs ago who was a newbie to any type of tech devices and then another one this yr for my Mom who was another challenged device user. The RCA Tablet is perfect for them both. The first I ordered is still keeping my 70+ yr old Aunt happy on Facebook, email, shopping sites and all the games she likes to play. We had to add a micro SD memory card because she finally reached her limit on pics/downloads without an extra memory card. This tablet is great for any newbie to tech tablets those that don't need anything more. But for someone with greater needs (like me) well we need more processor speed and memory. For what it can do it is very capable and will last a gentel user. I would not suggest this one for children it really should be handled with a little care."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "Got it for my son and it barely runs his games. Battery runs out quickly and you cant buy batteries for it either. The keyboard is the only nice thing about it."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "This is a great quality tablet and it's bigger than your average 7inch tablet. Quality of videos is awesome. My son is always watching youtube and his movies and he loves it."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Every thing is fine kit works great no problems"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Not too keen on the camera, takes pictures a little blurry"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Had really high hopes for this tablet.  No such luck.  Tried to get connected to the internet and it just said \"connecting\" and timed out.  And yes I had the right password.  My laptop and smart phone were connected so I know it wasn't the wireless modem.  After doing some troubleshooting, I dug a little deep and found out that this was an August 2015 model.  The only apps that came on it were shopping apps with a date of 2014 date. Don't know if this had been sold and returned before, but all I know I can't do anything with this thing other than turn it on.\n\nUpdate:  I am upgrading my review to a 4.  After doing some more investigating and researching, I went through 3 different troubleshooting websites and finally got it to connect to the internet.  It works good now for what I want it to do.  I still drop it a star for the age of the OS and apps."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "For under a $100 this is a very good buy. A 10.1 in screen, Lollipop 5.01 OS,a keyboard plus a quad core processor and with 32GB of onboard storage, it's a deal hard to pass up. Other amenities include a Micro SD card slot, a micro USB port, a full size USB port and an HDMI port and of course a 3.5MM headphoe jack.\n\nIt's not all sunshine and rose however as I have a found a few cons to go with all those pros.mostly in that there are some apps that I was using on my Dell Venu 3 3830 tablet that according to the Google PLay store are \"not compatible with this device.\"  No explanation why despite the fact that the Dell while it had similar tech specs only had 16GB onboard memory and was only running Kit Kat 4.4.2. I know its not the Lollipop because I have these same apps on my Note 3 which also runs Lollipop. Now the Note has 3GB of ram but the Dell like the RCA only has 1GB yet it ran these various apps. Most of them are apps from financial sights so perhaps there is a difference between how RCA and Dell run security. Also for some reason there is a difference in speed between some apps on the Dell and the RCA but not enough to be a deal breaker. Overall I\"m quite pleased with this."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Works great! No problems at all!"}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "Good but little slow and worth for money."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "I have the Win 10 version and the Android V. Pro (in purple, for some reason the purple was cheaper with the same specs). Both tabs are excellent. I have not found anything in this price range half as good. The Win 10 version is faster but more memory hungry. It's easy to list the cons when you compare them to tablets 2 or 3 times the price but reasonably the plastic construction is my only real complaint. The plastic screen collects tiny scratches which tend to fog the display over time. 40 months ago I bought a 8.9 inch Amazon Fire tablet The one outstanding trait has been the glass display. It is clearer than the RCA tab I purchased 10 months ago. I have bought many things from Amazon and have never received a defective item, so I cannot blame anything on them. If you do buy one of these tablets realize you are getting more than your moneys worth but they will show ware. The cam may get a bit foggy and the plastic edges scuff. If your like me you are more interested in having an up-to-date system. I keep computers 12-18 months. Spend $100.00 and get a RCA tablet to use for the next 18 months or $400.00 for an I-pad for 48 months. Priority."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I like it so much this Tablet, is like a Netbook with Android system"}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "The tablet came with a few dead pixels on the top right and the screen was unresponsive to touch around the borders.\n\nThe speaker quality is atrociously low.\n\nBut the included keyboard is great with nice keys and doubles as a case. The screen quality is very nice and the tablet is okay in speed.\n\nOther than the dead pixels and the unresponsive screen it's good for the price. (Only 2 stars though)"}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "I bought this from Walmart versus Amazon (black friday sale).  The problem I have with the higher priced tablets is that they don't have enough I/O options.  I bought this one specifically because of the available ports.  HDMI, 5vdc power, micro usb, full sized usb etc.  Exactly what I was looking for.\n\nI love the features, the video is good (not top of the line, but good), all my apps run smoothly, not a lot of bloatware or branded crap.  Overall, it's a great buy for the price.\n\nCons:  Wifi reception is weak.  lose signals where my phone or old tablet don't.  Speaker is sub-par and the whole thing feels kind of cheap.  It's plastic and just feels kind of flimsy.\n\nIf RCA would comes out with a higher quality model with the same features,  I'd pay a lot more for an improved version.\n\nI Hope this one lasts me a good long time because there just aren't many models out there with the I/O features I want, but the overall feel and quality doesn't give me much confidence.  Time will tell."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "Kinda slow, but not infuriatingly so. What I hate is that the keyboard is basically useless. You can't write coherently as the overly sensitive mouse pad feels your hand even the slightest and moves your cursor, to the point where every other word is messed up. Disappointed."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Perfect gift for my son! He will love it Christmas morning!! Great business to deal with!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "A\nGood computer"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Way to slow for todays world. Qwuirky operations. Not really worth anything."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "What you pay is what you get the rca tablet is ok for just watching netflix or youtube nothing else the system is to slow and has pop ups if you try to download a external source on the internet"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Good for somebody that doesn't use computer all the time. Can look things up and do basic stuff with no problems."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "amsing"}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "My tablet arrived in pristine condition and fully charged.  It is easy to use and I anticipate doing a lot of writing on it thanks to the large keyboard.\nWhat I don't like about this tablet is that it has to be charged quite often. Also,  the charging cable is too short and the trackpad is insufficiently responsive. It is also important for potential purchasers of the Viking Pro tablet to be aware that some websites require an Adobe flash player for optimal use,  and this device is not compatible with said player. This is basically a giant Android phone,  nothing more. Side note: the tablet I ordered was blue.  The one I got is black."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I Love this tablet, I got it for my grandson,  it is just the right side, and he is enjoying using it."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "This is a well working electronic lifesaver for me...I've hasn't been disappointed one time..."}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "Not sure if it was the tablet or the wall charger, but twice it broke off inside. This was a good starter tablet for young children. Horrible sound. Don't expect it to do too much. Again, starter tablet. 2 stars for the sound and the issue with the wall charger. We made sure they were RCA wall chargers as well."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "This touchscreen table/laptop is soooo nice. The keyboard needs a redesign to be easier to type on, but I'm happy with the purchase and would do again."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Works great does everything"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Excellent tablet/laptop that is priced equitably enough to give as a gift!"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "It died after 2 months of useing"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "This is a great tablet for this price. My husband loves it"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "For the price this tablet is absolutely amazing! It does more than my IPad and costs a fraction of the cost of that. So happy with the one I got for my husband that we got one for our son and grandson for Christmas."}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "I guess I would buy it if I was a college student on a tight budget, otherwise I would rather save a little more and and buy better quality.  Examples, cursor response not good, cheap-feeling mouse pad, low camera quality. I bought it as a gift and unfortunately the response from both of us was underwhelming."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Wow, I never expected this kind of value. Hey it is a bit cheap as far as plastic choice however,,, it is a super tablet!!! I have owned it for several weeks and have to say I am please without doubt."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Stopped working after 3 months and I cannot get any response from the seller."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Fun little tablet for the money. Worked great right out of the box. Small enough to carry around and big enough to get quick jobs done. I'm glad I bought it."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Good Good Good Good RCA RCT6303W87DK 10-Inch 32GB Tablet (Black) with Detachable Keyboard"}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "For what it cost its ok.\nIts a little slow and screen does not always respond to the touch.\nVery basic."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Better than I expected. While still thin and not clunky, it is heavier than I expected, which to me is good because it doesn't feel cheap or dinky. Its a surprisingly good quality keyboard and setup. Its magnetic or something so the tablet just kind of clicks in place, and clicks back out when you pull on it. The tablet can be put in facing the keyboard and opened so it feels very much like a laptop , or it can be turned around, clicked into the keyboard backwards and then folded flat facing up, so that the keyboard is hidden but still attached. I was worried that when I didn't want to use the keyboard I would still have to keep up with the keyboard floating around, so that's a really nice option. All in all, its no fancy samsung, but let me say that I am VERY impressed with what we got for the price. I was expecting something light and plastic-y, but this feels and looks like a much more expensive tablet. Android lollipop runs smoothly so far. Would recommend and buy again."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Well put together and I use it every day"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "the wife likes it"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I liked this so much that I ordered one for my daughter for Christmas"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "This seems to be a very nice tablet for my use. I use it mainly for portable data entry into an MS Excel program and running PowerPoint programs. The office program that comes on the tablet is adequate and it will run the Excel & PowerPoint programs but some features are lost. I downloaded the free Excel & PowerPoint apps and they run the programs fine. I set up the programs on my desktop & then transfer to a USB flash drive to load into the tablet. I also downloaded a free file manager app which is much better than the Android file manager. I found out you can download regular fonts onto the tablet so you're not limited to the fonts already there which are quite limited.\nI haven't used it a lot for email or for surfing the web although it appears to be fairly fast in that area. I would not call this a power tablet but fine for casual use. RE complaints about the keyboard, it is not made for 2 hand power typing - more like 2 finger typing. Its a lot better than trying to use the on-screen keyboard.\nRE Amazon customer service: About  week after I got the tablet, the keyboard stopped working. I tried several times & things to try to get it to work. I sent a note to Amazon saying it was defective and they quickly sent me a return mailer to replace the tablet. The day I received the mailer, the keyboard started working again. Wasn't sure if it was a hardware or software problem. I didn't return it. I've had 1 time again that it stopped working but was able to get it working again pretty quickly. I'm about to conclude that it is a software glitch and not a tablet problem.\n I am really quite pleased with the tablet."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "We have 4 of these in our household and one belongs to a child. They have performed well and have had multiple trips and extended usage. One did get stepped on and cracked the screen but it was the one we didn't have a case/cover on. I wouldn't have expected a cell phone to survive that unscathed either. Overall they have been reliable and trustworthy. The child's one has a thousand apps but still keeps working well. The one it replaced did not."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "The quality is not great but it works fine for the price point."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Like it very much."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "80 bucks and works well."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Works great for my granddaughter."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "It only lasted about 3 months and it won't work at all. I was not pleased in any way at all. Paid $200 for it and now its a paper weight."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "excelente"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Very nice product and speed delivered"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "it as promisewd"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "i like it alot. it has every app i need."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "It's a little difficult to learn to use. But it's OK."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "I really like this tablet.  The keyboard comes off easily if I don't want to use it but I find I hardly ever remove it because it makes an excellent cover and is as easy to use as a laptop keyboard.  It has all the keys in all the places where you want them to be for easy two handed typing.  I find myself using it more than my regular laptop.  I'd give it a five if it weren't for the fact that the touch screen is a little sluggish, especially on startup.  Internet is very responsive, more than my laptop at times.  Great tablet, especially for the price I paid for it as a refurbished item.  Camera rather sucks but that's that's not what I got it for."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "This tablet is great! I bought it for one reason, to read comics, and it does that WONDERFULLY! the screen size is more than perfect, and while using Comic Rack app, you can just download, and read! I don't usually use so many \"!\" in a review, but this thing deserves it. Its lightweight, touch is spot on, and I've haven't had one issue with connectivity to my wifi. The screen is beautiful, and shows everything very clearly. I would knock down a star for the camera though. Photos could be a LIL bit more crispy, but as a camera, its just adequate. Your smartphone may outclass this by a wide margin. I kinda figure, that the blame is cause of the screen size differences. I got it refurbished, and don't let that scare you, mine works flawlessly, but I will keep you posted!"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "great for the price. Does great streaming movies from netflix onto google chrome"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Exactly what I needed!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "My son and I each have one, and it is great! Not as snappy as my wife's $400 tablet but there is not $10 worth of difference!  This is word the money."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "RCA came up with a winner with one!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I bought this tablet with some trepidation.  I was expecting that I had been duped by the positive reviews this tablet has received.  Much to my surprise this tablet has exceeded my expectations.  Let me say that I bought this tablet for a specific task and have not loaded it with many apps.  I have not experienced a slow load speed as expressed by some others.  Surprisingly, this tablet did not come loaded with bloatware.  This is a very good value and I am well pleased with my purchase.  That being said; I would have to say that this is not a tablet that I would give to a small child or would purchase if it is going to be handled \"roughly.\"  It is plastic and doesn't look as thought it would fare well if handled without some care.  I can't speak to the quality of the camera or the speakers as I did not buy it with anticipation that I would be using either for the specific task I intended it for.  Overall I find this a good value and would recommend it to anyone given the qualifications I have stated here."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "love the tablet, but only getting about 2-3 hours game playing time before I have to recharge. Just attached the keyboard today to see how it works. The entry key doesn't appear to be working. Is there something I have to do in the settings?  Please advise"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "met my nephew's needs"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Not at big fan of the Google on it but for the price it's ok. Speaker is very weak"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Time will tell but very pleased so far.  Easy to set up and once you get used to navigating the Android system it is well worth the price.  A bit heavy for someone who wants to tote it about.  Happy that we made the purchase and would recommend for those who are not very demanding about use and versatility.  Does the job for us."}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "Stopped working the right way\nAndroid process window popped up and will not go away"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I love it everything I expected and more"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Great little guy for the price.  It does all I needed it to do"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Love it! My daughter can do her homework on it and that's all I care about! I can hotspot it and I am enjoying it."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "No I sent it back"}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "It's a nice tablet, but unfortunately it's not connecting to my Google acct. Can't do much of anything if I can't access Google (since everything is connect."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I like screen size and design. Processor is fast for my requirements (not a heavy gamer)."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "We got charged shipping and handling when we were supposed to get free shipping and handling. We love the tablet has everything our phone has and was a backup for our pictures and videos. It's perfect for me when I work at home as well. I definitely recommend this tablet. Also, down side of this tablet you cannot put your SD card from your phone in the slot on the side. The SD card from your phone is too small. Also, you have to buy the tablet HDMI cord for this tablet, you can't just use your own HDMI cord from your own TV. Otherwise, everything so far is great."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Tablet won't charge!"}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "Good tablet. But mine has some malfunctions"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "low price with good quality !"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Use this on a daily basis."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Junk the screen cracked after a week didn't drop it or slam it shut or anything and that side of the screen doesnt work now. Do not buy this product."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Awsome it working"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Arrived working but screen completely stopped working after about 3 hours of use"}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "it's not worth buying......... lasted for about 5 months, unable to type with or without keypad"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I'm reviewing the RCA Viking Pro 10\" 2-in-1 Tablet 32GB Quad Core black Laptop Computer with Touchscreen and Detachable Keyboard Google Android 5.0 Lollipop.  My wife got me this as an early xmas present to replace my Samsung tablet which was a total disappointment.  My wife has an I pad which of course is way more expensive. I can do tons of more things on this. The Apple is only a bit better in screen resolution. I am a computer geek and I am totally happy with this and the multitude of connections and the real clean Android operating system (very very little bloatware that CAN be removed)  If you have a good WiFi network at home and where you travel too this Tablet should be no problem.  Not only do I play music and movies from the flash drive but from my google cloud which is great. If I want to add music or movies I just put them on a flash drive, pop it in and transfer them to my micro sd card or google cloud.  Great little tablet."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "This product was good for about a month, it had all the normal features and is a little slow but for the price, I didn't expect perfection until one day it literally fell softly to the floor on a very soft carpet and it was in a soft case I had bought for it and it literally cracked on impact causing it to not work at all, the graphics and everything were jumbled. Another note, it also never picked up on any of our internet, whether it is was secure or not, and we have a secure line which I put in the password for so for me this product was not really worth it since I had to buy a new one a week later since it was too late to send it back."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I was hesitant to buy another tablet after a bad experience with another but I was pleasantly surprised. For the price this 2 in 1 has worked very well and the battery life was pretty good."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "I have had this since  june I have used it very little and carefully but the screen has frozen up repeatedly an now is totally frozen. This was a ripoff. Disappointed beyond I can say. Do noy buy."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "It worked fine for 1 month.  I didn't use it for 1 month.  On the third month, when I turned it on, screen was very dim, unclear, and left after images.  Few days later, the screen became totally dark except for the left  1/4 inch of the screen.  I don't know what is wrong with it. I had many tablets and smart phones in the past. Never had this problem.  Tried to have it fixed with RCA using the 1 year warranty. I tried three times online.  After the initial automated email response, then no followup or instruction as to how I may have my tablet fixed.  So, three month after purchase, I have a $90 paper weight..."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Worked for 3days then got very slow, nothing was on it but the programs that came with it, so this went from a five star to a one"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I am reviewing RCA RCT6303W87DK 10-Inch 32GB Tablet (Black) with Detachable Keyboard... It is a Nice little tablet. No complaints at all so far. Not as Nice as my wife's I Pad Pro of course but what is ?  at this price with the keyboard ?  Can't be beat.. Keyboard works fine. USB works fine. I was watching movies from my flash drive easily. Did not down load a lot of APPS because this is going to be a gift, but I liked it so much I ordered another one for me.  It runs a lot better than my old Galaxy Tab 3 for sure.  IF YOU ARE LOOKING for a TABLET to rival your friends I PAD, forget it, it just isn't going to happen, but I sure as hell like this one with it's micro sd card slot (128gb), mini HDMI which works great and full USB port which works great. For $84.99, I dare say you will be hard pressed to find another one better.  The only problem I see people having with this is not knowing what they are doing to start with.  If I have a problem with my second one I will update."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Great deal. Perfect for my son"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "EXCELLENT PRODUCT / VALUE...."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "bought this for an older neighbor who wanted a tablet to check email and watch netflix on the go.  She loves it, her grandkids play little games on it, she now has a portable and simpler method to check emails.  I added another 32GB sd card and put a bunch of movies and tv shows from her dvd collection and home movies.  touchscreen isn't overly sensitive, preloaded apps are all google stuff so its simple and easy."}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "Amazon video is not available"}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "The product itself isn't bad for its price, but I reveived at tablet with a damaged screen!!!"}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "Not new"}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "This was a gift. I am not the recipient."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "great bday gift"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "very cheap built."}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "Its ok for something so cheap but this broke within the first month I had it, the tablet part is fine but the keyboard doesn't work. Very disappointing, up until then it was a great little laptop"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "This is an EXCELLENT tablet.  The only problem I have is that it will not accept some apps.  I'm not sure but I get a message stating that this device is not compatible."}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "It's a good computer but the screen came cracked and the tablet doesn't work. It'll only work if you use the mouse very unpleased."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Perfect for the small kids. Combine with a padded case and they are set. Love it."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Great for the price!! Actually, planning on getting a couple more."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "Could be better but too many wrongs. It works good but slow as molasses in a snowstorm and there is no way to connect to a PC to transfer files. For the price it's right, but I should have spent a tad more. Keyboard commerce flawlessly and works great, I just don't use it. Speed tjis puppy up and I would go 5+ Stars easily"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "excellent product"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "The camera is kind of grainy but this item is well worth the money."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Left handed tablet, turn on button and others is on left handed side of laptop, keyboard stopped working, been sick and couldn't send back"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Very functional tablet much more of a laptop in what you do with it being that it has a full size USB port. The downsides being the build quality and the performance which lags."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Very God.\nI Enjoy ita."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "I bought two of theses....Enough said..."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Nice tablet the cover is plastic i knew that going in. A hard case and screen protector is needed or just don't drop it. It takes a little work to get a usb device in the usb port it is kinda tight. Overall it is what i needed, i use it to gain remote access to my home computer desktop over wifi and mobile data using my phone as a mobile hotspot. It's both an android tablet and a windows tablet, depending on what i need it for."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Very satisfied with this basic computer. Great for everyday quick needs. Especially good for younger children at a very affordable price..$78"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "really like this product"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Seems to be ok, gave it to the kid and he's happy everyday. Already killed the key board by losing a key or two. Spilled pop on it. And I don't know if it is still working or not. He's not using that part."}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "Can't download PC games"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "GREAT PROCUCT FOR THE MONEY,  I HAVE ORDERED 2!"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "I have used the tablet for 4 months now. I have been impressed. The screen is clear. Good for watching movies. I have a 32gb card plugged in for movies and music. The kids use this tablet all the time. No issues."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "AS per my review of the other unit i purchased - i do not recommend this product Klunky, batteries die within a few weeks - vendor outright refuses to help. Dont buy"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Great!!"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "I Love it! No Problems, And Received It Fast Within 2-3 Days! The Product Is Brand New, Not At All Refurbished! Thank You, And God Bless You!"}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "It works but it is touch sensitive. I originally purchased it for school work but it is hard to type when the cursor moves automatically. So, now I use it for netflix."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "This is the best tablet ever. I love the keyboard that comes off. it makes life so much easier. I am so glad i got this i hardly every use anything else not but my tablet. the 10\" screen is great because i watch a lot of Netflix and hulu. it is really fast as well. the tablet is also really we made. i liked it so much i got my husband one just like it. he loves his as much as i like mine ."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "Pretty good for the price"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Everything we were expecting very pleased as usual with everything we have ordered from amazon !!!'''"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I looooooove it!!!\nI use it to control my house and it works perfectly! Surprisingly fast and easy!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Great for the price. I use it when I need to be out of town as I figure is something happens to it, I have not lost much. So far it works well."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Like"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I've had this device for a few months now and I just love it. It has all the features I want for a mini laptop. I use it for writing and social media. It has plenty of storage with the micro SD slot and with access to cloud storage, I never have to worry about losing my docs. I've also used it to watch Netflix. My ONLY complaint is that the swpeakers are poorly placed. It's difficult to listen to anything without headphones or holding the device up to my ear. I'm somewhat hearing impaired so this may be my problem and not the device's. If you're looking for a versatile mini laptop, this is the device for you."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Great unit"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Can't say enough good things about this! Only let down is the speaker in the back but I didn't buy it for sound. It does more than I ever expected out of it everytime I  use it!"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Handy and intelligent, just what my kids need for homework"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Love this little tablet. Smashed the screen on my old one, and couldn't live without it."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "I received my package today. A RCA tablet with keyboard. The screen was scratched bad, the product never worked. I'm returning it as we speak. It was a gift for my sons Birthday and now he won't have it until after his Birthday. I am very angry"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "awesome"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I'm still learning to use it as it's my first but it's done everything I've expected. The price was right, was shipped immediately and is exactly as advertised."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "This is a good, cheap tablet.  Don't expect it to work well for high intensity stuff, but if you want something that you can surf the internet, watch netflix, check email, and type on, it is perfect.  I use mine mostly for video watching and classwork, and it does both easily."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Opened box and screen was broken, very disappointed."}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "I didn't get a chance to use it. I order it twice (2) and each time the screens was cracked. Total 4 and 3 had to be returned. My granddaughter received the other one."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Bought this as a gift for my stepdad and he absolutely LOVES it. He said I couldn't have given him a better gift. It works great, is very versatile and more portable and user friendly than his laptop. A definite winner!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "The price was reasonable and it seemed like a good choice"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Get what you pay for cheep and not made to last"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Grandson loves it"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "The keyboard and touchpad are working.  Must of had a small hickup.  Now, it works great for the price.  Performance is better than my Dell 8.\nLoading apps is a breeze.  Connect to a powerful internet, not a unsecured public internet, it works like a charm!  Everywhere I take it, I get good remarks on the quality of the sceen.  The only draw back is the speaker.  I use ear buds.  The sound quality with ear buds is great!"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "I am loving this tablet.it has an Android operating system that I also have on my phone so it was very easy to figure out how to use it. I took it out of the box and set up was very quick. It is very responsive and the screen clarity is great. It is a great tablet for the price."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Terrible! Only works part of the time, doesn't charge well. (It took us 3 days to get it to charge above 1%) screen cracked while charging. Don't buy this product! It's complete junk!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I purchased one of these for my grandson about a month and he just loved it so I ordered this one for my granddaughter. Just by what they have told me I think this must be a great product. I know I had no problem with ordering or receiving the."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Very good tablet for the money"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "It's too slow! I have to connect and reconnect my wifi internet to it in order for it to work. It's very aggravating! I can see why it was returned."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Awesome love it"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "After 2 tablets with mini usb chargers, that do not work after several month, this tablet has a regular push in charger which is great.  i have had many tablets over the years and this one so far is great and I love the detachable keyboard.  Price was great too!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Just the right size"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "My wife likes this tablet a lot. So far it has been working fine."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Bought it for my son and he loved it "}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "A tad slow browsing and transferring data. Still a good value.  Charges with supplied charger or micro USB. Loaded with ports.\nBecame even slower."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Performs great, my wife loves it."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Has a mind of its own!"}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "Been using computers sense 8 inch disk to load OS. This is call a 2 in 1 but only works with key board makes it use less for what I needed I won't efen be able to sell for what I paid"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "MY DAUGHTER LOVES IT,BOUGHT IT FOR HER NEW JOB"}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "A little disappointed with this product. It don't support alot of the apps I use. Therefore I am using my smartphone more than my tablet."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Great product for the money, my 10yr old son love it, good picture quality battery life is decent too."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I purchased one of these for my 10 year old daughter and another one for my 12 year old son. The keyboards adds to the versatility, and makes it easy for them to watch movies. So far, no performance issues on either, although my daughter cracked the screen on hers. This limited the functionality of the touch screen, but the tablets still works via the keyboard and touchpad."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "never got a chance to use this, had to return it as it came cracked..."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Size, weight, capabilities are good so far.  Battery is average to good. Pairing and processing worth the very good price so far."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "It meet them.all"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "so far it works great and was a good buy"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Had this for a while now, don't use too often as a mobile device.  Nice to have the keyboard as an option, but with the case I bought, if the keyboard isn't attached it doesn't fit right.  Other than that...great product - especially for the price, though I am not a power gamer."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Haven't used it much so far. Bought it for a decent size screen at the camp to check weather via my phone. Works like a champ and was very easy to set up. The best thing was the price, 100$, are you kidding me????"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I hope it works as it looks so adorable, is a gift"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Great product for the price."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "i have received my tablet, and it works fine, thankyou very much.this is for my grand child,so i will be ordering another in the near future,again thankyou"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "RCA Viking Pro 10\" tablet.  Was fine from June 1 until July 10.  Kept in climate controlled house so I could use for Messenger while working from home.  Did not play games.  Did not have photos.  Wi-fi only.  Was plugged in nearly all the time.  Because it seemed to be great, threw away all my packaging at 30 days.  Starting July 10, powers off after 60 seconds or so.  Spent more time setting it up the first 2 days than I spent typing messages in that month.  From the reviews, hoped it would last at least 6 months, which fit my needs.  Now I have to find a place to recycle the electronics.  Will NOT buy another.  Do not want to waste the time to argue about replacing this one."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Bought this as a graduation gift for my boyfriend's son. He loves it! Portable & well made, it fits his needs perfectly."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Item arrived broken i need to be contacted asap because i cant be without the tablet which is why i selected rush shipping!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "love it!"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Tablet was for my son who plays games on it and it is perfect for the house."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Dislike because the touchscreen stop working the next week"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Works good."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "love it!!"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "I love this product my only concern is how it turns on is very slow loading on..."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Perfect for road trips, lots of memory just what I was looking for."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "It's great"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I cant say what my opinion would be as it was for my daughter but since she has not complained I have to assume that she is very pleased."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "It works real good"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I bought this for my 10 year old son and he loved the keyboard. It's a great value. I would buy from this seller again."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "My daughter love it!! Was a gift for her birthday!!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "What I jump for the RCA 7\". The screen is much better, moves faster between apps. Worth the extra $60."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Awesome"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Great for the price."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Great for the price!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Good tablet"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Keyboard stopped working two days after I received it. Don't waste your money"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Very good item"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Great for travel."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "These things suck eggs mate. They don't even work when you get them."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Wrong item"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "It's small easy to use"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "So far it is wonderful great for the price"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I had a laptop which seemed so bulky on my lap and I seemed to have alot of trouble with it, taking it to the Geek Squad numerous times.  I saw this at Walmart and looked on Amazon and felt it was a good price.  I am so happy with it.  I can do everything I want to do and more!  I just have to figure out how to hook it up to my printer as I seem to need different size connections than what I have but I know it is possible."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Has anyone experienced wifi issues with this?  I have turned off everything off, no sync, no updates, nothing.  Yet when I ping it, it looks congested averaging 30+ ms and showing max pings in the 1000's.  It eventually times out and then comes back.  Pings to other devices on the network at the same time reveal no congestion.  Thoughts?"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Nice enough"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Its great for me!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Arrived on time , no damage . Very easy to set up and use ."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "We purchased this to give away as a prize."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "The tablet is good for the price. The cons for me are the position of the power and volume buttons. Along with how you close open screens and apps.\nThe screen quality is good and the keyboard is very good."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "Screen easy to scratch.\nWIFI must be strong for internet. Needs more USB ports."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "This is handy 10\" tablet with detachable keyboard and is great as an auxiliary computer for travelling or bringing to the library to write term papers.  The battery time is probably about five hours while typing out a word document, but best to keep the charger with you so it doesn't run out.  With 32Gb, that is more than adequate for most light work and apps; adding a micro SD card adds additional memory for storage of photos, documents, music, etc.  YouTube videos play adequately, though you may have to add a speaker or have earphones.  With Chromecast, YouTube videos can be watched on the TV.  The built in speakers are very low and that seems questionable.  The keyboard takes some getting used to; it seems too delicate with the cursor ready to move at the slightest provocation to the wrong spot.  It is a detachable 10\" tablet with front and rear 2 Mp cameras.  While not adequate for taking distance photos, more than adequate for taking close-up photos of friends and relations.  The HDMI is a micro-HDMI so an adapter has to be purchased.  The computer works with a mouse, I use a wireless mouse because the computer touch pad seems just too delicate.  The Google photo app has tremendous flexibility for cropping photos, adding light or shade, etc.  The OS is Android 5.0 Lollipop which to my way of thinking is simply stupendous.  It will automatically connect and sync with your phone.  For those of us who are a certain mature age, the Android OS lends simplicity to what oftentimes appears daunting.  In other words, you have nothing to do but sit back and let the OS do its thing.  The machine comes with Google docs, Microsoft Word has to be added.  My preference is for Microsoft Word because I write in several languages and need to have that flexibility on my computer; while you can put Microsoft Word on this computer, I don't know whether language pacts can be placed on it for ease of writing as it can on a Windows.  (Apparently Google Play has language apps.)  The product also has a function where a person can write on the screen (with a stylus, sold separately) which is handy for taking notes in algebra, chemistry, etc.\n\nSo as an auxiliary computer for when a person has to be away form the home computer, this is a great adjunct."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Just what I expected. Thank you"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Happy 10 year old"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "this is a very good product work real well"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "These tablets are extremely fragile. Out of 4 purchased only one is working 2 months later. The screens are extremely fragile."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "surprsingly good 4 an inexpensive buy, pleasantly surprised"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Screen breaks way to easy"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Super little notebook for the price, lightweight & very user friendly. I love the keyboard when I'm at home or at work. As long as I have Internet access it does everything I need it to do. I would & have recommended it to friends & family. My 3 year old grandson uses it's touch screen with no problem."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Didn't work as i expected."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I like it a lot very helpful but I don't know how to access the built in wifi"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "This is a very nice product. It is the perfect size. I like the convenience of using or not using the key board with it. It is easy to navigate & use. I use it more than my laptop since I bought it. The screen is clear & easy to read. This is my first touch screen item."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Muy buena"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "For the price and what this is, it works great. Perfect for the dad who loves to fumble around the internet. :) It certainly doesn't compare to my Samsung Tab S2, but very little does....lol. Compared to other tablets in and around the price point though, this little nugget does the trick. I like the keyboard and it is easy and nearly idiot proof to use. :)"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "honestly, put your money toward a chromebook. clunky, slow, tiny keyboard, oddly sensitive touchpad, and the charger broke after two weeks. complete garbage."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Nice,notebook was to,use.battery life is to short.overall I like it"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "love it"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Great...everything I needed and more."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I am really enjoying reading books and playing games on my RCA Viking Pro tablet.  Easy to read large screen light weight and easy to use.  Debby T."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "THIS WORKS GREAT! LOVE THE SPED AND SIXE TO TAKE ANYWHERE!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Works great....just as advertised"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Product was slow, and the connection between keyboard and tablet is quite ifffy. I feel overall as if was misled by the description."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Quality HD and seems very durable. Love the keyboard and easy removal to use as tablet. A great bargain priced tablet combo!"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "I'm really enjoying this tablet. Previously I only used a desk top PC and it's so handy to finally have something portable. It can be used with the keyboard or remove it and use the touch screen. (I never used my smart phone for internet because it's too small to see very well). Now I can set it on my kitchen counter to pull up a recipe, Stream a movie while I'm in bed (no TV in my bedroom), or remove the keyboard and just take the tablet part with me when I'm out. I sew so I made a case for it. It slips into a larger purse and I use a Bible app while I'm at church (easy to find what I'm looking for and easy to read). It's also handy to have the camera/video. I find I often use this or my smartphone for taking pictures even though I have a DSLR. It's so easy to take a picture and then put it on Facebook or email it. I didn't give it 5 stars because the only con is that the battery doesn't last long when I stream a movie. I need to recharge right afterwards."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Getting used to it.  We were not familiar with the Lollipop os, so spending a lot of time googling things, but seems to work as designed"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "returned my son did not like it because it \"wasn't a real computer\""}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "it exceeded my expectations.....pleasant surprise!"}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "Item was very used when I received it, sent it righ back, I was dissapointed."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "It's a great tablet, especially for the price!! I love it and use it all the time."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Good android tablet. Very solid materials and great performance. I'm planing to buy the Windows version."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "I purchased one of these from Walmart.com. I was going to leave well enough alone, however, after dealing with RCA customer service with a problem, I needed to write a review. Most consumer, I assume, pay attention to reviews. I have no idea how this unit has so many high marks. This unit was slow out of the box. After suffering with it for 6 months, the flimsy charger stopped charging - there is a bulge in the casing, looks like a fuse overheated (my guess). I have contacted CS and have exchanged about 6 emails over the course of 6 days - asking for a new charger. The last correspondence, the CSR just asked me to refill out the form. (Walmart only takes returns after 90 days on electronics). And RCA will not return / refund - only provide warranty repair for a year. Apparently, they know their products well."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Item for a friend"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "nice tablet. was a breeze to use, right out of the box. I bought it for my husband to browse the internet and Facebook. I could have bought it cheaper at Walmart but it would have taken over a week to get it as they do not carry this item in stock.  Well worth the money"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "i love it"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Product is great, has built in office to write, create presentation, or spreadsheets...versatile...will buy more"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "not eye popping terriffic but I didn't expect it to be. I was just hoping that it would be a decent speed and a responsive screen and it is. after a couple weeks of use the only real complaint I have is that the charger it comes with takes for ever to charge fully and it never completes the charge through the trickle stage. I'm trying a couple of things to remedy this. writing this review with it. for an inexpensive tablet computer it does a decent job."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I've purchased a few tables lately and ended returning them.  This has pretty much all the features of a laptop.  I love the HDMI port and the USB port.  This is a great tablet for the price.  The Blue is a vivid Blue..very nice. The keyboard is a BIG plus.  I have a wireless mouse that works fine.  The battery is better than I thought it would be.  It connects nicely with Screen Beam and I can watch movies on our SmartTV from ShowBox, Netflix, etc through this tablet. I highly recommend this.  The case I purchased on Amazon fits perfect as well.  What a match."}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "Disappointed with the short life of battery.. Has to be charged more often, than I like."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "When you purchase an all in one like this for under a hundred bucks, it is only reasonable that you shouldn't have too high of an expectation for the item. That being said, I only planned to use it for wifi access and not really much of anything else.\n\nPros:\n\nIt's compact and light\nBattery last for a long time\nSounds is very good\nRuns quick\n\nCons:\n\nPoor user guide\nShort charging cable\nClunky touchpad and keyboard\n\nAll in all, it's OK and will serve the purpose I wanted it for sufficiently."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Not perfect but good item for the money,"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "First, I give this 4 States because of price and satisfaction. I would give my Toshiba 4 stars also but the Toshiba is light years ahead of this little guy so don't think u can replace your regular PC with one of these.\nThat said, this has been great so far. It isn't as fast as my PC but its not so slow I get frustrated. I'm talking a difference of seconds when it comes to loading. Has very good picture quality and sound is good through my headphones (I haven't even used the built in speaker so I can't comment). Keyboard is small but I'm above average size with freakishly large hands even for somebody my size and I'm able to use it with only minor inconveniences. I was able to install Firefox which I like and other apps after going to settings and allowing this. My only complaints would be how fragile it feels. I have to be careful because I can tell its only a minor slip away from being garbage. Also the mouse pad is overly sensitive. When I'm trying to scroll it often just clicks or if I brush it with my sleeve it starts opening things. Otherwise this is great for the price. Would recommend."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Easy to use. Love the key pad. USB port helps a lot. Micro USB port helps even more.  4 hour battery life could be longer. I turned down the brightness to help a little on the battery life. All in all, I like it and use it a lot."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "I got this not two weeks ago and it is already messing up it won't let me use the keyboard it doesn't show the memory card and the touchscreen is jumping around but I can't get a refund cause my credit card was cancelled worse tablet ever"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "It is a gift.  I'm sure he will love it."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "IT WAS EXCELENT. KEEP UP THE GOOD WORK.  IT WAS NICE DOING BUSINESS WITH YOU. THANKS."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "I got this tablet two months ago for my birthday and it broke in my bag. The screen is cracked and won't work, it only works with a mouse.  I want to get a new one but I have no money. *SIGH*"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Everything came and works perfectly on the day I was told it would be here"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "It can freeze every once in awhile other then that I do like it"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "des nt work and it has not worked foe a while quality is crap"}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "I bought this SPECIFICALLY for MLB and NIKE apps (things with Flash).  I asked the question on the forum, because I had read that another buyer couldn't download the apps.  The seller lied to me and said the I could see games.  Now I am stuck with this and it isn't going to do what I bought it to do.  Don't believe the sellers, I guess."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Excellent"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "This was a great investment. Granted it doesn't have a cd rom its ok...ill get an actual laptop someday. But this is just like a laptop. Plus its wide enough for me see the letters. Its a great tablet i told and showed my mom and she ordered on as well."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "its very good"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "NO"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "I like this product"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "I'm pretty happy with the tablet. There a few apps from Google Play Store that was on my old tablet the it says aren't compatible with this tablet but I can get to them by going direct to their web site, so not a big deal. Overall I'm satisfied!!"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "I haven't had the chance to turn it on yet since it has to charge before the first use, but I love it. Its such a small lap top but such a huge tablet whwn it is off of the keyboard. Very impressed so far."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I bought two of them for my grandsons for Christmas.  They love them.  Very happy with them.  However be careful with the square trade warrantee.  Their both chargers broke.  After going back and forth for 2 days on the phone, they said we would hear something in 2 to 3 days. A week went by and I called them only to find out the item was not covered. I told them Amazon customer service would never allow a customer to wait that long and never follow up as promised.  Let alone it is not covered."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I really like the size. With my big hands touch typing is out of the question"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Wish camera had flash and better kids mode..but all in all its nice"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Very good"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "I really have not had time to try everything"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Love it perfect size I can type of Word Documents download music play my favorite Android games on it all around I love it"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Excellent for email , paying bills , news and games"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "A great little 2 in 1."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "Works good for little kids but dies quickly"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "perfect"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I bought this for my son and he LOVES it.  His friends like it too.  Now he doesn't need to lug around his heavy laptop.  This has so many great features and is well worth the price!!!!!!!!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Just what I needed."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "This is not a laptop.it's a tablet. Mine works fine,but it will not let you transfer apps to a SD card at all.,also not compatability to play mlb games on or nba."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "I couldn't get it connected to my printer? I gave this one to my husband, and purchased the Nextbook, and I love it."}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "At first it world great, but we didn't use it for a Wow and the battery will not charge. I count get to talk to the company."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "I bought this in a mad dash when my laptop's hard drive crapped out. I needed an immediate replacement for work. My job requires use of a browser with multiple tabs. This tablet was requiring me to use apps for Google calendar and gmail. I was also not pleased with the light version of Google docs and word it supplied. This tablet looks **fantastic** for leisure and personal use. It unfortunately does not have the processing power I need it to have for work projects. I wouldn't recommend it for college either."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "My children love it"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "This Tablet is Real Good and I don't use the Keyboard any more at All since this thing has Terrific Listening Skills.  Very Good"}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "I orederd 2 that came fine then I just orederd one more for a gift and it came yesterday with a cracked screen ... I cant figure out how to get ahold of anyone .."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Works great I was so happy with it I bought a second on for my stepdaughter"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Good for basic functions like email and social media, Google."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "the screen is plastic thought it was plastic and glass but scraped"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "My review begins and stops with the charger. It operates only 110 Volts. One must carry a voltage converter to use this tablet in many, if not most other countries when traveling. The specs listed on the Amazon site do not include the charger's voltage rating. Amazon is lacking in this category for many of its products one might use when traveling abroad. What company in this century makes products such as tablets, shavers, laptops and smart phones with chargers that do not operate on universal current? RCA does."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Amazing tablet and keyboard, works great, perfect for my writting and light online work and few apps I use. There are some external hard drives and some apps that are not supported on this device I have found but other than this concern it has been worth it."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "super little tablet I love the keyboard . Nice clear picture on Netflix too."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "To start off, I bought this from a brick and mortar store for much less.\nThis is a cheap tablet.  The quality is very cheap.  It pops in places when you just pick it up. The colors are drab. Trying to swipe is difficult, because the touch plate is not smooth, even after cleaning it off.\nThe settings are almost non existent, what you have are basic settings. To top it off, there is no support for it. You go to the RCA site and look for drivers or anything to try to make it better and all but the phone number are crossed out.\n\nDon't get me wrong, I didn't go into buying this expecting a great product, but I did expect more, and better. I bought it mainly to be an artistic device.... with the drab colors and impossibility to improve them, I was let down greatly and will not buy another RCA product again. Sad how the mighty have fallen."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "I have had this tablet for less than 45 days and it has stopped working. When I turn it on the screen is BLACK! DO NOT BUY THIS ITEM, IT IS A WASTE OF YOUR MONEY!!!!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Very nice love it.."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I love my new RCA Tablet!"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "The screen cracked very easily when my child dropped it."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Use it everyday love it"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Here is my review on a video I took off the Viking pro 10 machine. I recorded from the device and uploaded to youtube! Sorry the sound is a little static, but you can hear me. Thank you!\n(...)"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Love this tablet!! It runs do well and had a long lasting battery! Love that I can play bigger games and even run Netflix on it!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "got this for my mom and she loves it more and more each day and everything about it is great quality"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I do not have possession of this product"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I post my review on the case bought the full package.  It is great"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "A lot of apps say incompatible with this device, we bought it for our office to put instagram, yelp and facebook on so our patients could like us."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Works great so far!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Really a wonderful value- especially for the money. Good performer!"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Works great so far.  It could use better instructions on how to navigate between the features, but it does a great job, especially in playing videos and developmental games for my 2 year old."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "This computer sucks I sorry I spent all that money at it. It's a terrible  product! !!!!!!!!!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Great product"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Easy to set up and works like a charm. Couldn't ask for more."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I am above and beyond satisfied. My son loves it so much thank you. And it was a great deal to."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "Its ok. Seems to die rather quickly even though ive done what it suggest to save the battery.  Its got a lot of memory and its cool that you add more with an SD card. Not bad for the price. Good first tablet for a young one"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Not even a star...Piece of s***!!!!!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I'm content."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I bought two for my friends children. They love them."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Good job"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "So far it has been great. I use it in place of my laptop."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Has exceeded expectations.  Simple to set up.  Simple to operate.  Good service so far!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Luv it"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Good for the money.  Camera is a little weak."}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "Not what I expected a little disappointed"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Very poor performance sent it back"}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "I can't use a lot of the apps I wanted, it's incompatible, and it's Bluetooth won't sync up with my phone's Bluetooth. I disappointed to say the least."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Good buy! Camera is poor but it was known."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "No complaints so far...  I'm actually quite pleased with my purchase..."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "this was a gift for my 4yr old son birthday n he loves it once he is happy i am happy we love it"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "really like"}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "I think this is one you get what you pay for. This is not a top end model. When on the net it is slow"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Yes very good."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Great tablet"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "It is really good and Ilike it"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I've gone through more than half-a-dozen tablets in the last two years. THIS one is BY FAR the BEST I ever had. It's almost like a tablet/laptop hybrid. Highly recommend!!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I love it"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I really enjoy having this RCA  2 in 1 labtop."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Perfect little laptop/tablet for the kids so they stay off of mine."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Love everything about it. Very quiet .. No ticking noises."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "It's a great tablet for the price. I bought a purple one from here last month but I can't find the listing so I'm writing this here. Overall great, lots of internal memory, plus the options to add an SD card. Only downside for me is the screen. Not the resolution, it's very good. No, it's the fact that it's made of soft plastic not gorilla glass. So I mistakenly thought there was a preinstalled screen protector on it because there was a pull tab on the corner that I thought was for removing a factory  protector... It wasn't... I just got brave enough to pull it off the other day and nothing. Just a small tab nothing more. So now I have a permanently scratched up screen. Guess I'll just have to buy a replacement screen and be smart this time and purchase some screen protectors as well."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Great five star tablet. Great five star value. Gave it four star only because keyboard goes only 90 degrees. Would be easier to use if it went a little wider say even 100 degree or so."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "For the price it is wonderful.  The screen is very nice.  But it does not download some apps.  I needed the WW app and other ones for my studies.  I thought it was going to be wonderful to buy this but it did not work.  Not compatible with 3 of the apps I need.  Other than that, wonderful"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Touch screen is poorly calibrated and unevenly responsive.\nPerformance terrible. Whatever RCA did with the operating system and software mucks up performance.  I have to routinely kill processes.  Keyboard marginally useful.  Case is too smooth risking drops which will damage or break the flimsy packaging."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Awesome"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Very nice budget tablet, decent keyboard, all of it a high quality feel and the tablet is VERY responsive.  Hard to beat for the price."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "I bought this tablet based on reviews and abilities. I needed something bigger than my phone and more portable than my PC. After a week, I am very happy with the performance of the machine so far, including that it keeps cool while streaming videos in keyboard or non keyboard mode.\n\nPros:\nSo far, works as advertised. Fast and smooth. Screen is great for a tablet for around $100.\n- USB Port\n- Micro USB slot\n- Micro SD Card slot (I added a 64gb Samsung)\n\nCons:\n-Initial charge period might make you think it is DOA. Give it at least 1 or 2 hours before you have enough charge to turn it on. I personally freaked out, as I am used to electronics of this type, or anything requiring a charge have enough to \"turn it on\" out of the box, however this was not the case. But, after a full hour, I had enough charge to turn it on and get it set up. Turned off, it took about 8 hours or more to initially get to full charge (I am sure most of these Viking Pro 10's are mass produced and not sold at their original price point, so they have been in a warehouse somewhere)\n-Charging in general. The supplied charger can get hot during charge. It's a plug, not a micro USB.\n- Mine has a weird habit of opening the camera from the lock screen. Annoying and I am sure partly my fault.\n- Semi- \"Con\" ... the casing is semi cheap plastic. So I recommend some kind of case for it. The keyboard plastic is iffy, so we will see.\n\nThe main reason for buying this was to see if I would use it enough to go with a bigger brand name. I might not if this lasts. For about $110 to 120, including keyboard, so far I believe this to be an incredible deal as long as you are not rough on it.\nFor those worried about size of the keyboard, please remember this is a 10 inch screen, so you get a comparably sized keyboard, it is going to be small. Big fingers won't be happy, but medium sized ok. And the mouse cursor is ok, maybe a little sensitive, but I haven't tried to change that setting yet.\nOverall a solid buy for the price so far."}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "Track pad is not that responsive, mouse button in track pad doesn't click well. Good tablet, low quality laptop though"}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "If you want to hook this up to a pc or something else to transfer pictures or video files forget it, it doesn't work, according to RCA the micro usb port is for charging only which btw is really poor I had it on charge through usb playing a game and it actually went down.\n\nIt should specify that you can not move files from this device to another device through micro usb thats actually a noob thing to do even the $35 cheaper and nasty tablets let you do that.\n\nThe speaker also crackles on somethings probably won't buy again"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Very fast shipping great tablet very nice this would be great for kids school work"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "This was a gift for a friend.  The item came ahead of schedule and is way better quality than anything local.  I would recommend this tablet and keyboard combination to anybody.  I was expecting a good value at the price I was paying.  But I got much more.  This tablet is fast,  light,  reliable, has amazing battery life,  and is the perfect size."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "This is a horrible tablet! The tablet is hard plastic and the piece to put the tablet on the keyboard is very bad. All cheap plastic and very breakable! I have very fast internet, but this tablet is slowwwww. It reminds me of a child's toy. I am returning mine today."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Very good product for a kid."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Husband loves it"}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "Not compatable with a lot of apps"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "My son loves it uses it for school"}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "I like it. But I bought it to do school work and it does not support Adobe flash. So that means I can't still do my school work. Any suggestions??"}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "This Item connection is horrible."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Bought this tablet for my wife and she seems to be pleased with still learning but it seems to work well thank you"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Great price for the product. Sadly could not do what I needed it to do for work so ordered a different tablet. But my Mother LOVES it! Very user friendly!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Have had no problems and it's used everyday."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I did not buy this here. I got a better deal at Walmart for $80 dollars. The screen is a very good looking IPS screen and it shows. The viewing angles are very good. The brightness is another good feature. The keyboard is small however it does work. I have used the Chrome browser and Opera browser. Both worked fine however espn loaded up a little slow. Video worked very good for this. I used the youtube app and I did watch some videos using chrome. Both worked fine.\n\nI did play games on this tablet. I played Pinball Arcade and that played and looked great. I also played reckless racing. I have also played Zaccaria Pinball on this and again very positive for that use. Getting over 40fps to 50 frames per second. I have also played Trial Frontiers and no issues it ran great.  I had no issues playing these games. The speaker is not great. It does work. However its a single speaker. However you could turn on the bluetooth and use external speakers or headphones. The keyboard has some weight to it. The tablet feels a little flimsy when you hold it. So I have played around with this for a little bit more. The mouse pad works good its a lot on the small size along with the keyboard. It does work good.\n\nThe weight of this Tablet is light although holding it for a long time might wear our your arm. Not an issue if your using the keyboard. The power cord it comes with is a little short however this can be fixed by buying an extension cord.\n\nAlso just one other point the keyboard does have a volume control so you can control it without having to touch the tablet. Along with brightness and other features. Still enjoying the tablet. Just a few more thoughts. The keyboard will some times get disconnected from the tablet. Even though it is still on keyboard.  I have had to reseat the tablet again and it picks up the keyboard again. The wifi is also another plus its very powerful. Great signal. Also its lightweight. The battery life is around 5 hours or so depends if you watch online videos or not. So if your into games and looking for a cheap tablet that is up to date on android get this puppy. Still very happy.\n\nI recently had  a chance to download and play Asphalt 8 and the game runs ok. I did set it down to low to get a good frame rate of 30fps. Default is medium. While it will play on medium its a little to slow for my liking. So their you have it."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "It's not going to blow you away.  Not at all.  I've owned several high end tablets.  But for just over $100 it is way more than I expected.  The touchscreen is responsive and the keyboard functions perfectly.  Also, it attaches via magnets so you don't have to worry about a clamp breaking.  The screen resolution is fair and all the side ports are easy to access without those annoying pop-open covers.  It even has a full size USB port and an hdmi out which I love.  My only cons with it are that the mouse TouchPad is way too fidgety,  it's pretty bulky, and the on board speaker sucks.  It's not loud at all.  All together, though, I'm very happy with my purchase."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "The resolution on this thing is amazing for the price. Probably the best resolution I have evrer seen for a tablet in this price range. Don't go buying this thinking you're going to get an IPAD. You're not! Lol. It's just a cool little tablet to take with you so you don't have to lug a laptop. It's very reponsive, and to me the size is perfect. The only thing that's kind of lame is the speaker. There is one in the back and it's average. I find that funny, however, because RCA was first known for it's sound. If you're that concerned use headphones. All in all this is a great tablet, and for the money you absolutely will not get a better one. Don't even look. Just get this. The only negative thing I have to say about the seller is that they sent me the wrong color. I ordered black, and they sent me blue. It's alright. I like the color. Had it been the pink one...uh...no lol."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Bought one from WM for granddaughter and it lasted 6 weeks and totally died. Since I purchased it bf Christmas, warranty was expired so she got very little use from it. Was looking on Amazon for replacement for her and thought I'd share. Wouldn't buy again. Not even for 25.00. Wasted money."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "works great granddaughter loved it"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I was very satisfied with everything"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "EXCELENT. VERY GOOD. THZ."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Our portable RCA DVD player broke after years of use and abuse by our children. I decided I would replace it with a tablet instead.  Tablets are super cheap now and actually cost about the same as a portable DVD player, except that they have wifi, apps, games, touch-screens and more.  The only drawback to this plan was that I knew I would have to buy a good sized SD card to go with it so I could put a few movies on it for when we don't have wifi...  In the long run this downfall had some major updrafts to more than compensate for the time and money spent converting DVD video to be viewed on Android tablet.  The benefit was space!  No DVDs to have to carry around, get lost, scratched, etc.\nI will likely never buy a portable DVD player again,  modern technology is bulldozing over and replacing yet another piece of equipment... in a good way.  If you don't already have a program for converting video and media files, I highly recommend \"Any Video Converter.\"  just the free version will do really.\n\nI almost knocked off 1 star, but then I decided to leave it 5 stars.  The quality of the image is not the greatest, but you know what?... I knew it was not going to be an Apple or Samsung tablet going in and didn't expect much beyond simple quality, enough to replace a portable DVD player.  The screen image is as good if not better than portable players of its size... so it lives up to my expectations and beyond.  It runs apps and games quite smoothly too, almost as good as my Galaxy S5.  Here's to hoping it lasts several years like my past RCA portable DVD player."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I like it it works so good"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "A fantastic Tablet. I wanted a replacement for my Kindle Fire because I mainly want a tablet to watch YouTube. Since Amazon doesn't have an official YouTube App, this seemed like a good replacement. (I got mine at Walmart though, as it was on sale for $80 there)\n\nThe tablet is small, lightweight, easy to use, and great for what you pay for. I've played around with more than a few budget Android tablets and have been somewhat disappointed for the most part due to clunkyness, bad performance, of lack of support for popular apps. This tablet works great. All system animations are smooth. Setup is easy. The keyboard dock is superb, it easily sits in place without pulling or snapping it in or out. All the ports (USB, micro USB, HDMI, and and SD Card slot) are a great plus, and the tablet can charge off either micro USB or it's proprietary wall charger. While I wish the keyboard dock itself had a charging port built into it, it's a small nit-pick compared to how great the device is otherwise.\n\nThe only thing this tablet lacked from the get-go was that my Kindle Fire had is access to Amazon Underground apps. But after installing the Underground app, that is no longer a problem. It was a great upgrade for me."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Amazing product given the price: a small laptop and a detached 10\" pad. Decent google Android 5.0 Android system; clean (no uninstallable apps). Other brands like Samsong, LG, Motorola, all have apps that I can not uninstall. This is a clean Google android 5.0, prefect--light and fast.\n\nGood quality of the materials made for the device: solid and responsive. The keyboard is USB attached through a special pin. This keyboard is much more responsive than the bluetooth keyboard which is connected through a wireless bluetooth.\n\nI bought it for myself. My daughter likes it and I gave to her because I think a bigger device at home would preserve her eyesight better than a a 5.5\" cell phone screen. I am thinking to buy another one for myself.\n\nI love this device. If there is something I wish can be better, I would hope the processor would be a bit faster; but given the price, I am pretty happy with the speed of the device. I am willing to pay more for its next generation with more power of the CPU and more recent Android version."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "okay purchased one of these tablets from a local store; opted not to get protection plan because my kid is pretty good with electronics.  Well, the screen broke so I decided to replace it; ordered through Amazon and purchased the protection plan.  Tablet arrived on Tues or Wednesday and it is Friday night.  He just brought it to me; screen cracked the same way the first one did.  Now I am debating contacting RCA or the local store to return the first one.  Since I just registered this tablet to the protection plan, I will wait til tomorrow to put in the claim.  Really would rather return it.  My kid already said we should just return it.  Might call Amazon about it.  Amazon delivery was great; the product itself is horrible!"}
{"rating": 2.0, "product_id": "B0174AUAWG", "review": "The tablet has come cracked and doesn't works."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Perfect for game apps and Facebook and light internet surfing.  Speakers are alittle low thats the only con"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "love it"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "This tablet \"feels\" like it's not as well made as my Asus tablet but it works better.  The touch screen on my Asus is cranky but the RCA is operationally superior.  I have no complaints."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Love it, only on thing, I bought a camera that you could go down in drains and small places like under your house and I couldn't get it to work off my tablet"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Good product for the money. I bought it for my 10 yr old son as his first tablet. He uses for homework and entertainment. He loves the detachable keyboard."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "I bought this from another store on Thanksgiving for my daughter. She has had it just under 2 months & today it stopped working suddenly. It will only power on/off but you can't get past the locked screen. We even tried troubleshooting it & nothing has worked. My daughter is very upset as the return policy is no longer good since its been much longer than 15 days. And, I'll be out even more money to replace this.\n\nDO NOT WASTE YOUR MONEY! THIS IS A PIECE OF JUNK."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "It's everything I wanted in a tablet laptop :) bigger than I expected which is a plus :) and fast shipping! A++++"}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "Performance seems to be good, only issue I have is the tablet won't allow me to put anything on my sd card"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "got 2 for grand kids\neasy set up .they had dragon tab before  we went thru 2 sets of 2 they lasted about 4 months before had trouble with connector ports charging\nso I got 2 of these they seem  very solid the charging port seem more secure the screen more crisp. so far it looks like a tablet they will be able to enjoy. I love the detachable keyboard  very nice tablet ."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "This item is okay if you do not require Wi-Fi while you're on the road"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I got this for Christmas and I haven't put it down yet. I love it. I thought the keyboard might break but it hasn't yet. Usually I break this kind of product."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I love my tablet is is  great  the only thing i have found that i didn't like was a couple of the apps  i have on my android phone were not compatible  so i could not get them in the google play store, but i was able to save them as favorites"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "My wife gave me a Viking Pro for Christmas. I thought you would be interested in my experience with the device.\n\nFirst the keyboard is not compatible with the tablet. Pressing a key gives unknown results on the tablet. For example pressing the shift key inserts a heading.\n\nPressing a key on the tablet also sometimes results in a different character than the one pressed showing up on the screen. It is necessary for some letters to hunt around for the correct spot to press.\n\nSometimes an app will not open upon a tap. Several taps can be necessary. I have had  another app open other than the one I have selected.\n\nI have been scrolling down through an app and have the app close and another one open.\n\nI have had the whole thing freeze up. A reboot is the only way out.\n\nThe speaker is very poor quality. It is not fun listening to music with the speaker, I use earphones.\n\nThe camera takes good distance pictures but the selfi mode gives nothing but a blur.\n\nNow for the most unusual problem I have ever seen. I cannot get access to an account requiring user name and password. There is something different about the characters in the password. I get the error password and user name do not match. I wanted to use Netflicks so I created a new account with username and password on the tablet. This gave me access. Only to find out the Netflix app does not work. It gives a great picture (I like the screen size) but the audio was terrible. I have played movies from the USB port and they work fine.\n\nI put the keyboard in the trash, put some free games on the tablet and gave it to my grandson. He is very happy with the device.\n\ncheyenne8811"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I bought this product primarily for a one month trip to Spain. The mini-usb port allows for easy DC connection while using google maps (offline). I bought it also for its hdmi port which allowed me to connect to Netflix via TV... excellent clarity even with low bandwidth. Of course, the flexibility of a two-in-one speaks for itself. The screen size is just right for my purposes. The full usb port works with a mouse and flash drives. The speed along with lollipop is excellent and has yet to freeze. Some have complained about the keyboard, but all the functions on mine work flawlessly. It may be the version of 5.0, but there is no switch function for which camera side to view. If someone has figured that out, please  let me know. Although it could be my VPN service working with google, I couldn't get it to work... Otherwise, what a great product at a great price! Thank you, RCA."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Bought for wife for Christmas, and so far so good. Had a major brand tablet at twice the price, and 1/2 the storage that failed exactly 2 weeks after the 1 year warranty expired. Cost of repair would be near the purchase price of this new. Decided to try this Viking Pro rather than buying another $200+ brand name.....\nPicture is good, keyboard is good, and the contacts between keyboard to tablet do not \"plug\" together - it is just surface contact. The type that \"plug\" together have failures due to the \"rocking\" and flexing of the tablet / keyboard. This one will not.\nThe picture seems good off center and does not fade out; tablet is adequate as to speed and handling apps; easily works on internet.\nOnly downfall so far is a relatively short battery life."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "This is great a real value highly recmomend"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "ok"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "This was a greatly appreciated Christmas gift, receiver is really enjoying it!!"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "enjoying the android system"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "This is a good machine.  My previous RCA tablet got broken. This one has more clear screen definition from angles. - the previous one had to be viewed straight on. My only issue is that this one has Android 5.0; I guess the other was 5.1, and I miss the very slight difference in function.  This is good value for the price.  Remember that it is wifi only.  It has ample internal memory plus external card."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "I bought 2 of these - one is great - the other, broke in 3 days.  should have bought the insurance."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "arrived and works as advertized"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Awesome laptop but I can't download apps and games"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Perfect size and easy set up made this an amazing first computer for my 7 year old!!"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Great little tablet!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I love this! Super easy to use! Durable! User friendly! Super happy with this purchase after purchasing some that I wasn't happy with..."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "The first time I purchased the tablet it came broken (there were two cracks in the screen) even though the packaging wasn't damaged, which makes me think it was broken before the seller sent it.  It was is very frustrating since it took a week to arrive even with Prime shipping.  I ended up returning it and buying from Reutz Deals instead.  They got the tablet to me a day early (it took only two days to arrive) which is awesome and this time it was in perfect condition.  They also contacted me later to make sure the tablet was undamaged and working for me.  So overal I highly recommend buying from Reutz Deals if you're uncertain.\n\nI've used the tablet for about a week now, and so far it works great!  It's fast, the screen is crisp, clear, and bright, and the keyboard is awesome.  It's surprisingly high quality considering the price.  My only complaint is that the sound isn't very good when watching shows or playing music out loud on the tablet, but this is easily fixed with headphones or a bluetooth speaker so it's not too bad a problem.  Overall I'm very pleased with both the seller and the item."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "Shipping and price very good. Haven't had it long enough to comment further. After using a more informed review can be done."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Great"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Nice tablet but cannot run printer from it"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "My daughter and I really like them. Very good for the price. We are very happy with this purchase."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Computer works fine but was not in the color I ordered, I ordered blue and it came in Pink but other then that it was good,"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Nice inexpensive android tablet. Works great for email, facebook, games, etc. Easy initial set-up. Keys on keyboard are much closer than a laptop, so it takes some adjustment, but it works. Stylus helpful for gameplay."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Bought at a big box store as a tablet for the family since we only had the original kindle fire and the fire wasn't what we needed. This was mainly to help me watch my fitness videos in the morning, browse internet and email, and get apps for learning for my preschooler. Being a touch screen and having a keyboard makes it great and my little guy loves starfall and ABCmouse.com apps. He happily learns while he thinks he playing games.\nIt take a bit to turn on at first, but that's only if you turn it off completely. Sleep mode it wakes up really quickly. Still working on different apps and can't find a compatible app to stream Amazon Prime movies/TV shows through google play, so that's a bummer, and can't buy apps through amazon for what I've found. Picture quality is horrible, but hey, I have a phone to take pictures and videos, so no big deal. But overall, I love this little tablet. Way better for the price than the ipad or Samsung galaxy!"}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "I bought this tablet from Walmart. I have never ever written a review for a product I've boughten but I had to for this. Don't buy it. I was so disappointed. I have exceptional Internet at my house yet it's slow. I have maybe 4 apps downloaded because anymore and it freaks out. If you attach the keyboard the cursor pad is horrific. You use the left side more because that's how you click on things but the it makes the right side go up making the pad uneven and then your cursor freaks out and won't work until you push the right side back in. But by clicking the right side either exits out of the internet page your in or shuts everything off to the main homepage. If you try to have more then 2 or 3 tabs open it just says chrome not reaponding. The chargers are very very flimsy. I already had to Order and new one and that one is about to break. Volume doesn't go up very high. It asks you if you want to block pop ups. Even when you say yes it doesn't work. You click on anything and it pops up another tab with junk. I'm so unbelievably disappointed. I wish I would've spent some money and just bought a laptop. I'm one of those people who reads a bad review and thinks, no this won't be me I'll get a good one. I'm serious do not buy this."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "This is probably the worst tablet I have ever used. The screen is plastic, not glass. It is slow and sluggish. If you are used to the performance of a smart phone, this tablet will feel like an old relic. Avoid at all costs."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "I bought this product At Walmart. I'm rating to three starts, because I do love this tablet BUT it seems to be defected. It worked great the first time I put it on. But after that, anytime I try to turn it on, it just automatically goes to the system reboot screen. So I tried to reset it , and then it just stays on the logo. I tried looking for answers online. And it seems that a lot of people are having the same problem."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Oh my I just Love this product, it has everything a 9 year old could ask for he even went to sleep with this in his bed !!!"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "If you're searching for an equivalent to a Samsung or Apple Tablet, continue your search. This tablet is in the category of the Kindle Fire. It's a low end tablet, however a darn good one for about $100. Some people have commented that it could be made of better quality, etc. Again, this is a $100 tablet, not a $600 tablet. You get what you pay for-usually. This tablet exceeds the price tag and I'll tell you why....\n\n-Very functional\n-Well built for the price (not the most aesthetically pleasing, but it's hard to screw up the look of a tablet)\n-Good picture quality for the price\n-The touch screen is not clunky at all. It's very responsive.\n-This is basically an Android Phone without the phone (If you know Android, the OS is the same thing here)\n-The keyboard is very responsive and built surprisingly well.\n-Keyboard disengages from tablet very easily. No locking mechanism. It just slides in and out.\n\nOn to the reasons why it's $100.....\n\n-Sound quality is poor. It's not muffled, it's just very low. You'll find yourself checking early on to make sure it's up all the way. You'll then realize the sound is just utterly low and not great quality.\n-It takes an oddly long time to boot up. I'm not sure why, but I thought it froze on a few instances. Be patient with it.\n-Not the most attractive looking tablet.\n-Not recommended for replacement of a real laptop/computer. I feel that the keyboard while built very well is rather obsolete because it doesn't function well as a computer. This device is best used as a inexpensive tablet replacement.\n-The camera is dreadful. You'll get the same image quality out of a baked potato. Horrible!\n\nOtherwise, this is a really good tablet w/keyboard for the price. It's hard to knock this at the price truthfully. Again, just don't complain when you're not getting iPad quality. Hello.....look at the price. If you want just a simple tablet to play games on, watch some Youtube, check mail and do some general browsing, this is a great buy. If you are looking for a main source as a computer, I urge you to pony up a few more hundred dollars on a low end laptop or just get a higher end tablet. I hope this helps."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "The perfect size"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "I got one delivered Christmas eve, and while rather different (first time working with an android 'laptop') it is good. A delightful replacement for the latest generation Fire 7inch HD I am giving away to my brother, which annoys me immensely. NOTE: one speaker, sound level is modest. The virtual-mouse 'scratch pad' area is too fast for comfort and cannot be adjusted in this generation of Android- an update for the driver could sure help on this! It works fine with a wireless Argus mouse however."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Received as a gift for Christmas. I've been setting up various Android devices over the past few days for friends and family members and this is the first one that gave me a runaround. Don't sign in to Google when you first start up the tablet or the Play Store will not let you update apps. Wait until after finishing setup and then open the Play Store and sign in from there.\n\nThis is not a lightning fast tablet. It does slow up a bit during normal use and videos aren't butter smooth, but are watchable.\n\nThe keyboard is cramped for a right-handed typer like me (right shift is tiny but left shift is large. I wish they would get rid of the \".com\" button and make the right shift larger.\n\nI'm typing this review from the tablet now. Arrived at 99% battery but I let it sit on the charger for an extra hour just because. Two hours of continuous use and updating apps and downloading more apps over Wi-Fi and it was down to 74%. I'll post an update to this later because it is about to spend four days out of town with me and I plan to use an HDMI cable to watch Netflix on the hotel TV so I can see how long it'll run doing that.\n\nIn the meantiime I'm excited to have something light and compact to replace an eight pound Acer gaming laptop I've been using while traveling that also has a bad screen cable and I must bring a monitor to use it.\n\nI'll also update the review to let you all know how well an external mouse and keyboard work."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "My son is happy with my purchasing this item for him and he is able to watch videos and movies without slow movement unlike the 2 Irulu i purchased."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I've used many tablets over the years including the fruity one and Samsung's and while there products are good, they are in MHO, somewhat expensive, for most people. This tablet, for my use,..surfing the web and streaming music via BT is incredible!! Its fast with a very nice screen and excellent battery life. Seriously, for the money, it can't be beat. I don't use the keyboard alot but it also works well!!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "First of all, let me comment that I often receive free items to review from Amazon to review.  This is NOT one of them; I decided to spend my own cash on this device, so be assured it is a genuinely unbiased review (I did get it as a Black Friday deal at a major retailer, but paid almost as much as the normal Amazon price).\n\nI have a long history with tablets.  My last Android tablet was an Asus Transformer TF300, which as of late 2015 still sells USED for double what a new Viking Pro costs.  I indeed sold my old Asus because it performed horribly, even after fully factory resetting the darned thing.  The screen was gorgeous, and it felt great, but it just was not usable.  On to my review of the Viking Pro (\"Pros and Cons\").\n\nPROS\n- The screen looks great; I was afraid the viewing angles would be bad (as many other cheap tablets are), but the screen looks fantastic from any angle.\n- Expandable with a micro SD card slot.\n- Blazing fast snappy performance; beats the pants off my Asus Transformer.\n- Sound is decent for a tablet.\n- Has all the ports you do need, and none that you don't (has mini HDMI, micro USB for charging, etc).\n- Has physical volume up and down buttons.\n- Comes with a keyboard (probably won't get much use from me, but it works seamlessly)\n- The price for what you get is unbelievable.\n- Runs every piece of software I can throw at it, including very power hungry apps like pinball games, Baldur's Gate, Temple Run series, etc.\n\nCONS\n- Plastic construction doesn't \"feel\" as good as my old Asus (or an iPad, for example).\n\nIn summary, this is an incredibly wonderful tablet that competes with tablets that are more than double in price.  It does everything I need it to do, and is truly the best performance bargain in the tablet world at this time (as of late 2015).  Highly recommended!"}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "For the price, this tablet is OK. It could be better. It could've been made of better material. It's super light-weight. It's definitely made of cheap plastic. The touch screen feels, looks cheap and scratches easily. The screen resolution is acceptable for such a cheap tablet. I think this tablet is a good starter for newbies who are looking to get into the tablet market."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "I bought this at Walmart for $79.99  I have to say that for the price I cant complain. The keyboard is solid and works great. The tablet is lightweight and built very cheap, plastic case, but it delivers. I would recommend spending a few bucks more and getting something better. I ended up buying another Tablet after this. I bought the Visual Land 10\" Prestige with keyboard and case for $149.99 from HSN. It's twice the tablet but twice the price. It also has Octa core which is very sweet. The bottom line folks is you get what you pay for!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I purchased this tablet from Amazon when my Nexus 7 (2012), which I used to luv, became so erratic it was unusable. I wanted a budget tablet with a larger screen so I was glad to find a 10\" tablet w/quadcore, a keyboard, 1280X800 resolution, 2 cameras, etc. I bought on cyber monday 2015 for $96 minus $15 gift card for a total of $81.00. For my purposes, this tablet is amazing. It starts up quick, has good battery life, and response is fast. The 10\" screen is so much easier on the eyes than the 7\" Nexus screen. I could not be more pleased with my purchase."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Bought it for my 8 year old son. The tablet and key board combo was a great buy for $79.99. It has google play, fast processor for all games he plays, movies play perfectly. Plus it comes with a word, power point and excel program built-in. 6hour battery life is fine. But was is nice is that it has a regular usb port which he uses with his  regular computer game controller to play games with. Overall great value for a beginner's tablet."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "This was really nice,pretty son loves it.came early time,if not have been home it could have gotten stolen. They did not ring door bell...i had a sign to ring door bell.,because of thiefs stole my son Christmas last year and so many times before. Other than that great'"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Its nice. Big screen. The volume is low on it, even at it's highest."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "Things I've found out so far:\n* MicroSD card slot: Supports up to 128GB. Cards must be in the FAT32 format for the tablet to recognize the contents. Android 5.0, the tablet's OS, can format one in the FAT32 format.\n* USB 2.0 port: Same story as the microSD card slot--up to 128GB, must be in FAT32.\n* No direct file transfer with Windows systems via microUSB connection. Workaround: WiFi file transfer apps are fast (and spare a USB port on your desk/laptop).\n* ~5% power drop over ~12 hours when in the sleep mode (via either screen timeout or short-pressing the power button). Note: Wi-Fi and Bluetooth off, sync off, all apps are closed.\n* Cameras: 2MP in the back (just OK) and 1MP in the front (barely serviceable)\n* Speaker? There is one, but then better use Bluetooth or the headphone port.\n* Keyboard: Cramped and temperamental, but serviceable with practice. Standouts: camera figure for screenshot (not camera); screen off long for power off, short for sleep mode (not sure yet).\n* Touch pad: Temperamental but serviceable, right-click for the back function."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "It was for my dad as a christmas gift and it came earlier than expected (with manual and in a box) so thumbs up!\n\nI had just some problems dealing with the language program because it had Korean as language setting but not for the keyboard settings (how funny) so I had to buy it in the google play that would actually work."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "So far, so good.  Whether this tablet can replace my laptop remains to be seen, but my primary reason for purchasing this tablet was to have a device for the purpose of productivity that can be used as a strictly Wi-Fi access device.  The Google Play store offers Microsoft Word as an app, so have downloaded it.  The tablet started up quickly upon first power-up and has down a firmware update without incident.  Still not sure about the cameras; may need an area or time of day with more light before I can be sure of taking photos on the device - images were a bit murky.\n\nFor the price, however, not bad at all.  Keyboard a tad cramped for my fingers, but still getting used to it.  I actually paid less for this item than I would have at Walmart, and as I got it through Amazon, I'm more certain of the quality."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "The RCA 10\" tablet is not a good tablet to purchase. It has a cheep plastic case and a plastic, not glass, screen. The screen quality is OK straight on but poor at an angle. With only one gig system memory it is slow at multitasking. It seems that quality control is lacking because the unit I bought failed to have a functioning on-screen keyboard. The attached keyboard worked fine, but one needs an on-screen keyboard to use it as a tablet! The output of  the speaker is poor. Thus, I returned it. I am disappointed that RCA put their name on this tablet. I would suggest, if you are looking for a tablet, shop for something else."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "I wanted something smaller than a laptop for traveling, this seems to be a good size. Even though keyboard will detach, if has the laptop like property of being able to adjust the angle of screen and it staying place. I don't use any computer for games so I don't know about that, but it runs My Sword for Android (Bible app) wonderfully, heavily use Facebook (in Opera browser) and instagram. Has more volume than my laptops. Opera seems faster than Chrome. For $79 Black special I am delighted."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "While this tablet isn't perfect, it's a really good one. From reviews I've seen, there are so many who claim that it slows down when it updates. That hasn't happened for me, and it's already updated. While the keyboard is something to get used to, since it's a smaller thing to use, it works rather well.  Contrary to what other people say, I've found that my tablet does connect to a Windows laptop via the usb. It connects like any other usb device that runs android and allows me to look at and make modifications to what is already on the tablet. The speakers are not the best, but with either headphones or a cheaper bluetooth speaker, you'll be just fine. Overall, this is really a good buy! Anyone wanting a small \"laptop\" feel would be good getting this. It's perfect for taking notes in class as well!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "I bought this tablet for my daughter's 50th birthday less than a week ago.  I got it from a discount center but I'm looking for another one for my husband for Christmas.  The price was great and my daughter has stated that \"it was the best birthday present she's ever received\".  I'm the computer person in my family in that I keep our ancient computers running.  This tablet does everything with ease, has a large enough screen so you're not straining to see it and the detachable keyboard is an added plus, at the same time, you also have the touch screen.  My daughter lives next door to us in a mobile home (60 ft away) on our acreage and she easily picks up the internet from the router in our house with this tablet.  As I said, I love this tablet & expect to buy another for my husband and maybe sneak one in for me too down the road, lol."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "First let me say that I did not purchase this tablet on Amazon, I found it on sale at a discount retailer.\nI have been using it for approx 4 months now and I'm very satisfied with it.\nThe tablet is very budget friendly and well worth the $$$ spent.\nIt runs Android 5.0 and has a very crisp and clear display even though it's not rated as HD.\nThe detachable keyboard is certainly a welcomed convenience and makes handling a lot easier.\n\nI have 2 complaints - (1) seems to take an unusual amount of time to boot up.\n  (2) very slow to charge even with the RCA supplied charger.\nOverall, it's a very nice tablet and highly recommended."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "great tablet for the wife"}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "I like everything about it."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "I got this for my 7 year old son thinking it would be good enough for a kid.  The tablet is slow, constantly glitchy and the picture resolution is really terrible.  As soon as I am able, I will be purchasing something else for him.  Spend a bit more and get something better.  Dont waste your money on this."}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "What a shame!  After doing such a great job building this tablet and such a great price, and then skimping on the sound!  I bought this as a gift. After seeing it and setting it up I had decided to buy another one for myself to be a backup for my Nexus 10, until I turned on the sound. The lack of volume is a death blow for this tablet."}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "Have had this tablet for about 5 months now and I love it!! Its not the fastest tablet but once you have been on it for a couple minutes it speeds up. I gave my Kindle fire away and replaced it with this product because of the android operating system it has. I was able to download more apps than the fire and the pictures, I would say are the same. I use the RCA for reading book, comics, emails and surfing the internet. I really love the keyboard it comes with. Its a small and compact unit. I couldn't beat the price and like I said earlier if you like the android operating system don't look any further. I only have one knock on the tablet and that's the sound speaker it comes with. Its not the clearest but I used headphones with it so it doesn't matter."}
{"rating": 4.0, "product_id": "B0174AUAWG", "review": "If you're like most people, you have a laptop for the resource-intensive tasks (work, school, etc.) and a cell phone for the on-the-go tasks (calls, messaging, games, etc.). A tablet is usually positioned somewhere in the middle for things that don't need a high-end processor, yet require a screen bigger than a phone, for things like streaming, e-book, surfing, etc. A lot of people turn to high-end devices like iPads or Galaxy Tabs, but I ask, why?  Processing power already comes with the laptop, and  you already get mobility with your phone. So there really is no need to pay premium pricing for  tablets. Hence budget models like the RCA Viking Pro fill a very important niche: for people who just need it for entertainment  (movies, social media, email) and other escapist activities.  At $80, this is one of the cheapest ways to fill in the gap, so I can watch Netflix, shop on Amazon and play Android games. And the addition of the keyboard is handy on the few times I do actual work on it, either quick Google docs, answering emails or making reservations. I did take away 1 star because you do get what you pay for. But what you get is still a lot."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "Terrible purchase. Was extremely slow, nothing would load hardly and when it did it took so long. I believe it was plagued with multiple virus from previous owner. I wasn't aware that it was refurbished. Nothing said it was that I'm aware of."}
{"rating": 1.0, "product_id": "B0174AUAWG", "review": "When I received this product one of the buttons wasn't working properly. Contacted the seller who told me I'd have to go through the manufacturer. The link to email the manufacturer doesnt work, their website doesnt have a place to start a warranty claim only check the status. The two times I've called RCA I was on the hold for over 20 min without speaking to a single person and ended up hanging up out of frustration, and did not speak to a single person. Most likely I will be returning this product because that seems to be my only option!"}
{"rating": 5.0, "product_id": "B0174AUAWG", "review": "it looks exactly like the picture and works great"}
{"rating": 3.0, "product_id": "B0174AUAWG", "review": "Disliked the color being only on top instead of all over. Liked the weight of it. Nit heavy or bulky.  Looks very cheap."}
