{"rating": 5.0, "product_id": "B018QAYM7C", "review": "The Galaxy Tab E is just what I wanted in a large screen tablet for my everyday use that was not very expensive but still perfectly capable.  I realized a while ago that even though I love tablets my actual use in no way justified spending hundreds of dollars on a top of the line model - not for browsing the Internet, watching YouTube videos, writing, and reading.  I also like to take my tablet with me everywhere - trips, work, and places I can sit and do some writing - so an affordable one is just way more practical.  Ive used small size tablets for a while but found myself missing a big screen, something in the around 10 inch size, but finding something with good enough performance at that size without spending quite a bit was difficult.  Enter the Tab E.\n\nFrom my use of it I feel Samsung has struck a good balance between price and features with this one.  There are a couple of areas where you can tell compromises were made for the sake of affordability but for a general use tablet if a big screen matters to you this one is hard to beat.\n\nGreat things about the Tab E:\n-The screen is big, colorful, and responsive.\n-Performance is absolutely stellar considering the price.  Everything is smooth, apps open quickly, switching between apps is fluid, and even running two apps at once works with minimal slowdown.  It has handled everything I have thrown at it with no problem and never a freeze or even a hiccup.  I was able to use it while it was installing and downloading multiple apps and updates when I first got it and not really notice.\n-It is running a very recent version of Android - 5.1.1.  You have all your Google applications and everything you would expect from the operating system.\n-The shape is really nice.  This is a very rectangular tablet.  Widescreen is great for video watching and it is comfortable to hold.  It is not a big square slab like my old Tab 4.\n-It looks good and feels very solid.  It has some substance to it.  Some might call it a bit thick or bulky but I like its solid feeling and it certainly does not seem cheap.  It is missing the usual bright metal strip around the outside edge of the tablet but I like the more uniform all black matte look used here.  The back has a grippy textured molding.  Mine is in a case so I don't notice this much but it would not be slick or easily dropped without a case.  All buttons (home, volume, power) feel solid and very clicky.\n-Battery life has been excellent.  I charged it full the day I got it and it was not until three days later I needed to charge it again and this was after considerable use.\n-There is an SD card slot for video storage to supplement the 16GB of internal memory.  I think 16GB it a little limited but expect it at this price.  The SD card slot makes it workable.\n-Wifi connection is strong.  It gets full signal anywhere in my apartment and it both loads websites and downloads content quickly.\n\nIs is for Economy.  Less good things to keep in mind:\n-While the screen is big and colorful it does not seem as high a quality overall compared to other tablets Ive owned from Samsung.  The resolution is not bad at 1200x800, which is really what I expected for the price.  However, you can basically see a pattern of thin lines throughout that just says budget display.  It is hard to describe what this looks like and it is not a defect as Ive seen three of these tablets (my own and two local display units) and the screens all look the same.  The screen is fine, just seems like cheaper/older/etc. tech.\n-The speaker Every review has mentioned the sound.  I was expecting worse, considering.  The sound really isn't THAT bad, a little tinny, but the problem is with the placement of the speaker.  There is one speaker and it is on the back of the tablet near the camera facing away from you.  I really won't get why it was designed this way.  I have a case that folds over and I find this helps redirect the sound towards the user.  If you want to seriously listen to music I would recommend headphones or a bluetooth speaker,  It is fine for streaming video as far as Im concerned.\n-Some might find this tablet too thick or heavy.  It is not super thin and weighs a little over a pound.\n\nOverall I would absolutely recommend this tablet if you want something budget friendly but a large screen is important to you.  I did not really discuss camera but I just don't use the cameras on tablets, especially large tablets, so I don't really have an opinion.  Keep in mind it is a bit heavy and the sound is average.  At this price for a well performing tablet from a name brand like Samsung  the Tab E is a very good choice.  This is a basic tablet experience - no bells and whistles but smooth performance and function.  I am very happy with mine."}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "Good tablet for the price.  Speakers are poor."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Please take my review with a grain of salt; this is my first tablet of my own.\nI've had this tablet for about a week and a half at the time of this review. My purpose for purchasing it was to have a convenient device for college use, and, I'm not going to lie, to have some fun with it by watching videos and listening to music. For the price, it's everthing I could have hoped for. It runs at a decent speed, has great screen quality, and has a lot of great features. It comes with Microsoft Word, Excel and Powerpoint, which is a huge plus for me. I can sync music directly with Windows Media Player, which is  a huge relief since I don't have to wrestle with the travesty that is called iTunes. The internet reception is strong, and the device is bluetooth-capable.\nThe camera quality is decent. In fact, my iPhone has a better camera than this device does, but I don't find it to be that bad.\nThe speakers, though, are the biggest drawback. Pretty bad quality; very tinny. I recommend listening to media with headphones or a bluetooth speaker.\nMedia, such as videos on YouTube and Netflix, work without a hitch. The screen quality is great.\nAnother plus: this tablet just LOOKS good. Samsung does a good job of making their tablets aesthetically pleasing, and this is no exception. Very sleek and eye-catching design, and feels good in your hands.\nThis tablet isn't the fanciest or highest-performing tablet out there, but it's all I need for school and general media use, and I'm very satisfied with it. It does everything I could ask of it."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Got this for my mom. She loves it. It's simple, has all you need if you just want a tablet to run games, surf the web, and check your social media. Just expect a ferrari when you pay for a corolla and you'll be okay."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great tablet. Got it at a great price. I don't use it as much as I thought I would, but that's my fault. I wanted one large enough, and this definitely is."}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "I have had my tablet for a couple of years and loved it until about two weeks ago. I try to sign in and the screen keeps jumping back and forth. I have to restart or power off in order to sign in. Other than that it's been great. I did shut it down weekly before this started. Anybody else with this problem?"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Works very well."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "Getting a replacement, this one keeps shutting down"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Muy buena"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I love my tablet and it is great so thanks"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I purchased this to carry while traveling, so as to not have to carry my laptop that seems to get heavier with each trip.  I bought it to use it to read/answer e-mail and do some internet searches and reading.  It's a good size and weight for those requirements.  I haven't tried to view video on it, but that's not my requirement."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "Returned...Speakers were measured...and found...wanting..."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "The speaker is really bad on the tablet. I have to use ear plugs or the sound is really muffled. I can't use it to listen to online courses which is one of the main reasons I bought it.  It is refurbished so maybe I got a bad unit. Really disappointing."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Excellent tablet"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I use it to read my bible at my sunday meeding"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great tablet"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Much easier to navigate than an I-pad"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "dont know why anybody would buy an iPad for the price of this one, love it"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "easy to use, affordable and works well for student life"}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "its stuck in a loading loop where even after factory resetting its stuck on it.\nnever buy this tablet as a lot of other people have this problem as well.\ntook it to the repair store around me and said its a software problem that they cant fix and that i have to sent it to samsung for warranty and that its their fault"}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "Wanted a tablet very compatible with my Samsung galaxy 8. Basically tablet A is a waste because it is Wi-Fi only. Tablet E is small and not compatible with many apps, even Samsung apps. Don't waste your money. Buy something else or wait for Samsung to finally produce a quality tablet.... they have not to date."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I had to get this for my work due to a new security feature where I enter a password on my pc as usual, then must enter a code in response from software company, on the tab.  It didn't take long until I began to really enjoy the tab's features.  It's like having a fancy phone's features without the high price ... and no phone of course.  Less than $200 vs. ... well you can google prices of iphones, etc.  Do get a stylus and a case.  I added plastic protective cover too.  All purchased on Amz."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Whether watching a video, reading a book or answering emails, the ease and resolution of this tablet is perfect.\nI love that it fits in my purse or suitcase easily."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "I made the assumption it would come with at least microsoft word."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "El producto nunca me llego psima compaa de envos me robaron"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "excellent product?"}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "If you're a smart buyer and read all of the 1-star reviews when considering a product, read on.  Shame on me for not doing the same.  I am the father of a family of 5, two of my children are autistic and live and die by their tablets.  I have had many tablets over the years, literally dozens, the vast majority Samsung as they generally build a quality product at a sensible price.  Do not let the attractive price of the Galaxy Tab E lure you in.  I purchased this item to replace a Galaxy Tab A that was left out in a rain storm and I have never been more disappointed in a purchase.  It looks the part, and it seems as well built as any other Samsung tablet, but calling it under-powered is an understatement of epic proportion.  So much so, that it couldn't even play half of my daughter's children's games.  Talking pet games would hang eternally upon startup.  Everything was super-slow and laggy,  YouTube would take minutes to load so I assumed I received a defective item.  I performed three factory resets but nothing helped.  It was only then that I looked at the 1-star reviews and found that what I was experiencing was typical for this unit.  It is just a current tablet that performs worse than my 4-year old Galaxy Tab 3 Lite which was a budget unit then.  I ultimately packed up and returned the Galaxy Tab E, eating the 20% restock fee and found a used, like new Galaxy Tab A for the same price and my kid is happy once again.  Stay away from this turd, increase your budget, or try to find a used Galaxy Tab A as I did.  If I save one of you from massive disappointment, my job is done."}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "Power cord broken"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "It's getting better.  I'm new to Samsung, was previously an apple iPad user, so it does take some time to adjust.  I bought the 9.6\" which is very nice, however, it is heavy!  It's super clear, ( I got the E Tab).  The only thing that I REALLY dislike about it is the sound & the location of the speaker.  The speaker is on the back so the volume has to be all the way up or you won't hear anything.  If I  use my ear buds, I still need to up the volume."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "This is a great tablet!!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Bought this for the girlfriend , she seems happy with it"}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "Garbage"}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "Not a reliable tablet. The durability is very low. Stopped working in 8 months after purchase. Seems like many people faced this issue. Stay away from Samsung and its crappy electronics."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "It works wonderdull. It was for my son and he didn't complaing about it"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "It was a perfect tablet back in 2015 but today is a bit on the weak side - limited RAM and limited  flash (that can be mostly compensated by using a MicroSD card). Everything else is as good as other Samsung tablets.\nSamsung Kids Mode supports unlimited number of applications."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Love this tablet. It's fast, great size, not too big, not too small. I can go on social media, watch YouTube and Netflix. The display is awesome. Plenty of storage space as well."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Just what I wanted. Right size for those with crappy eyesight."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I love this product the size is amazing for his age"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I bought this tablet for my dad through ATT.\nHe's about 50 and not really tech savvy but has no problems using this tablet.\nHe mainly uses it to stream music and videos/ movies.\nIt has great resolution and good sound.\nIt runs fast enough that we've never had issues with buffering etc.\nOverall it's a really nice tablet & I would recommend it"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "great"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Bought it for my wife as a replacement for a older smaller Samsung and she loves it."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "Very poor sound and extremely slow processing speed.  The speakers in this tablet are of the lowest quality, and the processor is very low grade.  It cannot even process a live Skype call.  This tablet is an embarrassment for Samsung."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Affordable. Love my new tablet!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Love this tablet."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Works flawlessly!  Samsung at its best."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "No complaints! Works for what I need it to, light internet surfing, writing, document access, and YouTube videos."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Easy to set up and use."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Very good"}
{"rating": 2.0, "product_id": "B018QAYM7C", "review": "It didn't fit the standard it moves very slow and freezes alot"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Very Good condition, i love it!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "This is a wonderful tablet. I bought this to use as a general entertainment toy, but its' capabilities run deeper. I am a true believer in Samsung and they have yet to let me down. The screen size on the 9.6\" is perfect. Big enough for two people to comfortably watch netflix or home movies. Small enough to easily pack into a backpack or other traveling bag. Battery life has been beyond satisfactory. It was a few days of regular use before it dropped to 30% and i decided to plug it in. Screen response when tapping buttons or changing screens for different apps is spot on. And i can use OTG (on the go) cables with it to attach my several flash drives i use to view my gopro footage with it. Fantastic piece of technology. Ideal for anybody looking for an affordable tablet to use. Great job samsung!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great tablet. Fast shipping."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "Battery died 4 months ago. pos"}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "Bought 2 of these just 8 months ago.  One is already useless.  Battery won't stay charged.  Actually drains while its plugged in.  Love samsung products, but this is dissapointing."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "Charging cable doesnt work in day one."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "For a sub $200 tablet this is a great value.  Main function is my kids watching TV and movies on vacation and light internet surfing.  The only noticeable 'value' based item is the display.  Similar to other reviews it's hard to describe, but the screen looks interlaced (has very faint horizontal scan lines) showing.  Adjusting the display scaling (font size and zoom) compensates if you make everything bigger, which is actually really nice and easy to read in the car.\n\nDon't buy this expecting a $500 tablet display and performance."}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "It works, but not crazy about this tablet.  It's a little to big and a little too thick to hold comfortably.  I've had a hard time finding a good sleeve that will fit it snugly.  The touch response on the screen seems a bit off.  It doesn't recognize when I tap in some places and other times assumes I tapped when I didn't.  I really do like the Samsung Galaxy Tab products (this is my 3rd), but when this one gives up the ghost I'll be going back down a bit in size.  (like the Pro)"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "perfect fit"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Muy bien"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Good product works good."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Love my Galaxy Tab E. Everything I expected"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Very good a little smaller then I wanted so ended up getting the 10.1"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Everybody loves it. It's the one thing that the twins can play games on."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Excellent! I'm impressed by the battery life. I rarely have to charge it."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Love this tablet. Small enough to take anywhere without being intrusive and has all the power I need to stay in touch when I'm away from home."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "For some reason I thought it was bigger but it tuned out to be a perfect size."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "I bought one of these from Best Buy.  Regrettably I had to return it.  I found it useless.  I was inclined to use it sideways (sorry I don't know the correct term).  The buttons for switching between apps are built into the hardware, at one end.  So, when it is sideways, and you try to type on it, the meat of you palm, beneath your thumb, hits the button.  As a result, as you are typing, it will suddenly minimize the app you are using and bring up another app.  It makes it impossible to use."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "Stopped charging after a couplet or of months. Used s new charging cord and worked for a little while. Did this several times. It appears as though the charging port is faulty.\nToo late to rerun. What a piece of junk."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "Buen dia. Me podrian indicar en donde dejaron el pedido. Ya que la persona que esta en esa direccion no la encuentra. Gracias.\n\nGood day. You could indicate where they left the order. Since the person who is in that direction can not find it. Thank you."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Very nice"}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "OMG I never imagined performance could be an issue with a tablet.  This thing crawls.  It is useless.  I cannot bear to just toss it, but that is the only answer.  I did a ton of performance work on it to try to improve it.  I got it from crawl to limp, but no where near usable."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "very nice"}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "Worst tablet ever had. Always lagging. DO NOT THINK use multiple app on this tablet! Couldnt even use single app and game. Thats the reason why i always prefer ios."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Love it"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Its a gift for my grandchildren I haven't used it waiting for them to visit to see how they like it"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Good"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "My grandson loves it."}
{"rating": 2.0, "product_id": "B018QAYM7C", "review": "This tablet is a very nice tablet it's nice and big but what I don't understand is why they didn't just make it a full 10 inch.es The tablet is 9.6 inches all they needed to do is add if you more to make it 10 inches but more to the point let's talk about the software the software is easy enough to navigate you only get 8 GB of internal storage which in today's world is not enough space to really put it to work. But I did manage to download a couple of things and I tried those apps out and they work fine but with my copy of the tablet I don't know if it's an electrical issue or a software issue but when I'm doing certain things on my tablet my tablet seems to flash blue a lot and I don't know why and it's getting progressively worse so I feel like in a matter of time it's going to Brick on me so my advice to all of you guys is to keep an eye out for your tablet flashing blue and if it does make sure it doesn't get worse. Overall the tablet is nice and big easy for someone like me with visual impairment to use and it has a nice weight to it they just need to go back and fix any bugs that may be lurking within the software and the hardware and maybe make a version with more internal storage"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Bought for college student girlfriend she loves it"}
{"rating": 2.0, "product_id": "B018QAYM7C", "review": "I really wanted to love this tablet. I bought a Samsung phone and it has been great. The tablet is easy to operate, like my phone, but somebody at Samsung decided to put the speaker on the back. As a result if you hear sound at all it is muffled. Whoever designed this with the speaker in the back should be terminated. If it weren't for the placement of the speaker, I would have given it 4 stars. A real shame since the rest of the tablet has worked well."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Like it very much so far. A bit heavier than I expected."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Tab E works perfectly, just like the one I got from T-Mobile. Daughter loves it for her birthday present!"}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "I purchased one to replace a couple year old kindle. I have had it for about four months and I am very under impressed.  I will purchase a kindle when I replace it."}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "This was going to be my first tablet, and I was looking forward to the flexibility it would give me to step away from my computer and stop squinting at my phone.  I planned to use it just for general web browsing and email, sitting on my couch, on the porch, etc.  However, this device is so big and so heavy, I found it very uncomfortable to use the way I had hoped.  It's definitely not a one-handed device, and you will want to have it resting on a table top, knee, or lap (so get a good case for it).  The extra length for the wide aspect ratio is fine in landscape mode, but it makes it top heavy to hold in portrait mode, even with both hands.  I also found I didn't need the extra screen space.\n\nI was disappointed in the screen display quality, too.  I found the icons to be slightly fuzzy, and the color was not great.  I'm a hobbyist photographer, and I thought this device might be useful to occasionally share some photos with family and friends on a nice portable screen.  But the color quality just wasn't adequate for that, and resolution was disappointing.  Another minor flaw, but very annoying, there is no auto-brightness.  I found myself constantly adjusting the brightness setting.\n\nSo after trying this device for a few days, I gave up and ordered a Tab A 8\".  It's MUCH lighter (feels like half the weight of the Tab E 9.6\") and easy to hold, the screen color is right on, display quality is sharp, and there's even auto-brightness.  I found my match."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Theres nothing to not like about it. I love it. Everything was exactly what they said."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great Tab. Fair price, and very fast delivery even with free shipping. Thanks Amazon\nSpecification is good comparing to the price, my only point is why there is no white color of it!!\nIt is great choice to who wants good tab with fair price"}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "Runs a lot slower than I expected!! I still use my phone most of the time."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I love this case!"}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "I loved buying this product, but sometimes it gets slow with me Minions game and an application called laminas (Which is from the album of figurines of the World Cup Russia 2018). I had to uninstall the Blades application to be able to use the tablet. Otherwise, the tablet worked well for me."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great tablet for our 10-year old son."}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "Pros\n*Good battery life\n*Easy to use\n*Device maintenance setting allows easy clean up for storage\n*Affordable\n\nCons\n-slow processor\n-laggy keyboard\n-certain apps crash more often than others\n-takes 2-3 hours to fully charge\n\nOverall, decent tablet. If you read ebooks or only use a few apps then this is a good choice. Personally, it's too slow for me. Facebook crashed multiple times before actually working, the keyboard was slow to track my typing, and the processor isn't as fast as I would like. In general, not the device for me, ended up returning it."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Evything was perfect"}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "I bought it as a gift but it not anywhere close to my TabS 2 a bit slow on the response side so i still may have to get the Tab S2 or if there's a s3 as yet."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "excelente"}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "It just stopped working."}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "You get what you pay for"}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "Terrible product. I bought it new and came with a screen defect. The screen was glitchy and had a wide line in the middle. I bought the insurance with it but I was told I could not use the insurence for it and get it fixed. I also couldn't exchange it for another one. I was able to return it."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "I cannot this thing to work.  I want to send it back and get a refund or get one that works.  Please."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I LOVE this toy!  It's the same as an iPad as far as functionality goes, but it's MUCH faster and I don't get incessantly bugged to enter my Apple ID.  There's good access to apps of all varieties.  It's worth the switch."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Use this for my ELD (using Keep trucking) and it works as expected.  Love that I can increase memory by just buying a bigger microSD card... unlike Apple."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Very versatile and excellent performance.  We have two tablets now."}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "Takes to long power up and enter the password"}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "The charger port is already damage can't believe this was only bought in February ."}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "Was working great until the inside plug section bent and now I can't charge it"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "love it"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Beats its completion all to heck, easy setup, good quality. I returned a Nextbook that was really a disappointment"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "the best purchase I have made this year. It has enough GB to hold all my info and games. A little large to carry around but I do keep it in my purse because I don't have a smart phone."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I like the size."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "I hate this table!!!!!! I got to use this tablet no more than a few days. Now Im locked out and every time. I try to get in it will not stay open!! Ill never buy another  Samsung every!!!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I love it"}
{"rating": 2.0, "product_id": "B018QAYM7C", "review": "What am I missing?  This is my first tablet.  I just got it today.  This thing is practically unusable.  It stops and sticks so much it's not worth it.  I have blazing fast internet I pay extra for through Comcast but still this thing takes me back to pre-3G days.  I guess it's going back.  Maybe you can't get something very good for $175.  May it's defective.  I don't know what to think."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "To my surprise it was bigger then I thought. It works great, no problems starting it up. Bought it for my son, he loves it."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Nice big screen and does everything I need it to do"}
{"rating": 2.0, "product_id": "B018QAYM7C", "review": "The tablet does not switch on well, sometimes have to press the start button 5/10 times before starting, on maximum volume, it is very soft sound"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I really like it, it is amazing."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I purchased two, one for myself and one as a gift.  It is great, very handy if you don't want to use your phone or your laptop.\nThe person who received the gift really enjoyed it too.\nGreat price, as Best Buys and Target was more.\nThis was a Christmas gifr."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "recieved excellent product at an exceptional price. brand new, as described.  thanks."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "it's the second one i've had i love them both"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Really pleased. No problems at all.\nHighly recommend!"}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "This tablet is absolutely horrible - constantly shutting down - tabs crashing for no reason, extremely slow!  I bought this to replace my Tab 3 because that battery was going dead too fast.  No help from samsung... all over internet that samsung is geting hundreds of complaints about tabs constantly crashing from a range of their products including my tab3 now... but have no fixes and making excuses for their defective productsI will never purchase another samsung tablet!!!  Need to return this one, but there is no where on Amazon to return!  Awful!!"}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "Think twice about buying this unit ! It lags so much ! very slow that i can not even use it ! wasted my money on this !  No help from seller at all ! Spend little more money and get something little better . You will regret buying this !"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Product meets expectations."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "works perfect knock on wood no issues yet"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Nice looking bigger than I have anticipated. However, I have not started  using it yet. I will get started soon. Thanks"}
{"rating": 2.0, "product_id": "B018QAYM7C", "review": "Very, very slow.  I am unhappy with the purchase.  I should have gotten the Fire..."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "This is a great tablet! Setup was super easy, I had it going in short order. I've been using it a lot with no issues. Battery life is great, lasts a few hours with constant use. I don't know how long the battery would last in standby mode because I haven't left it unused for more than a few hours.\n\nThe screen is nice and bright for reading. I've watched a number of videos, they look fine both visually, and audio. I don't know the frame rate and the other technical specs off the top of my head, but I am well pleased with the display and the audio performance.\n\nI have run some apps from the App Store and it runs fine for those. I'm not a big app person, I primarily use it for email, web browsing, and to stream video and music and I've been very happy with it, and have had no issues. I've paired it with a small Bluetooth speaker and it worked fine with no issues also.\n\nThe Samsung Galaxy Tab E 16 GB WiFi works fine for me, it does everything I want it to do. I'm happy with my purchase and would buy it again."}
{"rating": 2.0, "product_id": "B018QAYM7C", "review": "Clumsy and slow. Does not come close to iPad or Lenovo"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "It is not as heavy as the wife's other tablet"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Was a gift"}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "heavy"}
{"rating": 2.0, "product_id": "B018QAYM7C", "review": "A lot slower than I expected. Display is clear and bright. Samsung brand software that you can't delete clogging up the works. I am not used to having to use the browser that the company requires. I am able to do what I need to but it isn't much fun. Serves the purpose."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "I've had this tablet for a couple of years now. It's slower than when new, like any tech without upgrades. Newer software will ask for more resources; that's tech. Still runs like a champ. Awesome battery life. Limited hacking, rooting, ROM'ing and dev support. Screen is above par, but definitely not full HD; it's OK for watching movies and certain things, especially reading."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Can't beat it for the price."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Will buy another"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great"}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "Although I did quite a bit of research, and didn't want to spend a small fortune...Well, I guess I should have spent a small fortune!  It's not the worst tablet on the market, but it takes a while for this product to \"wake up.\" It can also run very slowly. Seemingly without movement, the orientation will switch from portrait to landscape.  Bottom line, it's not awful, but I could have done much better."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "It is wonderful. Very good to use."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "It is very useful, but it is not as fast as I thought it would be. However it is much much faster than my 5 year old Apple I Pad."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "The Galaxy E9 stopped working shortly after I received it. It would never go beyond 28% of the charge and would become extremely hot. So, for what it is worth I would never buy an Samsung product again. Thank You"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "As expected."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Exelente"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "No disappointment here, great quality and easy to set up and use"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Very Nice tab. Good for all i need."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "First tablet ever and I love it"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Nice"}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "The product was never working. I attempted to turn it on. Nothing happened. What a waste"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Just what I expected."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Perfect give for the price!!!"}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "Worked perfectly for 18 months.... As I would later find out, typical problems with not charging and rapid battery power loss. Bought a new battery and exact same problems. Spent countless hours on the Internet trying everything to remedy it, no luck. Completely useless tablet with a new battery. Bought a 5th generation IPad the next day. No Samsung for me."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Good"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Perfect"}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "One of the tablet is missing the USB cord"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Love this tablet!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "GREAT "}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "This was a gift to our Mom and she loves it.  She has a Samsung phone so it was easy for her to figure out."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I really enjoy this tablet . I can do everything I want on this . There is nothing negative I can say about it . Pictures , games etc are nice and clear ."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Have had it for about 3 months and so far its doing well. Sometimes a bit slow."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "keep turn off while using so works not good."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Wow!. This was a great purchase, and price."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "Description states that tablet has 5 USB ports, this is not true! This tablet does not have ANY USB ports!"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Great use it all the time"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Amazing little tablet, much better than the Kindle Fire 10. Picked up mine refurbished, but is in amazing condition. Am able to stream wirelessly to my Samsung TV with no issues. Will purchase another in the near future."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "This was actually a gift, but it was given to a fairly technologically naive person. She was able to set it up and do everything. She was familiar with it having come from a background of Galaxy phones. I didn't have to go explain anything which was a nice relief."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "It came broke an I'm not a happy customer"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "This tablet has an absolutely amazing battery! The touch screen is not as responsive as it should be, though; I frequently have to tap twice to get action. Still, for the price, I'm quite satisfied."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Worth every penny !"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "my grandson was thrilled--he loves it."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "Just recieved my tablet. I am pretty happy with it. does eveything i want. Although it feels like there is not enough RAM to support the OS!!!!!!!\n\nStart up, and after.\nI went through the 20mins of setup, downloaded my streaming apps, made sure everything was up-to-date, and the tablet still feels slow and sluggish.\nswiping from page to page takes a second to register, same with starting any apps. Once its going, its ok. but still slugish.\n\nfor how much i paid for, i was expecting something that at least prefomed reasonably....... not...like...this...every...time....i.....want.....to.....do.....something......i.....get.....pauses....."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I got it for my 6 year old to play with.  He loves it, maybe a little too much lol"}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "When your first tablet is the original Nexus 7 you have high expectations. This fell short in almost every way except it had a larger screen. It's incredibly slow, it had a delayed response to touch, and the image quality was subpar. After the first month or so of owning this, I realized it's pretty much only good for reading my e-books. It finally failed me and could not read or detect any micro SD card. There are much better tablets out there for far better prices. I would pass on this and save yourself the disappointment."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Works great."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Received very awesome quality product. Very pleased with purchase. I ordered it though National-Electronics. They sent the tablet in great new condition I highly recommend them also. Thanks Amazon prime! PS and the Samsung tab E 9.6 updates to nougat 7.1.1 yay!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "great tablet"}
{"rating": 2.0, "product_id": "B018QAYM7C", "review": "Compared to my other Samsung devices this tablet lags quite a bit and has lower kinda grainy graphics. I wish I would have choose a different model."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Very nice, big screen and works well"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Very pleased with this purchase. Its big enjoy to enjoy lite gaming and very budget friendly. I wish the screen was a lil bit better but it'll do the job for sure!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I use these in my automotive business.  They work great!"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": ";better than the last one"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "This is an awesome tablet way cheaper than an Apple iPad if you are just browsing the web or using for streaming videos Games Etc this is a great product."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "I love Samsung anything. The picture quality is great, and it's an excellent value. However, the highest volume setting is barely audible for me. For that reason ONLY, I am returning the tablet."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "It locked within minute.  Customer service was pathetic.\n."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I like it but have not made the best use of it yet. Could use some coaching and perhaps a good cover."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "I always prefer Samsung Tab. The only one that is my minus rating for Samsung Tab opposed to Apple Mini IPad is the transfer of pictures directly from d memory card to the tablet. It makes the process a bit complicated. Other than that, loves it . I don't have to pay extra monthly fee to increase the memory capacity."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Like it so far.... pixel lines are bothersome to me but wife doesn't mind.... other than that, a 5 star tablet"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Slim tablet. Great for the price!"}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "I bought this device as a gift to my father who lives in Israel. I sent it directly from Amazon US to his Israeli address. Device was working for few weeks and then died. I had to call to customer service for Samsung US  (which is offshore service center, I have enormous difficulties to understand what they are saying due their poor English and call quality), because Samsung Israel doesn't care about devices that bought in US.\nSo my father sent it back to me, I sent it to RMA repair, they fixed it and I sent it back to my father.\nBut before I wanted to check that device is alive and finished setup process by login with my Google credentials. When my father got a device he was never able to unlock it even after I told him my Google credentials. Stupid unauthorized access protection kicked in (probably because device was on overseas WiFi). And again Samsung customer  support in Israel doesn't care, Customer support in US barely speak English. No help at all. They don't provide overseas Warranty repairs. The only option is to sent device back to US again for RMA repair/unlock. Totally disappointed in Samsung."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "The lower left side has no lighting"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Like this very much and the price was very reasonable"}
{"rating": 2.0, "product_id": "B018QAYM7C", "review": "Touch sceeen is not good to slow. I had another tablet ASUS ZenPad 3S 10 and if I will need third one I will never buy Samsung I will buy Asus"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Bought from: \"Sold by: Amazon.com Services, Inc.\" at the end of January 2018 as a new tablet. The Samsung factory seal on the box was missing and replaced with a generic clear seal. The tablet itself was covered with fingerprints and smears. The protect plastic sheet over the touchscreen was missing. The tablet seems fine and went through the normal factory reset startup scripts. The adapter and cord were still in sealed bags. Had I paid full price, I would have sent it back on principle, since it was obviously opened and fiddled with.\n\nVery good price, the price fluctuates a bit up and down.\n\nIt updated to Android version 7.1.1. Security patch is October 1, 2017."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Really nice solid tablet, don't have to charge but every other day, very pleased with purchase"}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "the tablet just quit working"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "And it works. Everyday, all day and never a hitch or issue. I use a cover and the approved charger and I expect it to last for quite a while."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "The shipping box was in perfect condition but the package the table was in looked like it had been opened. i did not open it. It has stickers that said inspected. I am not happy that I had to pay return shipping. See the photos."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Everything is great with the exception of the back and recent buttons.  They are a nuisance, install Android key remaper to disable them.  Much better now."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "This is a good solid tablet, which is easy to use, and synced seemlessly with my Android phone. The camera is average, but better than my Kindle Fire. I don't use a tablet to snap pics anyway.\nThe screen is quite good for a tablet, not as good as my Android Note 8, but that's a pretty top of the line phone.  The keyboard for typing messages is fabulous as I use Messenger often.\nThe only issue I have is that the sound quality is a bit poor, but is good enough.\n I like the tablet very much.\n4/6/2018: Adding to my original review.  This tablet holds a charge extremely well, and this with the WiFi left on.  In fact,  I have never had a tablet or phone hold a charge as long as this one."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I am very happy and the tablet are original and at a good price recommend it."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I love this tablet, just the right size to carry around and to see."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Works great."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Works as expected."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Fast delivery, and I think it's perfectly sized. Works great for my many needs!"}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "Liked the size. Need to push the app icons several times in many cases to open them. Probably would spend the extra money and get an Ipad next time"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I love this tablet!!!"}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "Worst tab no hotspot no fingers print fack"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "My tablet did  everything I had expected and more.  I really like it.  I had trouble at first with the touch screen until I figured out  I was dragging my little finger on the screen. Not a problem with the unit."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Multimedia lindas"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Excellent product. Reliable seller."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Now this might seem sad, but this tablet has a better display than my computer. It's great for watching shows. I also use it to read ebooks and news. I'd definitely recommend it if you're looking for a small, rectangular tablet that isn't too expensive."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "ere were no instructions provided, once you get it out of the package you can not reassemble it , terrible product."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Perfect!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Performs flawlessly and it's samsung so what more can you ask for!!!"}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "I got this tablet as a back up for our I PAD to use for taking pictures and  manage few things for a our studio.\nWhat a disappointing purchase !!!\nHave not seen fuzzy and discolored camera pictures in many years ....\nHave Samsung 7 and been very happy with it and expect so much more from a tablet ...\nGranted this is not the best model but still take a pictures and search web, it should be more then capable.\nHad to get one more Apple love it!!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I used this to replace an old Samsung Galaxy Tab 2 10\" tablet that had ceased to work.  Even though it's not quite as wide as the 10\", the picture resolution is great.  It's similar enough to my old Tab 2, that I was able to start it up and get it working right away."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "A nice big screen and pretty good battery time. Weighty, but well worth it. Terrifying I might drop it, recommend some kind of protector for it."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "I got it for my mom for Christmas, she likes it"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "It does everything thing I need, at a great price. The only thing that I don't like, is that it doesn't support Adobe reader."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I love it. I have had two previous tablets which have had snap on keyboards which are hard to beat, but their price has risen to unaffordable for me. They were not Samsung either. I bought this Samsung for a third of the price that I would have had to pay for a keyboard tablet. I bought it primarily for a reader but I have my email,  Facebook and many other apps as well."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Another quality tablet by Samsung, would definitely recommend."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "My hubby watches a lot of Hulu and he loves his tablet for this!!! Great price at Black Friday time!"}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "The truth is I don't like it, not what I was expecting."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "My husband loves it for playing games. I like that it has MS Office."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Fits my tablet perfectly; I  would  recommend this  for  anyone who anyone who buys a tablet this size."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I liked the size and so easy to use."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "it's  very, very, slow. the touch screen has issues and it freezes up a lot will def save up and get a better tab as this tablet is soooo frustrating because of the very slow processor. even the amazon fire had a faster processor!!!!!!!!!!!! I mean come on a single 1.2 hz processor, even my phone is faster! note it just died on me after a year and a half. not a good product, expected more from samsung"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Very happy with my purchase more than a year later. Its responsive and games work really well on it. It easily holds a 6-8 hr charge depending on how you use it."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Bought for a friend.  They seem to like it."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "TRUST ME DO NOT BUY THIS PRODUCT. SENT ME A DEFECTIVE PRODUCT WHICH DID NOT CHARGE AT ALL. BECAUSE I HAD CROSSED THE 1 MONTH PERIOD OF RETURN POLICY UNABLE TO RETURN. SENT TO SAMSUNG SERVICE TO REPAIRED, THEY REPAIRED THE PRODUCT AND SENT A DAMAGED PRODUCT. PATHETIC SAMSUNG SERVICE, PATHETIC PRODUCT SELLING BY AMAZON."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Took long to get to me but product is fine."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "My grandson loves it!"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Got this Samsung Galaxy Tab E 9.6\"; 16 GB Wifi Tablet as a gift for my wife. She uses it for web browsing and watching streaming movies. She loves the way the tablet works. Her only complaint it that speakers are not loud enough."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I am pleased with my tablet and the price was great."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Easy to use, affordable.  Quick set up and quick speed.  Not too big but not too small"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "It was great!"}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "My Samsung tablet did not have the built in Wi-Fi although that's what I thought I was purchasing. I didn't want to go through the hassle of sending it back. I like my tablet. I just hate it doesn't have wifi "}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "It is so easy to use and just the right size screen for me."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "This was the perfect product for my father to upgrade to from his old dell tablet"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Great tablet. It is a little slow but very nice for my son."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "One of the touchiest most confusing interfaces I've ever used.  My smart phone that is a 1/3 of the size is much easier to use.  Nearly every minute of browsing and surfing I touch an icon and it doesn't register.  If you touch it too soft it doesn't pick up and if you touch it too hard it think you are trying to move an icon, I think.  Sometimes You hover your finger close, but without touching, and your touch registers.  Your touch has to be perfect within a tenths of a second it seems.  You think I would have gotten used to it after 2 months of use but nope... I'm still hitting app icons multiple times until it registers.\nThere is literally no way to hold this thing without accidentally activating one of the bottom \"back\" or \"home\" buttons or with hitting one of the side \"screen on/off\" volume buttons.  I don't know how many times I've laid it in my lap and suddenly it starts backing out of apps or closing browsers because my shirt is brushing a button.  I had these same issues with Samsung phones and have never bought one again, but I tried a Samsung tablet because of the rave reviews.  I prefer the double tap screen to turn the screen on and off and no side buttons of other brands.\nThe internet is so slow it is worse than my 4 year old phone which is a shock.\nThis was my first tablet because I am a PC/laptop kind of guy, but I'm finding at least this one to be very frustrating to use for anything but a handful of games.  It might be nice to have to pass the time on my next flight but might remain an novelty until then."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Love the tablet"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "My little girl loves it."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Easy set up; easy to navigate and good speed."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Bought this for my girlfriend, as she only used her smart phone for ALL internet use. It linked right to her phone acct, her texts' come right to the tablet, she can play all her games(words with friends, boggle, etc) right from the app on this tablet. A terrific tablet!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Purchase 2...were gifts.... Loved by both....."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "My children loves it. They are 10 and 8. They haven't put them down since they got them. I love the big screen and how clear the picture is."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "ok"}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "Be aware this is an ENTRY LEVEL TABLET. It's a bit slow sometimes which can be aggravating. I found it was not compatible with a game app I wanted to play on it which is disappointing. But you get what you pay for and mobile tech is not cheap. It's solid for the price! I tried out 3 other tablets before getting this one and this one far outperforms them for the price."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "I entered a screen lock pattern, and I have not been able to get past it since. All I get is 'try again in 29 seconds.'"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Great product. Works just as described. I like the nice big screen. Perfect for reading and watching movies. Only downside is that it is a bit heavy to hold after a while. But it works great."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "This was my first time buying any electronic device on Amazon and it was a major fail. I got this tablet during the cyber deals and thought it was a great deal. Turns out it wasn't. The screen hurts my eyes because the words are fuzzy. Even the app shortcuts are blurred. It's really bothersome to look at for more than a few minutes. The definition is so poor on it you can see like grid lines across the screen. I'm really disappointed with this purchase. I bought the tab a 8 inch at Walmart and it is way better. Very clear picture quality and lightweight. The 9.6 is really thick and heavy. It is so much heavier than the 8 and it doesn't seem like it should have THAT much difference. If I'm trying to navigate with my right hand I have to hold it a certain way with my left hand to balance it because of its weight and it hurts my wrist. It's just all around a bad purchase. I think they sent an old model and that's probably why it was so cheap during the cyber deals.  Ohh and the camera is H O R R I B L E !! Takes really bad and dull, lifeless pictures. Idk where the color goes but it's not in the picture for sure!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I bought this for my husband for Christmas and he loves it!! Perfect size and works fantastic!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Had to replace my old one. It took me a month to find the perfect one...nailed it!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I now own 2 Samsung galaxy tab E's.  The first was purchased for my daughter last year,  the second i purchased for my wife to replace an aging Ipad(5 years old).\n\nFor the price point I can not recommend this tablet enough. It is light, thin, and very responsive.  Adding additional storage via SD card will be necessary, also this model does not come with an S pen.  Battery life is great, gaming, youtubing and surfing can all be done in one day with plenty of battery % to spare. Quick charging is not available,  hopefully samsung will add this feature on newer generations.\n\n For an economy level tablet Samsung really hit the mark."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "My son,love it,makes me happy."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "Lags terribly for online gaming,  war robots in particular.  My done 2 year Amazon fire is far better.  Very surprised it has a lag issue.  I have Samsung cell phones,  and they are far superior."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Works fine now."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Works great and timely delivery"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I count myself lucky to purchase the Samsung Galaxy Tab E 9.6. It was one of the best electronics I bought last year (2017). The screen is bright and clean. It is fast and easy to navigate."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I just wanted it to play games on...Was easy to program & I am not that savvy doing stuff like that.. It charges fast also..."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Gift for my husband and he loves it. It's heavier than I expected, but for the size it's fine. Screen is clear and the unit is easy to use."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "It was what I wanted"}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "Painfully slow. I got it to read e-books, but there is no e-book app that works properly. There is much glare on the screen which makes it hard on the eyes. . Camera takes  very poor photos. Not adequate as a tablet, and disappointing as a reader. WIFI does not maintain a connection in an area in my house where other tablets, my cell phone and Lap top work perfectly.\nI do not recommend buying this."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "it hangs a lot. very low sound."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Very pleased with this purchase"}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "I reviewed and this tablet included SIM, but when I received it this not happened. My tablet don't include SIM"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "I will update this later but at the momebt everything is updating.  Its clear the previous owner booted it up then decided they wanted something else. All of the original packaging except for the samsung screen's dust protector were present.  Save for the state of the product box,  it was practically new in package. Very responsive, gorgeous display, etc.\n\nExpect an update this weekend..."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "My son loves this tablet. He uses it for you tube and watching movies. Nice size. And storage space"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Xmas present for my wife, she is just using it for internet access.  No issues nice product."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "The Galaxy Tab 9.6\" tablet is great so far. It has good speed, great size, and is aesthetically pleasing. It was also a great price in comparison to other tablets of similar size and function."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Works great,  high speed and no issues"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I so enjoy my Samsung Galaxy tablet.  I use it daily.  Much better than I expected"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "This tablet has a 7200 mAh battery (not 5000 as shown in places including gsmarena) which, when combined with modest specs (lower res screen and slower processor) and the nougat update (7.1.1) makes for one of the longest lasting tablets I have ever owned. I am willing to give up processing power and resolution if it means I can watch four movies on a plane and arrive at my destination with 50% battery left. Those modest specs means this is not a great gaming tablet or something you want to use to stream to your smart TV. What it is ideal for is something small enough to easy pack with a big enough screen to get some work done (I use google apps) and watch some shows to relax. Pros for me: Long battery life, nice size screen, not too bulky, good OS and skin from Samsung. Cons for me: poor speaker. some stuttering in performance under high demand (just close background apps)."}
{"rating": 2.0, "product_id": "B018QAYM7C", "review": "I got this tablet for Xmas 2017. I loved it at first. Pros are works like a cell phone. Cons are too heavy/Touch screen is a piece of work/takes 2 days to charge/the volume is very low/the color resolution is dead dull my cell phone has better color res/slow page Turner even with very high speed internet. I do not recommend buying this. Go out and buy a iPad instead."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Very nice but heavy"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "nice unit easy to use sleek and just the right size."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "I still am using a 7\" Galaxy tab that I bought refurbished  three years ago with nary a glitch. We had one of the 12 inch tabs that sadly, did not make it past the 5 year mark due to a battery connection issue , but it was well used hours each day as well. So when I had to replace that tablet, I went with this one for it's nice screen and because I trust the brand. I have two Samsung J7 phones too that are on their two year mark with no issues. This Tablet was easy to set up, well thought out, and the wireless connection is fast and superb. Sound is good too. We use ours mostly for web browsing, but I've saved and transmitted docs via bluetooth as well . The only reason this tablet does not get five stars from me is the amount of proprietary and Google crap they install that's next to impossible to get rid of, and every update they make you have to go thru and clean up all of it again so you aren't getting hundreds of notifications and reminders every day from stuff you don't and never will use."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I love my new tablet its fast and better then all my other tablets I've tried...I'm a huge Samsung fan"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Most awesome tablet I have seen! My son loves it, I love it, great big screen, just wonderful.  A bit of the graphics get blurry but it is for speed not looks."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "Can't access app store"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "just what we wanted thanks"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "I like it.  It didn't cost a fortune and it performs pretty well.  Not lightning fast but good enough to watch movies and play a few games. It feels sturdy, not like it's  made out of cheap plastic.  The little speaker in back is definitely inadequate, so I'd suggest buying some decent ear buds at the same time."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Excellent, the seller's service as well as the shipping by FeDex, Thank you very much"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great product."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "This was a gift for my Dad.  He loves it and the screen is big enough that he can read it easily."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "excelente producto."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Works great to this day. I use it daily to talk to someone across the world."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Love my Samsung galaxy and really love that the screen it is 9\". Perfect to watch my shows on when my boyfriend takes over the tv."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "Bought this for my son for Christmas. We opened ot up, plugged it in, and NOTHING. It would not charge or come on. Likely a bad battery. Returning for a refund."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "works great"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "So far so good my son loved this as a Christmas gift he is 7 and he doesn't want to put it down . I happy to say I can link it to my phone and watch what he does so the family link app from Google was a plus ."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "This tablet is huge compared to our 7 inch. It's like looking at a small TV screen. We have only used it for a few days but so far so problems. My husband loves his new tablet."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Enjoying it right now, easy to set up, quality is great"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Has many new features. Faster than old tablet."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I have a Samsung phone, so I already know the tablet, love the size.  I had a 7\" and this is perfect"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Bought this for my daughter and she loves it. Easy to use and navigate with great picture quality to watch YouTube, watching movies, and gaming"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Works well..."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "This tablet has been a great addition to my tech family, especially for 150 bucks! Runs great."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "Worst tablet ever if I could get one for free I wouldn't!\n\nThe Samsung Tab e is literally useless! If you want your tablet to do anything at all this is not the one for you.\nI never write reviews but this thing is such a POS I had to come in here to stop other people for making the same mistake I did.\nI love Samsung and I have a ton of Samsung products but this thing is useless! I can't get it to play music, I can't get it to surf the Internet, I can't get the Bluetooth to work, I can't get it to accept payments, I can't get any apps to close or open without the thing crashing! It's literally good for nothing; do yourself a favor and buy any other tablet!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great product, just as described. Works perfectly, packed well, not damaged at all."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Works great. Had to buy a new one because my son liked it better the the tablet he had and kept it."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Good tablet,replaced older tab4 8 Inch, OS upgraded to Android 7.0 via Samsung"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "awesome (and I have had it for a long time now)"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "It was hard to get to know how to use the tablet but now that I have it is very good.  It is fast and easy to use."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "It is great.  Used mostly as a reader and for email.  This is my second, bought as a gift because I like the first one so much.  If you keep the background apps cleared, there is no problem for the battery to last the 13 hours advertised.  Very intuitive."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Love this tablet gives you a lot for the price."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Bought this, as the first Galaxy Tab I bought finally died, after 6 years.  This has a nice, large screen, very responsive.  I'm sure it will keep the boys entertained for the next few years."}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "I like it for following Facebook, but I actually bought it to skype with my grandkids in Portland, and the picture is super grainy and awful.  Wish I'd spent more on a better tablet."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "Somethings wrong with the screen. Very disappointed with I use for work VIP outlet won't send another. I will never ORDER from them again. But I love the tablet as I love all Samsung merchandise."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Two and a half months on, this tablet has been wonderful for our child who needed it for school.  Other family members have used it for various tasks, and have found it more than adequate.  We don't play intensive video games, but YT videos and the like are viewed just fine on this tablet.\n\nThe front camera worked well using a teleconference app when our student was across the country recently on a trip and had no other way to contact us.\n\nExpandable memory via SD card is a must/plus."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "great"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "won,t power on.  Exactly 60 days since ordered"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Super Fast shipping! Impressed!!! My daughter LOVES it!! <3"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "great!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Love it!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great tablet"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Awesome tablet. Love the bigger screen and doors everything a computer does. Love it."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "I don't see how this item gets so many positive reviews. I know it's a budget tablet but it's unusable. The screen resolution is grainy, ghosts and locks up while watching a video and Youtube randomly closes. I bought this to replace a 3 year old ipad mini but the mini is still faster at loading pages and apps. It took this thing 10% battery life and 15 minutes to download one app and it crashed or locked up every time I opened it. I can't send this back fast enough....stay away."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "it seems to be a problem with the tablet.. images shake, moves, some times takes minutes to work .got frozen ..im returning it"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Excellent gadget"}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "I bought this May 2nd 2017 and already it's dead!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great product. I liked it so much that today, three days later I went to buy a new one but found it's now $50.00 higher. I purchase most everything at Amazon but I'll need to look around on this one. As a member since 2009 I'd like to think that counts for something. Any, again, it's a great product."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Speakers in the back are an issue.  Sensitive to touch when holding it to watch at movie or longer clip."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Samsung always delivers on quality products. Really impressed with how crisp images are when internet browsing. Youtube and Netflix watching can be somewhat pixelates but the bigger screen makes up for that. Very happy with purchase"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I really love this tablet.  It's screen is big enough.  You can work in a double screen very easily.  There are some many things about the tablet I love that it would take me too long to put on this review.  I would recommend  this screen for some one who is looking for a good tablet without sending hundreds of dollars..  I bought this tablet to use in place of my Mini IPad.  I'm glad that I bought this one instead of replacing with another larger IPad."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "These tablets are garbage.  They are slow, have little memory, and if you try using another cord or charger on them, they charge slower than a turtle going up a mountain.  My charger stopped working after a year.  I got a replacement which lasted a couple of months.  Invest in a product that has a great company behind it.  This will be the last Samsung I will ever buy."}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "NO, NO, NOT 16GB RAM! Please fix that on your description. My partner fell for that and boom- immediately ordered this one for me, as she knew that was an amazing spec, if only it were true.\n\nBut it is a misprint. THE TAB E HAS 1.5GB RAM. NOT 16GB, as stated in the comparison specs.\n\nIt's okay. But pretty much anything it can do, the (even slightly larger, higher resolution, superior camera/camcorder, octa core instead of quad core and 2GB RAM instead of 1.5GB) Tab A 10.1 can do better. -And here's the kicker- for less money. Look it up.. the Samsung Galaxy Tab A 10.1, and compare. You'll probably get the Tab A, not the Tab E."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "the price shot down at the right time. I had wanted to buy this for several months and now I got it. wifi only isn't too bad at all not really, I tried to facetime on discord because it's 100% secure unlike skype and other facetime apps. out there but the webcam would load for a few seconds then cut out to a loading icon and just wouldn't load at all but other then that issue, it runs games great, it takes good pictures the sound isn't the loudest but in a quiet room close up it's decent it plays digitally imported music channels perfectly and apps download and install super quick on It. Also one more thing the shipping came a whole day early I was excited about that too"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Very nice, perfect size.  Works well so far.."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "Absolutely the worst tablet I have ever bought.\n\nIt is heavy, the camera is out of focus most of the time so photographs are very poor, the back button doesn't work unless you smash it really hard so you get stuck in apps and cannot get out without force stopping them. I also have to keep hitting the icons of apps to get the actual app to open. The speaker is also awful, so it is difficult to hear videos and impossible to hear sound after recording a video. Oh and it randomly crashes as an app is in use.\n\nIf you want to use it to type anything, including hashtags on an Instagram photo, forget it. The keyboard is so poor you spend more time deleting the mistakes it has made than actually typing the message.\n\nThis is now the third Samsung tablet I have owned, and I was very happy with the other two. This one is junk. If you want a tablet that functions well with few problems, takes decent photos and video and does not crash all the time, and has a clear and loud speaker avoid this one. Poorly made, heavy and works badly."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Oh boy...it's different than an Apple.  I'm a Mac Pro laptop owner and I bought this for smaller device.  I like it better and better with each use.  But I had to get used to it.  I'm getting ready to read a book on it and I'm sure it'll be better on this than my phone!!  Takes up less space in tote bag on trips. Takes beautiful pictures...glorious colors!!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "For my wife.  Easy  to operate and similar to the Samsung phone in menu's and appearance."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I like watching movies and playing games"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "How did I get by without one for so long!  Does everything I need it to."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I bought this a long time ago probably 2 years now almost and my mother uses it all day and all night it is definitely a great tablet it burns a lot of battery but she keeps it plugged in most the time. A very good buy."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Very pleased with my 1st tablet. ;)  A little  slow, but I still am pleased"}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "okay tablet. Too heavy"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "perfect"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Really like my tablet. Its everything that I wanted"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "It is a little heavy, over a pound, Good picture. I like it! Single speaker could be better, I think 2 speakers would be great. Still I am happy."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "work well just as you would expect from a samsung"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "I've had this for a couple of months. So far so good. The sound, vivid colors & the overall picture is incredible! Instead of having a tv in my bedroom, I use this. It's just as equal in all asspects as a tv does. On the downside it is \"clunky\" as far as the thickness & weight. Aside from this, it's an excellent tablet."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "I bought this tablet not even a week ago and it quit working on me. I will never buy a samsung product again."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "This one was for her, she totally loves it, we'll done!!!"}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "This is the worst tablet that I have ever unfortunately had the distaste of owning much less use.  Or should I just say is tossed in a drawer of my desk.\n\nI'll start this review by saying I received it for free because I've been a Verizon Wireless customer for almost 16 years.  It was given to me free as a bonus gift of Customer appreciation.\n\n I've had it about 10 months and everything about it irks me\n\n The buttons on the bottom though I know their Samsung trademark are terrible would be the particular reason why we never bought a Samsung phone or tablet before this I just don't like the way that set up on the very edge of the device .\n\n you're so sensitive you end up just glancing your finger past them constantly when you're using it . :-( bad design choice.  with my Google pixel or any other android device outside of Samsung inside of the screen it's a lot more sense.\n\n the Wi-Fi connectivity is terrible when you're watching a movie or a video with the scramble flicker on and off at least every minute . This leads me to want to throw it against the wall often.\n\n My cell phone got stolen and I had to predominately use the tablet for work and whatnot and it was just so frustrating .\n\n When I first got it it was running a marshmallow 6.0.\n I thought I would update it to you get bad bad bad bad idea now it's so slow I can't even use it.\n\n I don't think in any way it's worth the money or even a 1% consideration so if you're looking for a tablet definitely look at an actual android or maybe an Apple this one don't even glance at it unless you make it for free and then added up selling it before you open the box\n\n ultimately I'm just gonna give it to my son to play video games on because he does really care . Terrible terrible tablet"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Very nice tablet."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Great tablet for the price!\nPros: Great battery life, great price\nCons: Screen resolution is not very high, typical samusung bloatwear"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Bought for my 80 year mother in law. She loves it. Easy to use and works great"}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "Capabilities and performance of the tablet are excellent. The overbearing irritation of the ads is a major problem and prevents a higher rating."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great tablet no issues at all. I had originally gone for a computer and when that didn't work out i went for this since my dad had a similar one that he uses for work. My mother even uses it to watch amazon prime on when I am not at home to use it. Would definitely recommend it to someone."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I waited a long time to make this purchase.  This is a great tablet that suits all of my needs for one.  I can recommend buying it.  The delivery was next day and right to my door stop by an amazon.com delivery person--who photographed this in place after delivering it; a great idea.  Of course, he could have picked it right back and made off with it, but he didn't."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I'm really enjoying this tablet. I'm using it right now to write this review. It's a convenient size, the screen resolution is good quality and processor speed is acceptable for the price. I find myself using it quite often and never having a problem. I'm very happy with this purchase."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great tablet. I highly recommended A+++++++"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "works Well"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "ok"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "... then no one is happy.  Our Samsung Galaxy Tab E keeps Baby (Baby being my 3 year old) happy.  It's perfect for keeping her occupied on the go."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great tablet. Easy to use. Love Samsung products"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Very nice tablet. Good visibility on the screen, great size."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Just what I was looking for at a great price!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Very good satisfied"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "So far it seems okay. I'm new at this, and got a long way to go to learn the tablet, and what it can do."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "The plastic that covered and held in place one of the magnets, broke off."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Loving my tablet very pleased with it........."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "It's a good tablet but I knocked off one star because the sound is a bit too low."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Works great. A lot faster than my previous tablet."}
{"rating": 2.0, "product_id": "B018QAYM7C", "review": "This is an 'okay' tablet. However, I hate having GOOGLE shoved down my throat - which is what happens on this (and any Android device).  Microsoft has to allow Google and Apple programs on Windows, BUT, an Android device literally shoves only Google stuff down your throat.  The first thing you must do (upon starting up this device) is to create a Google account.  I'm sorry, but I am not interested in sharing all my computing, likes and dislikes, internet usage, phone usage, and everything else I do, with Google.\nBecause of the intensive presence of Google with everything you/I do on this tablet, I will only be using it as a small monitor."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I bought it for my brother and he loves it. He has no problem accessing the internet as he lives in a rural area."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "A great tablet for the price, it has a ton of features that I hadnt known."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Excellent tablet for internet use, not much storage space."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "awesome all around!!! got this for my middle-schooler and he loves it.  way better than the ipad he had in elementary and 100% better than the Chromebook his school issued him this year.  next one I purchase will be for me!"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Really like this tablet. Works well, reasonably quick, nice reasponsive screen. Wish the back and tab buttons lit up or were raised, hard to find them inthe dark. Otherwise a nice tablet for my day to day entertainment use."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Perfect tablet for reading books, using the web, writing, or even android games. No cons. Charges pretty fast and I can real a whole book before it dies."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Fast delivery great product"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "This is a basic, but good, all around tablet. It's features and specs are on their website. But from a 'usability' point of view:\n\n1st and foremost, this is a low resolution display. If you look closely, icons, text, etc are a tiny bit fuzzy. To me, that's okay for most all of what I do with a tablet. And, I believe it probably helps with battery life.\n\n2nd, you have to decide on which aspect ratio you want. This is a 16x9, another popular choice is 4x3 (like IPads). I tried some of the 4x3 and just find them 'un-wieldy' (you almost need some kind of stand for them, they don't really fit in your lap securely). The Tab E 9.6 screen size, and in 16x9 ratio, is ideal imho.\n\n3rd, and again it's personal choice / needs, as this is at the low end of processing power, so it's not considered a 'gaming device'. But if you only run a few apps, a browser, solitaire, things of that nature, and with the slightly less crisp resolution, this tablet should be close to top of your list.\n\nI'm replacing a google Nexus 7 with this tablet. I'm very happy with it. And at the current Amazon sale price, if it fits your needs, it's a great buy."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Love the size! It's a bit heavy."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Love it"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I bought it for my girlfriend and she loves it!!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great tablet so far!  We purchased for traveling and will use in conjunction with our hotspot for navigation and research.  Battery life seems amazing!"}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "Screen / pictures not as vivid as my previous Samsung (10)."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Received much earlier than expected. This is just .what I needed for use with my App to accept credit cards from customers, using Propay"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Strange to open with this, but I bought this so I could browse /watch YouTube, etc, and my girlfriend could do the same on the laptop. When this was in transit, I considered canceling once it arrived because between the two of us, two smartphones a laptop and then now a tablet seemed excessive. I bought this without informing her upfront but I was surprised with how glad she was I did. We actually both agree it was a good investment. After a long day of work, we both like to decompress and part ways for a while on most nights (her in the bedroom, me in the living room) and we now each have devices to stream versus waiting to revive our nearly dead phones. I'm not here to really get into specs, but rather my input on using a tablet for a few months now compared to the laptop we shared:\nPros: it's like a giant version of an interface I've used since 2012...galaxy series. Nothing to \"learn\"\nThe battery is a beast. I'm not screwed the next day if I forget to plug it in before bed.\nIt's more portable /less clunky to take into another room (say to do dishes and watch a video)\nThe screen seems very large for a tablet at this price point.\nSome see this as a con, but it's surprisingly heavy. It feels like a solid, legitimate piece of tech.\nCons:\nNo case (I've tried two) are going to be perfect. The ability to adjust viewing angle basically depends on how long you're willing to hold the tablet at that position. I still go for the laptop laying in bed.\nThe bottom buttons can been easily hit when holding the tablet and even though you can rotate in all 4 directions, I still find myself bumping those buttons often unintentionally no matter where they are.\nThe keyboard is pressure sensitive, versus heat sensitive, which doesn't seem like a big deal, except I've many a time found myself bumping my headphone cord changing a screen and the heel of my thumb hitting the enter button in vertical mode which leads to my next point...\nTyping. Horizontal or vertical, typing is inconvenient. A cell phone or laptop keyboard is literally 10 times faster and more tactile. I'd love to meet someone that legitimately types out full documents on any tablet.\nLastly, the back side. The speak is poorly placed, more quiet than any device I own and is easily covered by cases, hands etc. The camera is okay (it has a front facing as well) but have never really understood nor seen the use of rear facing cameras on tablets."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "My 7 year old loves his tablet, he calls it his iPad. It's used mostly for watching YouTube videos and playing games."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "My husband loved it"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Would have given 5 stars if the camera had a flash."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Gift for my wife.  She's happy, I'm happy."}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "I couldn't use even one Amazon Prime App on this tablet so unfortunately I had to send it back . Gotta have my Amazon Prime !!"}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "Pro: Beautiful screen, very clear and crisp. Nice size for reading book or watching movies. Charge lasts at least 6 hours or up to 10 depending on how it's used. Keyboard has numerals which means you don't need to switch to numerals, very handy. Keyboard has larger letters than some tablets. I like the software that came on it and I added Kindle app, my bank, and Google maps. All very nice.\nCons: the tab E has WiFi but you cannot connect to LTE or any roaming. Nice when you have WiFi available, but cannot be used to get directions on the fly. The most annoying thing is that the screen will jump to someplace else when you're trying to do something. Even worse is that it totally wiped out a document which I was working on and had saved. Don't have a clue what I touched but in a second it was completely gone. Very maddening. I like my kindle better. I don't know which other tablet I would buy to replace this one. I guess I won't actually ever create an important document on it."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Went from another tablet to this one.  Love it!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "It is great.  Should have gotten it sooner."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "This product is great, I use it every day and haven't had any issues with it this far."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "very happy with it."}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "I would give it 5 stars but Samsung now puts forced advertising on it. SHAME!!! SHAME!!! Samsung."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "wife very happy with it, works great"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "great device!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "This tablet is perfect for what I wanted it for. I bought this primarily for work and I use my hotspot for it. I couldn't see getting one through my carrier and having to pay a monthly fee for it when I could just buy it right out and use it with Hotspot.\nIt works great! It's fast, has expandable memory, and works just like my android powered Samsung Note but makes it much easier to do spreadsheets and PowerPoint because of the screen size.\nIt's exactly what I needed to increase productivity and also not drain my phones battery doing spreadsheets etc.\n\nI would HIGHLY recommend this tablet to anyone! It's great for just watching Netflix or playing games as well. A GREAT investment!"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "I purchased two of these as gifts.  Good product"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Really like it"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I ABSOLUTELY LOVE this tablet!  I bought it primarily to use when Im on the treadmill and this has NEVER ONCE disappointed me.  The screen is incredibly crisp, vibrant and SUPER easy on the eyes!  Everything just works and works perfectly!  I watch a lot of YouTube music videos while working out and the colors are in a word phenomenal...they literally jump off the screen.  Regardless of what Im watching on this tablet everything looks wonderful.  It pairs with all my bluetooth devices seamlessly and the ergonomics of the buttons, charging port and volume control are spot on.  I recently got an automatic update to Android Marshmallow and my battery lasts even longer.  I generally get 8-10 hours of battery life and thats with primarily watching TV, Videos or movies.  Many people feel that tablets are a dying breed but I still love mine and know it will serve me well for many years to come."}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "I got this tablet so my toddler can be entertained when we are on the road which is a lot. I need her movies and shows downloaded and the storage in this sucks horribly. Granted I knew some would be used up by the uncluded apps but even then I feel like it got full so quick. I love samsung and all my electronics are but this one feels like a miss. Battery life is decent but then again my daughter doesn't use it too much. If tou plan to buy this GET AN SD CARD!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "great tablet, according to my i pad 2 that kept making me problems, so far i love this peace."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Love this! I use it every day, reading on Kindle app, checking emails and Facebook. Playing games. No problems at all!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I love my tablet."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Tablet met my expectations!"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Great tablet but was also have problem charging at times (get message saying 'use original charger' though I am)."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Very happy with it"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "battery life could be better.........."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Good product."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Very good tablet, it is exactly what I expected."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Meets all my expectations."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Excelent tablet. Just what expect."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "Don't waster your money! The tablet has hardware problems as it is constantly shutting down. This tablet worked great for about 10 months and then it began freezing, restarting (sometimes caught in a loop), and now finally shutting down 2 months later.  It was tested with an oscilloscope showing a severe drop in voltage as it unexpectedly shut down, which may be faulty soldering. Hours were spent trying to identify if applications were causing the restarting and after several reset to factory settings, the problems still exist. The next step is checking to see if it is an issue with the battery or circuit board. In either case, this tablet is no longer functional until it is disassembled and repaired by a professional. Google search \"Samsung restarting\" to find many customers with the same problem!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Can't tell you how awesome it is to order from you unless you order yourselves. You don't have enough Stars up here for me to rate. Just want to say thank you sincerely Robert saucedo"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "i love the tablet, excellent quality and great price"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I like Samsung products I got all the phones I had from Samsung and I thought it was time for a tablet and the tab e 9.6 is really a good choice it has a wide screen perfect to watch movies and  it's easy to handle the only thing that bugs me a little bit is that it is quiet heavy but other then that it is amazing :)"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Just recently decided to use a tablet, first one ever since I've benever using a laptop since I can remember. Everything works great haven't experience any problems and I hope I don't. Great price for a tablet. Upon reading reviews I didn't see anyone mention that once you set up the table, I had to upgrade and install(the same) new software to my tablet 3 times before the notification went away. Otherwise it kept asking me to do it again or if I would like to postpone it. I don't know ifor it was just mine or not but it's no big issue. I was just worried it would continue to ask me this again and again. Other than that I love my new tablet I would definitely buy again."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "very nice"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Love the tablet"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "images are sharp and it is faster than my last tablet"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Love it.  Have enjoyed it since I got it. Phone is a Samsung also. So able to do alot of file swapping."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Easy to set up. I didn't need any help."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "Product Details in the compare with other product section claimed 16GB RAM. Item truly has 1.5 GB RAM. I'd rather buy a truthfully advertised product."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Works Great"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Arrived as scheduled. Perfect for my grandson. Fairly quick and screen and resolution are excellent."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "Slow, not enough memory for apps, not useful for much more than a cute paperweight that tells time. If I could choose a target for destruction in a choice of products, the sequence I would choose would be Samsung Mobile phones (slowest and completely useless devices I've ever tried to use for 8 years), Samsung Tablets (slower and with less memory than an amnesiac stoner), and the iPhone 7. I would sacrifice my right arm to avoid having to buy any of these devices for the rest of my life."}
{"rating": 2.0, "product_id": "B018QAYM7C", "review": "Tablet arrived on time and was new, but is NOT a 3G tablet as advertised in the specs listing. I originally purchased this to replace my tablet that was on our 4G phone network. It has no sim slot so it cannot be added to any phone network."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "It's the tablet I was in search of for a while, I have nothing to complain about"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Exactly what the description said."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "great"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Item just as described. Works Great."}
{"rating": 2.0, "product_id": "B018QAYM7C", "review": "My old Samsung 10' tablet was dropped and the screen cracked, so I decided to purchase a new tablet rather than fix the old one.  I now wish I had just fixed the old one.  I got this one because it was more affordable, but the experience has been a disappointment and I may just give this one to my kids and get something else.\n\n- Performance - Slow.  It often freezes on me for several seconds and I have to shut down applications.  Web pages seem to take a long time to load.\n\n- Resolution - Underwhelming.  I often see the jagged edges in the graphics, something I didn't see on my other tablet.\n\n- Design - The buttons sit exactly where you hold the device, and I often (as in several times a day) hit the back or application list buttons by mistake when simply holding the device in a natural way.\n\nMy recommendation.  Look for a later iteration of this device,  I am generally very happy with Samsung products, but this one was a miss."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Just what I needed."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Love the tablet  and all just seem a little low comparing to the samung tab 3 I had before. Really low"}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "I give it one star, only because for gaming proposes it is terrible. Im not talking about games like temple run. I play War Robots which is an online game play and graphic intensive. The is so much lag in game play. I used to have a galaxy tab S 8.4  which was absolutely perfect. Tablet got destroyed and i purchased this one. Biggest mistake. Even simple images on facebook or instagram, quality is not the same. Save your money and get the newest tab S. Expensive but got be worth it."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "It meant my expectation"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "So much more reliable so far than my laptop which was more expensive. Great purchase. Works fast and has all the applications I might need for general work, school and play."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "worth every penny, so glad I purchased"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Product still going strong 1 year later. Great condition / quality product."}
{"rating": 2.0, "product_id": "B018QAYM7C", "review": "The volume is so low.  Also it is hard to understand."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "This Tablet is flawless. We love it."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "This is a good little tablet. Everything is nice but nothing is great. The only real problem is the tiny storage. Even though you can use a micro SD card most things like Google play books and the kindle app won't download to it, making my digital comic collection a bit frustrating. However I still really like this tablet, especially after my disastrous attempts at buying high powered tablets."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Good for everyday usage. Decent battery life, although the tablet can never stay at 100% for a long time. Not for gaming."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "It's AWESOME"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Very nice tablet and a great price"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great tablet, I love it, nice and quick, so I don't have to go on the computer."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Terrific would highly recommend"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I am really loving my tablet.  Took a long time to pull the trigger for which tablet I wanted and so far think I made the right choice."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "it is really a good tab and really compatible"}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "75% of the 16GB is taken up with system files that cannot be removed.  You can add an SD card but cannot store movies on it.  It works for what I need it for most but I took it on a trip and could only download 1 movie for the trip even after deleting all apps I had on the device.  I don't store pictures or music on it so there was no space taken up by those types of items."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great tablet. easy to set up. The color jumps out at you."}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "resolution is really low"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I recommend this product.  It is everything I wanted."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "fast, android, tablet, cheap, works just fine! for what i need it!"}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "Tablet has a security feature for Google account verification after a hard reset. The problem is my daughter tried to set it up with a Google account when she got it but it would not allow her to as she is too young. Unfortunately the device is requiring the Google account email which Google did not approve, and now the device cannot be used without it. A flawed piece of equipment."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Great"}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "Bought one, returned it because predictive text kept deleting what I'd typed or changing it to something else. Second one does the same thing, so I can't use autocorrect at all. Very irritating. Another user said they had the same problem with this model."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "I was pretty happy with the Tablet at first. It has been 6 months since I received it, but the screen starts to flash from time to time. I expected it to last longer than 6 months. Very disappointed."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Need this for a dedicated Tablet for my drone.  As it turns out I liked it so much I got another one for regular tablet use."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Love the convenience of a tablet."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Got this for my mom birthday, she loves it...great product, great price..."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Easy to use, light weight,  perfect size. Fits my needs perfectly."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Perfect gift for my son!"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Great upgrade from my 8\". Wish it was as light."}
{"rating": 2.0, "product_id": "B018QAYM7C", "review": "returned"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I love my tablet. I recommend. I uses it to stream tv and it stream fine. I not as fast as an iPad, but for the price, it does e job."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Awesome tablet very happy with it so far,wished the speaker was a little better"}
{"rating": 2.0, "product_id": "B018QAYM7C", "review": "The screen quality on this tablet is pretty bad and I had to return it."}
{"rating": 2.0, "product_id": "B018QAYM7C", "review": "definitely one of the lower end tablets.  camera is poor.  couldn't read a picture taken of a recipe.  processor is slow too.  this might be fine for some folks as a first tablet but i returned it and paid extra for an s2."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great tablet big screen love lay out"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Really nice tablet easy to use very user friendly.  Battery not as great as people say but good enough"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Love this product. Since purchasing i almost never use my laptop anymore. The battery also lasts a long time. Highly recommend."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "I use this in an airplane for ADSB In traffic and as a GPS to drive an auto pilot. For those tasks it's OK but the case is too slippery so I am always afraid I will drop it. I set the screen for max brightness, run two APPS, and after 1.5 hours the battery is down to 75%. The USB connector is not very good. You have to be very careful connecting it. I do not use it for sound or to watch movies. The GPS has been rock solid."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "Tablet turns off on its own.  Called Samsung customer service four times,  customer service making promises to return phone call, never happens.  Will not replace after 4 months of purchase.  Poor quality product and customer service.  Will never buy Samsung product again."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great tablet"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Does everything as it should do. No problems found after using it for about a month. Battery holds charge well."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Bought this for my 8 year old daughter. She loves it."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "OMG!!!!!...I LOVE LOVE MY  Samsung  Galaxy  Tab 9.6. The screen was bigger then I expected.  I so glad I ordered  it....Well worth the money.  THANK YOU SO MUCH... And it did not take long to ship."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "seems okay so far, around the edge on one side the backlighting is messed up though, like a haze around the edge."}
{"rating": 2.0, "product_id": "B018QAYM7C", "review": "I would like to return this item for a credit as I purchased it in January of 2017.  I don't have the box in came in."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Only had for a day but so far I am really satisfied. Display is Crystal clear and unlike my other tablets, the WiFi range is excellent! Anytime I buy electronics I will buy Samsung products first."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Love it. I can't take it away from my 9 year old who I bought it for. It is quite fast even when watching Netflix or playing the endless kid games available on line like clash of Clans. This replaced his IPAD3 which broke again and not only does it have a better screen but it runs faster and smoother. No catching up when scrolling on facebook or Netflix."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Perfect size tablet! Primarily used for browsing and listening to music. Purchased at a great price too!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great tablet for the price.  Being a big samsung fan I couldn't be more pleased. And since it's identical to my phone the overall design came natural.  Love it!!!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "We had purchased 4 cheap tablets Dragons and don't do it.  Pay more and they should last longer.  They look good, they take a charge, they turn on and you can use them.  Yeah!!!!!!!!!!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Everybody poops. There's no getting around that. And these days, most people whip out their stupid phones and do their email work while on the throne. It's hard to see a decent news article or write an email on those tiny little screens. And I don't need that kind of frustration when I'm trying to lure the brown snake out of its hole. Maybe a phone is sufficient for a quick case of the hershey squirts. But when you've got one coming out sideways and can't get the train out of the tunnel, you need a bigger screen to distract you while you break up the logjam.  This tablet serves as a perfect partner when you're riding the porcelain pony. You can read up on trump while you dump, or catch up with buds while dropping the muds.  Take a chance on this perfectly-sized device, and you can just relax and read easy while coaxing out the smelly brown mice. Happy pooping!"}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "I have a Tab A and just purchase a Tab E for my wife.  Samsung confirmed that my Tab E does not have the automatic Wake Up feature.  That is a step backwards.  The cover should be able to wake it up and put it to sleep.  That saves messing with the on - off button."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Not too bad. Got this for my sister who got her first smart phone only months before...that is to say she is PC illiterate...and she was surfing the web in no time ,watching YouTube and Netflix without any issues"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Was looking for a small device for reading books, writing, referencing information for my various hobbies (being able to quickly pull up web pages or instructional videos was key), watching videos.  It does all of these tasks very well.  Data entry was also important and with a keyboard case (I purchased a Fintie brand one) its almost as functional as a laptop. Battery life is good for how sleek and powerful the device is.\n\nI would prefer a laptop with similar screen size, but one with similar functionality and reliability would be more than twice the cost of this device, even with the cost of the keyboard case factored in."}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "It's good, but has one serious drawback that I wasn't aware of before purchasing: it doesn't have a video output capability.\n\nAmazon has now cracked the code on allowing movies to be downloaded for offline viewing. We'd love to do that, and then stream the video to our TV, but no such luck with this device.\n\nThis struck me as a stunning shortcoming. Had I known about it in advance I would've purchased a different tablet."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Given as a gift and they love it"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I am very satisfied. I recommend it"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "I purchased this for Internet surfing and my daughter to play games.\n\n1. The 16gb storage sucks. When you download apps, it does not automatically download the external storage(SD). You have to move everything manually and set apps to save on external storage.\n2. It lags when loading games or mid game.\n3. The touchscreen isn't has good as my Samsung Grand Prime. Sometimes, it misses your commands or you have a tap a few times.\n\nI still rated it 4 stars because it does what I need it to."}
{"rating": 2.0, "product_id": "B018QAYM7C", "review": "I bought this as a Christmas gift for my husband when Amazon had its big July sale. My husband enjoyed it thoroughly while it lasted. The battery started to drain faster than it appeared to charge. It has now and it won't charge or turn on no matter what is done to it."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Son loves it"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Satisfied!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Very happy with purchase"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Perfect for my needs. Added a keyboard & case, great for small tasks!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I have had the Samsung Galaxy Tab E 9.6\" 16GB for almost a year now. I use it primarily for watching netflix and schoolwork. I can watch a whole episode of netflix with wifi and only use 1-2% of a charged battery! I use it for powerpoints an other Office related programs for schoolwork. I am very happy with the quality and I strongly suggest getting a inexpensive Moko case for it so that you can stand the tablet up! Super happy with it! Picture quality is also great!"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Works well good value not an I pad but serves its purpose.  Gaming, entertainment, general internet usage all work ok"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I got this to replace my iPad and I really like it. The ability to have two apps open is great."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "I bought this Grade A refurbished from VIP Outlet and it came in brand new condition! I gave the tablet 4 stars out of 5 because of the weight. Its pretty heavy, otherwise I love it!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I gave this tablet to my husband for Christmas, he really likes it.  He likes to read the newspaper on it.  He also uses it for business and to pick up business email which traveling, it is easier to carry than a PC."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Worth every penny.  Works wonderfully and very easy to operate."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "I love my tablet.  Nice quality.  If you like a Samsung phone, you will love the tablet.\n\nThe only problem I had was I kept getting a message stating to use the correct charger with the device, even though I was using the charger that came with the tablet.  I used a charger I had at home and it charges fine.  I go a few days without having to charge it.\n\nEven with the charger issue, I would buy this again."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Works great. Just what I needed"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Bought it as a gift for my wife.  She loves it......."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "What a great tablet. Thank you."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "This tablet is great for keeping me current on news and social media.  I also have work files on it which are easier to access than going to my computer.  It is very portable, fast operating and easy to personalize and use."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great tablet!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "The device came as ordered.  Excellent backup to my iPad."}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "Yes, nice Tab....Need some kind of case tho? Have any suggestions?"}
{"rating": 2.0, "product_id": "B018QAYM7C", "review": "You get what you pay for.  I have a NOTE 5 and love it, this is not the same. I avoid using it because I get frustrated with it."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "I've had this for a while it's been a nice tablet. Disappointed the does not have HDMI. I've been Googling Non-Stop for HDMI micro USB adapter. Like an hour or more. The only thing I found Amazon isn't Amazon Prime eligible and has a 2 star rating. The two-star rating  says it disconnects from time to time.\n\nUpadate:The best I found for putting this tablet on the big screen is the have a laptop or something with a HDMI output and SideSync installed on laptop and tablet.\n\nSave your money and research before buying a tablet.  If you're not looking to put this on the big screen and not gaming extensively this is a pretty nice tablet. This is the only tablet I've ever had my first tablet ever. Find it frustrating that every so often I have to move an app back to an SD card.\n\nResearch before you buy to get the tablet right for you!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Is Good"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Nice tablet. Works great"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Purchased this tablet and I enjoy the sturdy feel.\n\nPros: It is solidly built and has a vivid display this is smooth. The rectangular shape is awesome for Hulu, Amazon Prime, Netflix,etc. It makes for an excellent Kindle/ebook Reader as well. Nice for any browsing on the web.\n\nI also have a season subscription to MLB at bat. Watching live sports is crystal clear with stunning detail. I cannot wait for NFL Sunday ticket.\n\nCon: as of 4-16-17, the tablet updates to the latest Android operating system which is Android 6.0.1. A key feature is the ability to set up more than one user account. Problem is this can be accessed on the lock screen before your passcode is entered. I attached a photo to demonstrate. Anyone who picks up the tablet can add a guest account and go into google play store, input their email, download apps, not on your dime but still, surf the web, even see photos you took under your account. There is no way to change this drop down menu to just have one user, yours!\n\nSo just be careful where you leave your tablet. Another issue related to this device settings is that the notification panel can also be pulled down at the lock screen. A thief can turn on airplane mode. This no doubt makes it more difficult to find your tablet with no internet connection. So even if you installed Samsung find my tablet or Android Device Manager it won't do much good because those  services require an internet connection.\n\nI am going to see if a Geek Squad agent can solve those two issues on lock screen: disabling guest accounts and the ability to pull down notification panel. I will update anything I find out.\n\nUpdate: I consulted Geek Squad Agent and there is nothing they can do. It is part of the makeup of the tablet baked into its settings with no way to solve either issue. I also went to Best Buy and talked with the Samsung rep who also was not aware of this issue. She promised to look into it but could not find a way in the settings to fix either issue.\n\nUPDATE: 3/26/18- I installed the latest software update and it fixed both those security issues. No access to guest account from lock screen and no access to wifi toggle or airplane mode from lock screen. Thank you Samsung!\n\nThe camera is poor. 5 mega pixals does not get you much. I realize they had to trim down some bells and whistles on this device so camera is not too much of an issue for me.\n\nSound is poor. Speaker is located on the back so volume travels away from you. If speaker was on the side or bottom of the device it would be much louder!\n\nOverall some flaws in design, but I am happy with larger screen and happy that lock screen security issues were fixed by latest update."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Nice tablet, the power button is in an awkward place, but it works well."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I really enjoy using this tablet. I have a small computer that i use for homework, etc, but this tablet is very good for web browsing, watching videos and playing games. It's pretty responsive and easy to set up. It's a bit difficult watching anything outside, but that is the same with most screens. Overall a good product"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Solid all around tablet that came on at a good price. Works essentially as a larger phone and no gripes here except that my refurbished product was damaged on the corners. To be 100% fair, customer support did follow up via email and offer me to return the product for a 100% replacement or refund. I passed on the offer but it does irk me a little bit that I would receive a roughed up product.\n\nOther than that, runs smoothly, dual/side-to-side app display works neatly. Even after a few months of use, product shows no slow and battery can hold its own for quite some time."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great tablet, used daily and very satisfied with it."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Love this tablet!!! The sound is perfect and everything with it!!!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "great product."}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "I am unhappy with the short battery life. I was used to an older, larger tablet that kept it's battery life better."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Nice tablet for a good price. I like it better raff the tab a."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "love love love this tablet!!"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Arrived before the due date with everything intact.... very satisfied"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "This is a very good product, and I am an Apple person. Got it for my ex-wife. Even she doesn't complain about it."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "The tablet was great but I ordered the wrong size."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Prior to owning this Tab E 9.6, the only other tablet I owned was the original Motorola Xoom which was a first-gen device with a lot of little drawbacks. It ended up being more of a toy. Otherwise I have been a smart phone + laptop guy for the past 5 years. Never found a real need for a tablet.\n\nFast-forward - I purchased the 2016 model with 16gig memory, 1.5gig RAM and the 7600mah battery / non-cellular model. Basically I started traveling internationally a lot in the past year and wanted to carry less stuff... mainly mags and books that take up a bunch of space. Yes, I am a very late convert to reading mags and books digitally and now I am hooked. I also added a 128gig microSD card to hold a whole bunch of books, mags, movies and music. Right now this device is pretty much my mobile entertainment hub.\n\nI think I paid about $180 for the tablet, $20 for the microSD and $10 for a case. It's been very handy. 1080p movies in multiple fomats play fine (mp4, mkv, avi). With an added app ePub and PDFs are easily accessible. The front camera is just \"ok\" for Skype. The battery life is excellent. On a trans-Atlantic flight, I watched a movie and read a book and still had >40% battery left.\n\nThe big thing this device is missing is a flash for the rear camera. It's a little under-powered as well. But this is Samsung's lower-end device. And it runs what I want perfectly fine. Make sure you shop around. I found it for <$200 locally."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Adobe flash not supported"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I needed a new reader with a large screen, and this is perfect for that, and much more. I added an app that lets me choose color and brightness for reading, and I can now enjoy reading many hours in comfort."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Just right for me"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "So far, so good.  This was the 3rd tablet I tried, deciding to get one to match my phone, and it was the only tablet to consistently work.  It does nothing more than a tablet should.  It's a very stock, standard performing tablet. However, it is fantastic for the price at this quality.  It's fast enough, connects to Wi-Fi with no issue, can run multiple programs....nothing extraordinary but exactly what it should do.\n\nHere are some cons:\n1) you have to press rather hard, it's not very sensitive (tehehe)\n2) could be louder?\n\nI don't have much to add.  It's a good tablet for a good price.  Don't expect to run skyrim or easily Photoshop things."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Fast! Plays videos cleanly! Nice size and price point!\n\nQUALITY product!"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "This is a good tablet for simple use. The camera/video is notjing special. But, overall it's a great tablet and is useful for all we use it for. (Watching netflix, YouTube, web surfing and social media)."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great tablet, you could never go wrong with samsung devices. Totally recommended."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "It works perfectly well."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great Tablet.  I love to read my Kindle books with this and collect my e-mails & facebooks."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Very fine product, no complaints so far"}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "Touch ability is not to great. No notification lights. Speaker in a horrible spot. Other than that works fine."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Excellent tablet!  I also have an IPAD Air and I prefer the Galaxy over the Ipad by far."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Very satisfied with my tablet"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I love my tablet and that it all fits into the case.  Tt does take some getting used to, but I use it a lot and love it.  Wish I had gotten it sooner."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I'm still getting to know what it does but so far so good. I really love this tablet."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Was for my mother  She loves it"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great tablet, works perfectly for work and play. Battery stays charged for days"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "This tablet is just what I needed.  Nice features and easy to use."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "This tablet was easy to set up. it has the basics which is just what I needed"}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "It's a very affordable tablet, and great size, but it was very slow... I don't really use the Facebook app, so I was on it via Chrome, and it was so dreadfully slow. I tried only having one tab open at a time, but it's pretty annoying to have to wait every time I scroll up or down on a page. Maybe I'm just spoiled-- but it was very laggy, so I returned it."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Really nice upgrade from last Samsung tablet"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I own both this and a tab a 8.0 ... if you do documents some gaming, or surfing in general, you will love this study built tablet.. And the tab a 8.0 as well."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "Don't buy anything but new unused tablets. I ordered this only to find out that you can't get into the tablet without knowing the old owners account. It's best to just spend a little extra and buy new."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Perfect"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "The tablet is great I use it for work it's awsome, I don't have bring my laptop anymore, it's awsome"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Not the best of all tablets, but the best for its price."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Very Big screen almost 10inches. Works clear and fast. Battery drains quickly I noticed so make sure not a lot of app are running in the background. Very thorough setup process."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "The best of the best and my son is super happy with his gift . And is very resistant"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Using it now."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Wonderful tablet"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Love this galaxy. Very easy to use."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "it's good"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Love my new phone."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "NOT AMUSED.  This quote from the product description is an outright lie:  \"The Galaxy Tab E was made to go wherever you go and do whatever you want to do.\"  I've had this Tab E device for several months.  1)  The charge is intermittent.  Sometimes the battery drains very fast, faster than the device will charge.  Samsung tech support went through settings to optimize the battery longevity.  Charging remained a problem.  2)  Tapping the screen does not consistently excecute a command, such as closing a window or switching between windows.  I was told this is related to memory.  This is a new device.  Only Line Messenger is loaded on it.  And Samsung tech support helped optimize settings with apps.  So why would memory be a problem?  3)  I bought this device in the United States.  Soon I will be traveling to South Africa.  The largest internet service provider in the area I will be traveling to in South Africa lists the Samsung Tab E as a compatible device.  Yet Samsung does not sell a power adapter plug or voltage converter so I can use the tablet in South Africa, nor does anyone (throughout 6 calls) know who does sell these two items for any country that uses this device.  The last Samsung representative suggested I peruse Amazon for the necessary adapter and converter.  If consistent training for product function, requirements, and accessory availability were consistent, that would have been said during the first call.  However unsatisfactory an answer it is, I would not have wasted time calling Samsung over and over.  4)  When I called about this 3rd issue, I spent approximately an hour and a half, including hold times, across 6 calls.  Three times Samsung wanted me to talk with their Accessories department / parts distributor J & J(?).  I did not call J & J(?) a second or third time because J & J(?) was as frustrated as I am, that Samsung transferred me to them for the first call.  J & J(?) does not have a power plug adapter or voltage converter and they don't know why Samsung referred me to them to purchase these items.  I was told to call tech support, Sales, Accessories, and to consult the Samsung website (which I did before making the first call).  5)  Some notifications for apps are invisible?  No matter where I looked in Settings, notifications for some apps simply will not turn off.  I won't be buying another Samsung product for a long time no matter how good it sounds."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I have counted on a tablet for the last 6 years and use it daily for work.  I work in the field and rely on the portability of a tablet rather than a laptop.  Even though I still need a laptop for certain applications, I have used a Motorola Xoom for the last  six years.  The Galaxy has been a very nice and affordable replacement to the Xoom.  My Galaxy does not have cellular capability, but I can wifi through my external hotspot while in the field.  The Galaxy pros: very affordable, very fast, SD card capable for extra storage.  Cons: as all tabs, there is no USB ports which is a pain and the touch controls get in the way and cause you to exit out and sometimes delete what you are working on.  All in all, it suits my needs."}
{"rating": 2.0, "product_id": "B018QAYM7C", "review": "I picked up this tablet at Best Buy as an open box deal for $180 to replace my old galaxy tab 3 8\". Even though its newer it doesnt come close to matching it. Im amazed Samsung would even release something of such low quality as this.\n\nBiggest complaint is the awful speaker.  Im amazed that something made in 2015 has not only a terrible sounding speaker that rattles the whole tablet but it is also placed on the back of the device where it is easily covered up.\n\nOther issues are its lack of lighted buttons, lackluster performance and the display resolution is not great.\n\nI guess its an ok entry level tablet for a budget price but even in its price range I think there are better options.\n\nWill stick to my trusty Galaxy Tab 3 8\" for now."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Good"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Nice tablet!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "This tablet is awesome. The battery life lasts a long time. I don't have any complaints. :)"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Amazing husband loves it works great!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "excellent"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Tablet as described, works great and the best of all comes with external port for Microsoft sd car to enhance memory .. can transfer play videos to smart TV via WiFi and music via Bluetooth"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Wow  so easy to use...like my phone.  May purchase again as a gift.  Very pleased"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Item works well and has been fun to use."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Not as nice as the Note but it does what I need it to do."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Very pleased with my Samsung Tablet,"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Loved it so much....bought another one for grandchild.  As good as the IPAD for a lot less money."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I got this for my wife for the last Christmas. She loves it."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Got rid of our ipad mini's for these instead. Half the price of my ipads and 112gb more storage when you put a 128 gb mini sd inside. Instead of being unable to download one movie on my ipads I can now download a ton of things and have a bunch of apps for my kids to play on. I'm usually an apple lover but my tablets and phone are now switched to samsung. Can't beat it for the price and great product."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Received new in factory box with charger.  Very pleased.  Works great.  Great battery life and screen resolution."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "A good product which meets all expectations. A little heavy consequently 4 stars instead of 5\nMaybe that can't be helped"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "this is easy to use . nice screen size and picture. works great."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "i love the larger 9.6\" screen for the samsung tablet, everything runs smooth, i use it mainly for board game apps and video game apps"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great product, perfect conditions!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Love the size!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Love everything about it !!!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I love my new tablet.  The size is perfect.  It has enough memory, but I can add to it if I need to in the future.  I like the position of the buttons and the charger.  I use it several times a day for reading, emails, games and, sometimes, shopping.  I've had 3 other tablets, but this Samsung is the best I've had.  I highly recommend it."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "This was a christmas present for my mom and she loves it!!! Works very well!! Was super easy to transfer things from her nook over."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Performs well with a great display"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Love it"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great"}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "I am a big Samsung product fan, but this tablet falls short.  As previously reported, the speakers are terrible and sometimes I have to hold the tablet close to my face to hear it (I didn't realize that they were this bad).  The battery life is only about 8 hours, not nearly as long as an old ipad that I have. Additionally, it takes a long time to recharge it.  Once it ran down to zero and it took over 8 hours to fully charge it.  Lastly, the back key and the open app key on the side of the screen do not have a back light.  So if you are using the tablet in bed with the lights off, you have to poke around the edge of the screen to use these keys.  If I had to do over again, I would buy a better model."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Love this Samsung Galaxy Tab E.  I had an old Samsung tablet that finally died and couldn't wait to replace it.  I especially love the size, 9.6!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Love it."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "good table for price"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Works well usually, but after a few months it can get occasionally flaky.  (If not for that I'd have given it 4-stars.) For emails, paying bills, checking news, etc., it's great.  WWF, excellent :-)  I'd recommend you buy.  Not so much for the camera, or streaming video, or detail zooming on art images from the web, or listening to music (though with headphones music is ok). Overall nice asset to have especially at the price point."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "I just bought a Samsung Galaxy  tab  e nook  at Barnes and Noble book store and I like it a lot!! I initially bought a ipad air 2 but I returned it because I just couldn't justify spending $425 on something that I won't be using on a daily basis..I got it because I want to be able to purchase and read my ebooks and I want to watch netflix and maybe play a occasional game or two..it's perfect for all that and more and I really like it that now I can add a SD card and save books to the SD card..the old tablets wouldn't save books to the SD card..so this frees up room for game and entertainment apps..not to mention you have all your books in your cloud if you're not able to or ready to buy a SD card yet..nice picture quality..you get something just as nice as the ipad but for half the price however the sound quality on this device is pretty low on the highest setting"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I use it every day."}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "average tablet - bought an Ipad to replace it"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "This is a really good android tablet. Has Android 6. Purchased first one from Amazon warehouse deals.\nBought a second one from Walmart. I use one for reading Band lyrics at the gig.\nI use the other one for processing credit card transactions at my business. Recommended.\nUpdate Nov 2017, bought a 3rd one from Amazon for a college kid to go along with her Android phone.\nMy original one, I still use for reading PDF lyrics and also playing MP3s at band gigs.\nAndroid Galaxy Tab E 9.6\" Wifi Tablet."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "lov iy"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "wish these things would come with more instructions, first one, wanted something smaller to take on trips, but I left it at home because I just couldn't seem to get the hang of it. I guess I need to go to a class. I will rereview when I am more comfortable with it."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Love this tablet!  Runs great,  beautiful  display,  easy to use."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Typical good Samsung item. Nice big screen makes playing games much more fun.  Now I can do email on it instead of having to use my desktop."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Hard to find cases for it"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "perfect buying"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "No issues arrive on time and had not problems"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "great product, good price. Thank you!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "It work just fine it's great. Wow"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "I initially bought this tablet because my laptop stop working. It has been a great subsitute for any regular laptop or desktop computer. The big screen was my preference and it is light enough to want to carry around for work. The big difference I notice from the Tab E and Tab A is the resolution on the screen. Tab A is definitely more superior when it comes to the screen display. Other than that the price is great and it gets the job done just like we expect from any device we invest in."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Great tablet for kids but the camera and speaker suck"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "So far I love my new tablet it does a lot more than I expected it's great"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Love the tablet it's everything I expected it to be"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "It is a good product! It is fast and its screen works extremely well!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "My Son & I are avid Samsung/ Android tech geeks.  He knew I had shopped, discussed, researched for months which Tablet would meet my small business and entertainment needs.  He hit the nail on the head without breaking his bank account!  I love this tablet.  It does everything I need from emails to spreadsheets to invoicing to researching with beautiful display, quick action, and expandable memory.  Thx Samsung- it's the perfect Tablet!!"}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "I did not purchase this from Amazon; it was a gift to replace my dying Nook, and I'm fairly certain my husband purchased the Samsung tablet at BN. I'm not a fan; however, the time between charges has been extensive, which is great. As I said my last two Nooks needed charging every day after a couple years use. As another positive, I have found it convenient to jump on online using the tablet, and the response time has been fairly speedy. For my purpose as an e-reader, I haven't been as excited. The tablet has been heavy and bulky used as an e-reader (I'm not saying it actually gains weight, but a person expects an e-reader or book to be lighter while expecting a tablet to have more heft). It doesn't seem to sit securely in the cover although it hasn't necessarily popped out yet, and the weight causes a strong imbalance which makes my arms tired keeping it level and causes the tablet to lean while holding it up to read. Sometimes I can get the tablet to sit up on a table using the cover, other times it just slides away.  It took me a fairly long time to figure out to work out apps; I finally had to call the library to find out that I don't need to download through adobe digital editions, just use the overdrive app. (I very frustrated and ready to throw it in the garbage that day, and I'm pretty sure that is why I couldn't use my husband's larger Samsung tablet to download.) Despite my lack of enthusiasm, I hope to get many years use from the tablet."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Excellent!!! Tablet very fast and comfortable for everyone"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Samsung should include a rubber case WITH this product, because it is clumsy to handle and Samsung KNOWS as much. I bought a silicone case which fits like a phone case. Real nice."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Good"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "It was given as a gift to my partner for life and I'm glad I did.  Its awesome.  There aren't too many words I want to place here but to say its awesome is really an understatement.  She loved the gift and uses it every single day; for me that is the best feeling."}
{"rating": 2.0, "product_id": "B018QAYM7C", "review": "Both times the screen partially blinked blue. It seems like a common problem."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "GIFT"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "excellent"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Good and cheap"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great tablet! I was able to download all the apps I use easily."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Beats all other tablets. The storage space doesn't matter because you can easily buy a micro SD card. Screen quality is great, camera is ok for a tablet, and it is looking awesome."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "Will not turn on "}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Just a great tablet to have. Camera is great and so far it is super fast."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I purchased a refurbished model of the popular Samsung Galaxy Tab E 9.6\"; 16 GB as a Christmas gift for a friend. My friend loves it. You can not tell the refurbished model from brand new, and it was less than 1/2 the cost of new. There was a little problem with the charger and VIPOUTLET handled the situation with great speed and professionalism. I am very happy with my purchase of this brand and model and the professionalism of VIPOUTLET."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "I purchased this July 2016 and the past month I've been having loads of issues with the wifi.\nIt will suddenly drop the wifi and went I go to reconnect it will cycle forever and the say it couldn't find connect.\nEverything else in the house connects just fine with no dropped connections so I know its the tablet.\nI've tried everything in the settings and nothing fixes it.\nUnfortunately I am way out of the window to return this but its pretty sad when something like this doesn't even last six months.\nDo NOT buy!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "This was a gift to my husband. He is very delighted"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I am absolutely in love with this tablet. I am able to do most everything I do on my laptop with a very few exceptions. I had an older samsung tablet that kept crashing and freezing up so it was time for it to retire. I decided to get another samsung mostly because of the price and the reviews. I was not expecting this tablet to work so well. I did get an sd card and switched a lot of the apps over to it. I am very happy with this purchase and I secretly tease all of my family and coworkers when they complain about their ipads. I absolutely positively recommend this product to anyone and everyone if you are looking for a good tablet to take care of all of your needs"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "great screen, fast processor.  interface matches my samsung phone."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Love it. My 2nd Galaxy tablet. Will purchase another."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I like it"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Very nice"}
{"rating": 2.0, "product_id": "B018QAYM7C", "review": "I was very upset to receive this package. The box was completely bent and the actual tablet had some dents and marks on the edges. Same places from the box dents. I got this gift for my husband for Christmas and he texted me today telling me his screen no longer works. I'm not surprised given the condition it arrived in."}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "I'll give you the tl;dr version first:\nIf you want a basic tablet to browse the internet, watch videos and play games, it's good value. If you need a productivity device, you might want to try a different brand.\n\nI got this to replace a dying second-gen iPad mini. It provides about the same level of performance as the second-gen iPad mini when it was new, although less likely to crash when loading internet pages from a secondary app.\n\nGraphics are nice and smooth, good image resolution, responsive touchscreen. Excellentcameras. Apps and videos load quickly. Sound quality is very clean, even the onboard speaker is crisp. It does occasionally go blind to its WiFi connection, requiring a quick off-and-on-again -- annoying but easy to resolve.\n\nI'm strongly displeased with its word-processing user interface. I do a *lot* of writing -- it's the main reason I need a tablet -- and the way the spell-check/replace function operates is needlessly complicated and frustrating, as is the way the cursor drops in the middle of words rather than finding the nearest end (honestly I could write their QA department a full report on providing smoother function and accessibility for the word-processing UI). There is no way to disable gesture typing -- leading to numerous spelling errors -- and the keyboard (it doesn't matter which style is used, this happens with all of them) is hypersensitive and requires an obtrusive level of precision; I have tried typing with hands and with a fine-point stylus with similar messy results, and had to resolve the issue by purchasing a bluetooth keyboard.\n\nNot a good productivity device on its own; given a good peripheral setup it provides adequate function. I'm hoping future software updates improve things."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "This present was for my Daughter in law who absolutely loves to read. She was extremely excited and immediately downloaded APS and books that were already free. I am certain she will appreciate this Kindle and will make use of it.\nShe was able to turn it on and get right to it without delay."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "she loves it........"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Tablet looks and performs very well.  Replaced an old Samsung galaxy tab 2 7\" screen.  The resolution on the tab E is great and performance is snappy.  Have only used it about a month so time will tell on the quality.  Would definitely buy this tablet again, especially if you like and are comfortable with Android devices.  We got it at a good price pre black Friday $149."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Grandson requested this specific Samsung, he was thrilled"}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "Nice Tablet  a bit sluggish and it did not perform as well as some of the favorable reviews stated. I returned it. I have had an iPad for years and love it andI wanted a comparable Android device so I guess I have to contimue looking and up my price range to get it"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Yes please! This tablet is just plain perfect."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "All around good tab for basic thing and a decent price."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "It's light and portable and has many of the functions of a laptop."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Good price"}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "Camera is poor, bit not bad for the money."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Love Samsung electronics, I have the phone and this is pretty much like a big phone. Loaded games for my 5 year old, she uses it more than anyone in the house."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "I am very happy with this tablet. It is very convenient to use and I am glad I got it\nfor Christmas."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Everything was good it was exactly has specified and came on time I would recommend buying from this seller."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I bought this tablet for my Grandma and she loves it!  Item was exactly as described."}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "I'm not much of a tech-e, and just wanted something to use to surf that didn't involve unplugging and lugging my notebook from my in home office.  The screen size is ok, the volume is not quite adequate and the speeds which I am able to stream, for example, Utube submissions, is a little slow.  Sometimes, it has to pause in between videos to catch up and it is very annoying.  I would not buy this again and pay more for a better tablet with better capabilities, but it's not terrible.  Just wish it was better."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Most useful thing I've ever bought. I love craft books & magazines in PDF which neither my Nook nor Kindle would handle well when I transferred them from PC to Tablet storage. The Samsung Galaxy Tab E has the screen size and high-resolution and does that really, really well. I added free Malwarebytes and Kaspersky Anti-Virus along with an app to kill unnecessary battery-sucking background apps. And I use the free Microsoft Word to take notes, since I really don't retain even a fraction of what I did all those decades ago when I was 20-something. All young scholars take note. Learning takes effort but what you learn when you're young truly lasts a lifetime. After middle-age it is infinitely harder and you only remember a fraction. It is use it or lose it, but not so with my HS and university studies. Push extra hard because you can use that knowledge for the rest of your lives."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Really loving this tablet. Only drawback is, it's a little heavy. Other than that, the screen has a great picture, and the processor is fairly fast."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I like it!"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Does it's job for the price, disadvantages are the weight, its very heavy after a while, sound quality is lower than other because of a single back speaker. Dpi could be higher but then again its the first gen of Tab series. Overall satified."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Bought a pair, work well. I expected issues with a specific game they botgh played that I noticed on a Tab 2 10.1....not here. Solid processor and smooth item for the cost."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great Christmas present"}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "The one I got didn't work had to return"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "on switch needs to be larger."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Wonderful product!  Bought it as a Christmas gift for my husband.  He hasn't put it down yet!\nJust the right size to look at videos like Netflix and Hulu, plus large enough to read his books.\nPrice was not too bad either.  I was looking for a reasonably priced tablet with a quality name behind it and I got it!"}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "It's okay."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I love it! I would recommend this product."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Use it all the time. Very nice tablet."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "It was more than I was  expecting"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "I bought for my girlfriend and she said it's ok, she never had one of these tablets so she is still adjusting."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "This is a well built tablet. Colors are vibrant, processing is quick and the size is perfect. I'd definitely buy it again and I just might!"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "I like it a lot! I love the long battery life.  I love the full functionality of MS Office.\n\nOverall, much better than Windows tablet I recently had.\n\nI wish it was a little thinner, though."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Love this. Speaker not the greatest but pair it with a Bluetooth speaker and it is awesome!"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Awesome mid-size tablet..  Android works differently I'm finding out...  but in a good way  ; - )\nOnly drawbacks include  a VERY weak battery.  I am constantly recharging this.  And the most missed was an operations manual!!!\nThey give you a link to Samsung Operation Manuals, but it's only written in either chinese or japanese....very maddening."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "gift"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Nice tablet. I've have used the IPad for the last four years. I've had never owned an android device. This tablet did not disappoint. Highly recommend."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Purchased as a gift for my wife.  She was very happy with the product.  Prompt delivery."}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "This tablet is okay for web browsing and watching youtube videos, but that's about it.\nI'm not sure if mine is damaged but the screen sometimes flickers blue while playing movies, and the touchscreen is not very responsive when I try and play games, so i mostly avoid it. Again, I'm not sure if this is the quality of the tablet or if mine is somewhat defective\nIt's fine for basic stuff, and value wise I think its probably fine since other tablets are crazy expensive."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "This was a gift. I like the size and works just great."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Very nicely packed and working fine!!!!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Awesome tablet."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Accurate description. Very well performance for a good price"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Works great. I was afraid it would be a little flimsy because the price seemed so reasonable, but it is very sturdy. I am using it at the kitchen table while I type this. I like that I don't have to worry about liquid spilling on it."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "My Samsung has done everything that was advertised. Love it."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "absolutely no issues.  delivered ahead of schedule, initial setup was a breeze and the operating system updated to the most current available without any input from me.  The only disappointment is that the tablet does not have a vibration feature, or I can't find it.  So there is no physical feedback when touching keys, powering on/off etc."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "cant get it to turn on"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Love, love, love it!! I will buy this again over an iPad any day!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Screen blinks blue on and off like it's going to go out"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "My daughter got this for Christmas and loves it."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Very good condition and works like a charm, it does so many things, I recommend this tablet to everyone who want a great device, at a great price"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Bought this as an upgrade for my 10yo sone. Everything works as expected and the quality is great from Samsung as always. Using this mostly for entertainment, but the whole Microsoft office suite was pre-installed...which is an awesome surprise! Will update with any issues (so no update means all is well!)."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Good"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Works great"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "its a tablet!"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Not the BEST but never try too... Really good for kids use ,internet and movie's on the way ."}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "Product quality is in question! Tab E developed a pixel problem, 'clouding' in the middle of the LED screen after less than four month of use. Disappointed!\n\nAlso, according to Samsung Technical Support, there appears to be an inherent problem (unexplained or not determined) with the battery/OS or 'interface' that after full charged at 100%, being turned out, immediately upon, start or boot up, the battery charge drops to 98%, a significant drop in charge when the device is simply started and without use of any applications!\n\nPoor or lack of support from Samsung customer service/technical support. Have had a terrible experience attempting to either enquire about issues or obtain support on problems. The first or even second level supports were mediocre and lack of technical skills or tools were prominently evident. Even were reaching supervisors, the responses were very disappointing."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great balance of affordable price and power - battery life is great too."}
{"rating": 2.0, "product_id": "B018QAYM7C", "review": "This was a gift for my dad and he likes his Kindle better."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "great"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I am really enjoying this easy to use tablet.  Perfect size."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Perfect for our family's first tablet"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I love this tablet. I upgraded from a tab4 and it proved to be worth the buy. I am a Samsung person and I love the size of screen and all functions are exactly the same as to what I am used to with Samsung products."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great tablet!!!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great!  I got it as described."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Meets my expectations."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "This is a great tablet for the price. It arrived in a timely manner and was well packaged. The product is as described. Touch screen works well and has a nice, rich color."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Works great, needed updated as soon as I opened it. Also the packing could have been a little better so be sure open it up as soon as you get it just to make sure all is good."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Love this tablet.  I've been using it for about a month now and it's fast, bright and reliable.  I upgraded from a Samsung Galaxy Tab 3 7\" and the additional size is great for me.  The tablet is still very light and easy to carry.  Great buy for the price."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Easy setup, fast charging"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "I love it I use it constantly the pixels are wonderful everything and more than I thought it would be excellent product"}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "Not happy with the pictures it takes."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "We love it! The tablet screen is huge! It is so fast. Easy to set up and operate."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Loving my tablet"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "This was my second purchase, as a gift. A very good tablet for the use at home at the price. Highly recommended if you only use Wifi."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "This was perfect and just what I was looking for, I used it mainly for trips I was taking. I downladed movies onto it and watched away..I wish I bought one with more memory but it is a great buy!"}
{"rating": 2.0, "product_id": "B018QAYM7C", "review": "Even think is good"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Like everything about it. Only issue is that when connected to WiFi, it is very laggy at times. It's not my WiFi signal, as my phone works perfectly when this happens."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "What a great Samsung tablet.. Worth paying the money.. The battery life is good"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "great tablet & arrived very timely"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "look like new, no scratches or dents, works fine\ni recommend this seller"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Best present for myself."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "excellent, it works as well as is described!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "This is an awesome product.  Better than ROKU. I bought three."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Great for a gift,\n  bright screen, only reason why I have it 4 starts was because the camera wasn't the greatest."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Fast little tablet. Great for the price."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great product."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great Tablet!"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "OK"}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "For the money, this is a good tablet but it is not great due to a few annoyances. 1) the sound is awful. I saw the reviews but did not pay attention due to fact that sound is never that great on tablets. But this sound is truly terrible so if you plan on watching movies or lots of videos, you would be better off with something else. 2) The split screen button is in a horrible place and I am constantly hitting it. Annoys the crap out of me. Same with back button. 3) Can'take get latest update on some of my apps, says not compatible with device? Not a deal breaker- just annoying. Otherwise, it is a fine tablet but I wish I had shopped around a bit more before purchasing."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "My 9 year old daughter LOVES this!!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Love this tablet!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "well liked,easy to use,great resolution,front an rear camera,great price to."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Good product. Very satisfied."}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "This tablet is OK!  But spending $160 for this tablet compared to the $230 Table A there is literally no comparison.  This is a tablet I can really say should not exist.  You can see the pixels, the speaker is located in a horrible position, and the speaker is horrible.  The only reason you would want this tablet is for a middle schooler.  Cause noone over the age of 15 will like this mediocrity and anyone younger than 8 deserves $160 tablet to beat the crap out of.  Spend the extra money for the A, or buy off brand for a kid."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "Volume of Sound is not good at all.  Plug is at the top by the Samsung Name.  I'm used to it being on the other end.  I would not recommend this model."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Very good product"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great product for great price!"}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "Awful, terrible waste of money. This is the last piece of trash Samsung product I buy. I struggle to resist smashing my Samsung phone and tablet on a daily basis. It's so slow and will barely operate with more than two programs running. I have to restart it constantly to slightly improve the performance. I will be selling it on ebay soon enough. I hope samsung goes out of business after their phones started exploding. I give the tab E a negative 5 star rating."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I am not a tech person but have worked with my fair share of computers, laptops and tablets and this product is the best one yet. My husband has an i-Pad and I fell in love with it, often using it instead of my laptop. I decided I needed to get one for myself and after a great deal of research, purchased this tablet.  This product charges quickly and holds a charge for several hours (6 or more) depending on what systems are running. I was concerned about the Android operating system because I use a Windows phone and wanted something that would sync with my OneDrive and OneNote (just as my bulky laptop does) and this product is equipped to do that. I was also happy to see that Microsoft Word, Excel and PowerPoint were preloaded and ready to go. It does give the user the option to purchase the upgrade to Office 365, but the older version works fine for my purposes. I can work, surf and play on my tablet for hours without any issues\n\nAfter several days of use I can say the iPad is a distant memory and I am so happy with my Galaxy Tablet. I did purchase the two (2) year protection package for added piece of mind, but have no concerns."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I bought this tablet for my mom-who is a tablet novice and loves playing games on her computer-but loves the flexibility of doing so on a mobile device. She has a Jittetbug smartphone, which is an android operating system so the Samsung Galaxy seemed an obvious choice for a tablet.  I bought this Used but like New and I was not disappointed when I received it. It delivered a day or two earlier than scheduled and it was in pristine condition. It was 60% charged already and several useful apps were already loaded onto it. I found several tutorials on line to learn how to operate it and to be able to show my mom how to as well. It is a beautiful sleek device, clear graphics and the screen is right-sized for her. My mother loves, loves, loves this tablet and she is thrilled with it! She loves that it has made her game playing mobile and takes it to her nail and any other appointments she has where she may have to wait. I also bought her the Moko tablet cover specifically for this model in the magenta and she is a very happy camper. I should add mom is 86 and I know this helps keep her sharp and it's been a pleasure for me to watch her grow more comfortable in using her tablet and to appreciate the immediacy of this device. She may ask me a question about something and now instead of asking. \"Look it up on your tablet,\" she now says, \"I'll look it up on my tablet.\"'"}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "Lots of good apps and syncs well with my other android gear.\nHowever. It has terrible battery life compared to my wife's ipad. About half."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Highly satisfied, very fast shipping, Just as new no scratches  thank you"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I love this tablet for the price!  It does everything I would need to do on it. I would definitely recommend this item to anyone."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "Junk!! USB Stopped working. Gets really hot. Very disappointed. Will be returning."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "Security locked it up permanently after I added a second gmail account to the email app.  I had rooted the device so it's my own fault.  None of the youtube remedies helped. Tore it apart to see what was inside.  MOSTLY AIR!!!  Bought an older LG 8.3 and rooted it immediately.  Absolutely no problems with the LG.  I've always been a Samsung user but I'm through with Samsung now.  Still using my Note and Note 3 though.  Samsung aren't what they used to be ie. Note 7!!!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Glad I bought this tablet. I add an iPad before but couldn't save files unless it's PDF. With this tablet I can save and open every file. Love it! Love it! It's perfect for school."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Real nice. Recommended"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great product."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Just got it yesterday.  It was a gift for my husband.  So far, it's doing exactly as expected."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "I got this as a Christmas present from my hubby. I wanted a tablet and I have the Note 3 and 5. I couldn't help myself and opened it up the day it arrived. I love Samsung products, especially their Galaxy line. Meets my expectations and is a good price... however, it did start to heat up with about an hour of use. It came out of the box with about a 60% power charge already, so that was good. It doesn't seem to work with a stylus though because I tried using my Note 5 stylus pen on it. It's also not very touch sensitive and doesn't work as good as my Note phones. I do like that there's a memory card slot though."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great product!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "This was a gift and my son loves it! It does everything he wanted it for!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Bought this for my daughter and she loves it. Fast shipping."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Very Happy with this Tablet.  For the price, it really fits the bill.  Light to Moderate use.  great for basic computing while traveling."}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "Voice quality is not good and picture quality is ok."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I got this for my birthday.  It's the first tablet I've owned, and I'm utterly in love with it.  It's fast, sleek, and the picture is sharp and clear, which I wanted (also the reason I wanted a bigger screen).  The apps download and respond quickly, and the touchscreen is responsive without being overly touchy.  I mostly use it for games, but I also have a text-to-speech app on it (I have autism and sometimes talking is hard).  The voice on my TTS app, as well as my music, which I was able to effortlessly download from iTunes, both sound clear and clean.  I haven't had the \"tinny\" experience that others are describing, but as I said, this is my first tablet, so I don't really have anything to compare it to.  Overall, it's a very nice piece of equipment, and anyone looking for a decently sized, affordable tablet can't go wrong with this one."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "great pricing great value"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "She loves it.thanks"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I received my Galaxy tablet 9.6 Tab E on time and though it is a little heavy,  I really like it. It has a nice clear display and a large screen. The volume works just fine on my tablet. I am very pleased with my purchase so far.... I already received my system updated to 6.0.1 the day after I received it."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Bought as a gift for my grown-up daughter. Her first tablet so I opted to start out mid-range in price. This is a very good starter or even heavily used tablet. I have a Tab S, but this one works very well and at does the same as the more expensive one does. You can expand memory, which is a good thing for storing movies, etc. and operation is simple if you're used to the Google type interface. Resolution is the same a a high end tablet but does give good vibrant tones to colors and movies etc look just fine for it's intended purpose. I purchased a keyboard/cover as well which really make the tablet a good travel or daily use item. If you're into software, you need a laptop so this does not replace that aspect of technology."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "I saw a blue twitch light like the screen going bad i don't know whats happening"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "just the right size for me"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Works exactly the way I expected it to"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "great tablet, small size ,great specs ,recomend!!!!!"}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "I purchased it use like new, and never could turn it on. Returning back."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Very nice, I bought this with the intentions of using with my yet to arrive DJI Drone, I had read that a tablet was the way to go when it comes to getting the most out of your flying experience and after reading several review and making just as many comparisons this unit was my top choice and I'm very glad I went with it, the screen is bright, responsive, I've used this to watch Hulu movies and TV shows and I really like how great the picture and sound is, This is just like my Samsung phone just 4 times bigger so navigating it is a breeze, it hold a charge well, I've used it almost 9 hours straight and it still had about 30% battery left, I'll defiantly be adding a sd card for extra storage in the very near future.\nDelivery was very fast (2 days) the package was very secure and everything worked right out of the box, very happy with my purchase."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great product! 2nd one for the hubby for Christmas.  I loved the first one for work. Samsung home run."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great tablet. Ordered refurbished from Amazon Warehouse and saved about $90 off of retail. I was specifically looking for this model for its GPS capabilities to fly my DJI Phantom Drone. The display on this tablet is a true 1080P rather than the Samsung Tab A. The Tab E is perfect for everyday use whether WiFi is available or not."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "satisfied"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Si New in box"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "My mom loves it!!!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "It is so much bigger than I imagined it. I'm enjoying the large screen."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I've had this for a year now and I love it.  Reliable, easy to set up, excellent quality."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "Speaker came broken and blown, the tablet it self didn't come reset or linked to a gmailnaccount. So it was locked to the prior account. You can't even Crack into it to reset it. Terrible product. Would have rather bought one brand new."}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "After getting  accustomed to an Apple tablet ,it would not be fair to even try to compare or elaborate on this product."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Bought this tablet for my hubby as a early Christmas gift......exactly what he wanted!  Great tablet for an awesome price."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Nice upgrade from the Kindle Fire 9'6.  Works like it is supposed to, I find the screen quality to be great and love the feel of this tablet."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Love it!!!"}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "Would give it less if I could. Speaker stinks. Duals people on its own and now doesn't ring.... 4 days past my return window....smh"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "So far, so good. All I've used it for to this point is to watch movies from a flash drive while I'm at the laundromat. The functions take a little getting used to if you're not familiar with Samsung products, but it works great with video."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "me facina"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Perfect!"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Excellent features for the price"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "My friend was very happy!!!"}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "Case looks nice, I collect eagles is the reason I got this design. The case itself doesn't really protect very well. It slipped out of my hand the other day, and......now my tablet is cracked, quite bad I might add. If your not as clumsy as I , this might be a nice case, otherwise, I would not consider this one again."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I love it, the size is great."}
{"rating": 2.0, "product_id": "B018QAYM7C", "review": "Does the job..... but their are some flaws.\nExample when typing there are more mistakes than on iPad\nDouble typing....\nI use it for testing application development and like I said it does the job....\nGreat for watching movies "}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "It works just like my phone which makes it easier as I'm familiar with it. Has clear picture, I down load the hedge app and change my wallpaper sure shoes a great picture . It does everything I need it to do, I have no complaints."}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "It's no Apple IPad but regarding the price it's good. Poor sound quality. picture quality is average. Adjusting brightness is difficult. Other than that it's ok"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great choice"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "so far, so good but prefer apple product"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Bought to use while in the bed, basically. I have no complaints about. And the battery lasts a really long time"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "ok"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Very nice"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great Tab"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Love it."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "As described."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Good tablet however the resolution sucks bad... :("}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "I am a long time Samsung only user.  Have owned four previous tablets. Unfortunately,  thinking about getting away from Samsung tablets. Lots of little bugs are starting to become bothersome. This one, it keeps freezing up for a minute or so at a time.  Something is off about sending emails, I have to go thru the reply commands, twice every time. I am constantly rebooting. It's a lot slower for being new.  I use this for my business and it's just not performing well."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Love this tablet and it is priced so reasonably. The sound could be louder but it is acceptable. Glad I purchased it!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I prefer android systems and use a comparible Samsung 7 Edge phone. The Tab E also has expandable storage. What's not to like?"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Excellent tablet"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "This is a great tablet. Grandma loves it for her book reading"}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "Heavy. No users' guide included. I checked on line for a Users Manual and found that it was available in a long list of languages but not in English. Since this is my first experience with a tablet,not having any  instructions available makes learning how to make full use of it very frustrating."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Best samsung tablet ever you should buy it now"}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "This  item is not working"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "I love this thing. Never thought i'd find a tablet so useful. Screen quality is very nice. My only beef with it is that it goes all windows-95 on me sometimes and freezes up and you cant do anything to reset or restart it. You can only wait 10 minutes or so and even then it still acts funny. This has happened 3 times since ive owned it and I am not doing anything particularly strenuous.  You cant power off, nor the volume key-home button (like alt-ctl-del)."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Works perfectly"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Bought this as a gift for my husband and he is very pleased with it."}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "Poor resolution ! But ok for the price ."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "As of this date (10/21/16) I have not been able to access this tablet.  I have had a Samsung rep help twice by resetting it and also a Verizon Customer Service rep.  I have tried every password that was ever used on the tablet to no avail (I do write down any password I have tried.)  Your suggestions please."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "This item  was purchased fur my aunt and she is very happy with the item and said it is just what she wanted.."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "i like this tablet my first fora in to this type of thing im happy and find it easier to use than my PC"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Just love it. DOES everything my Samsung 10 in can do. Hubby stole that one, lol\nLove the size, and now I have the finite keyboard to go with.\nCould not ask for anything more."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Love my tablet"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Still like my iPad and I am a Samsung fan."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Good product"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Ordered the Samsung Galaxy Tab E 9.6\" for my Mom, and from first sight she along with myself were well pleased with it! The device arrived on schedule, came well packaged, and in new condition..even though it was a reconditioned product!! She likes the size of the device very well coming from a 8\", and the screen brightness is great for her aging eyes. The performance is on par with the more expensive tablets out there, she can play her games, check her email, YouTube it, and view the news all without any skips or slowdowns. Very well pleased with the Tablet, and I highly recommend the brand too anyone looking for a great tablet that will do anything you through at it. Thanks for the exceptional service my friends......"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "good deal"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Ordered this tablet for a parent to use just to screen mirror movies & tv shows. It does that perfectly."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Absolutely love this thing. It is the right size. Not too small, or too big. I have a desktop and a lap top. I only use the Tab E. I download Kindle E Books and can read all I want. It is great on the eyes."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I've had this for a couple of months now.  She's perfect!  Great screen, great performance.  I love it!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I am in IT. I've had the tablet for less than a day. Fantastic picture. Runs on Android (Linux based).\nGood organization, great camera. You can use Microsoft office; excel, word, powerpoint.\n\nMay insert microSD card to expand up to 128GB of memory (+ the 11 to 16GB of onboard, which is plenty of room for apps.)\n\nI recommend getting a bluetooth keyboard/ hardcover case for it. Fairly smudge resistant, very responsive.\nI can check e-mails, learn to code, listen to music, whatever.\nWouldn't try it for coding because of a lack of compiler, but I also haven't tried to use it for such.\nYou may learn and write source code on this device.\n\nfor 200 dollars it is a fantastic device. Highly recommend if you want to increase mobility and battery life.\n\nI would recommend a case and travel charger (Though with the battery life you probably won't need it)\nA screen protector would keep the screen safe from scratches and smudges (as it stands, fairly smudge resistant)"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Met all my expectations."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Once again very nice."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Love Samsung tablets"}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "So far, so good, meets the needs of my wife, but the screen resolution is not the best."}
{"rating": 2.0, "product_id": "B018QAYM7C", "review": "Everything works, seems a little slow at times. Going from an Old Samsung Tab 3 7in and not super impressed yet. This was bought used but stated it was in  perfect, like new shape. There are scratches on 2 corners, the back and on the edge of the camera ring."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "It is very nice."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Use for extra computer in place of a bulky laptop. I love mine, great price too."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "usefull size."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "So far, so good (for the price).  Giving it less 1 star for the picture resolution.  I was told \"the other one\" was better so I was forewarned but video and picture quality seems to vary considerably.  At first I thought I'd be taking this back immediately but I noticed video quality seems to improve after a few minutes (most of the time).  It could be my internet service but again, this is very inconsistent. I'm not a techie nerd so make your own opinion.\n\nBattery life is much better than I anticipated which takes into consideration literally hours of web surfing, emailing and watching videos with no problem at all.\n\nDespite other reviews, I truly like the charging port being at the top of the tablet as this thing can sit on my lap or stomach for hours without worrying you're damaging the connector as I've done with many devices.\n\nBeing a Samsung, I'm hoping it doesn't ignite."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I received the tablet before time... the tablet is awesome, the screen brilliant and clear... fast to charge and fast processor... everything is good... 5 stars..."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Wasn't sure how I was going to like this but I love this tablet!!!  I was afraid that I wouldn't use this very much since it was so much cheaper than other models by Samsung (I got a great deal on Prime Day) but this tablet is like having a small laptop!!!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "My husband bought this for me as a gift and I love it!  I get a lot of compliments on it!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Love my galaxy!  Does it all at a great price"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Way better than expected , kinda big on dash board , depending on what you drive ."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great affordable tablet."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Like it a lot"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Great wifi reception"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "no issues, does what we were looking for."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "This is exactly what I wanted in a new tablet. It is great to watch streaming video, play games, and read e-books. The Kids Mode drawing keeps my 2.5 year old entertained quite well!"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "I love the bigger screen and the graphics are exceptional for games. The volume seems a little low (even when on max) when I have headphones on which could be my headphones but I have also tried earbuds and another set of headphones. When I unplug my headphones, the pad adjusts my volume down which I haven't decided whether I like or not (I generally prefer to control my own volume). Even with the processor, some apps tend to load slowly. I have a microSd card attached for additional memory but (like all pads) only helps with photos/pictures/documents and not games/apps which is what I tend to load for the grandson. All that said, I do prefer this pad with an android system to the Apple equivalent."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Purchased used, but it appears brand new, with no scratches or blemishes, and a crystal clear screen.  Starts up and shuts down quickly and smoothly.  My only complaint (and it is probably true of new ones as well), is that the case is slippery."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Best tablet ever!!!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "This is my first tablet and although I sometimes struggle getting around in it,(due to my unfamiliarity with tablets)  overall I just love it.  Wish I'd bought a tablet sooner.  Screen is large and easily readable, and I can do so many things with it."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "It's probably one of the best decisions I've made this year. I was worried about buying refurbished but it does everything advertised and I've had a couple misshaps to attest to its durability. Picture is perfect, everything runs smooth and the battery is surprisingly long lasting. Ive noted 12 hrs between charges and probably longer depending on use, of course. I don't usually write reviews for anything but obviously I'm a happy customer."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "VERY SATISIFIED WITH THIS PRODUCT"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Decided to try a Galaxy tablet for surfing and games. I like fairly simple video games, so this was my decision over a Playstation or X Box. Pretty happy, so far..."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I love this tablet! Great buy!"}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "This tablet seems to have a problem with saving files to the hard disk and to external SD cards. Despite moving files to the SD card the space is never freed up on the drive. Again when deleting applications space on the internal drive is not freed up. Did the recommended cache cleaning and even refreshed the whole system to no effect. Have not received any response from Samsung support or Amazon returns department. Very frustrating overall."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "great"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Kids tablet, for the price, I could not ask for better. In-fact for the amount these cost, why anyone would buy something for more is beyond me. These end up being youtube/social media/email tools and nothing more. Well to watch movies. We love this thing. It gets more hours of time used then any other electronic in our collection (KIDS). Sometimes they even use it to read."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "It has been 4 months since I purchase this tablet, and I love it! I haven't had any issues."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "This is a very nice tablet and the price is reasonable."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Excellent tablet! Great price!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Runs great and provides plenty of space for my needs. Fast operation and great resolution. Migrated from a Nexus 7 which was long overdue for an upgrade. Added a 32 GB Micro SDHC memory card for added space and is perfect for my chords and lyrics apps for my music."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Love the tablet size for my needs."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Works well. Does everything I want it to."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "So much more than I thought it would be. I find that I am using this much more than my phone. So easy to set up, add any apps, and make it do what I want. Better to read anything as the text is bigger."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Great tab and its upgradeable to Android 6 Marshmallow. Long battery life. The only cons with it is the sound, even it is in full volume you can't hear the sound clearly. I think it is because it only have one speaker compare to Tab A which has 2 speaker."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Good battery life, good build quality, nice fast tablet. Very happy."}
{"rating": 2.0, "product_id": "B018QAYM7C", "review": "Bought refurbished. It is very slow and the charging cable does not connect properly. You must fiddle with it to get it to work and then not move it. It takes about 12 hours to charge. I guess you get what you pay for."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "(3.75/5) I am writing this review from this tablet. I bought this tablet mostly to use as a comic book reader and for some Internet browsing while on the couch, in bed, etc. My primary device is a gaming desktop computer and I don't always want to be tied to my desk, and I felt my phone wasn't completely adequate for the purposes I mentioned. For my uses I would say it is a very good tablet. It has a nice large 9.6 inch screen, and the colors are bright and vibrant. The overall construction of the tablet feels durable. It has a nice heft to it and feels solid and sturdy. Performance wise it seems quick and responsive so far. I haven't had issues with lag with opening apps or scrolling. I've played a bit of Fruit Ninja and Terraria and both ran smoothly. As far as playing videos it seems serviceable. I tested an episode of Narcos on Netflix and some YouTube videos in 720p, as the resolution of this tablet is 1280x800, and the image quality was as crisp and clear as 720p allows for anyway. Battery life seems to be good so far. I have been able to use it for several hours of reading and Internet use without having to charge the battery. It's also upgradeable to Android 6.0 out of the box, which is a definite plus over some other similarly priced tablets.\n\nNow as for the negatives, as I stated earlier the resolution is 1280x800, which I feel is a tad bit low for a tablet with a 9.6 inch screen. Another reviewer had mentioned being able to see the individual pixels that make up the display. I would say 90% of time, in my uses so far anyway, this has not been an issue. But sometimes, depending on the color composition of the image you are looking at you can see the pixels. Another thing other reviewers have pointed out is the sound quality. It does have only one small speaker, and it honestly doesn't sound all that great but I don't think it's as bad as some other reviewers make it out to be. In my opinion it's about what's to be expected from a low-mid range mobile device such as this. It has a 1.2 ghz Snapdragon processor, and for my uses so far it's been fine, but I could potentially see that being a little slow for some users. I also feel I need to mention that I was able to get this tablet as part of a combo deal where I was only paying around 170 USD for the tablet. For the price I paid I think I got a good deal, but I feel it may be a bit overpriced not on sale/part of a combo deal.\n\nFinal thoughts: For my purposes (comic book/e-reader, Internet browsing, and a bit of light mobile gaming) it works very well. If you're planning on using this tablet for listening to music or watching videos/tv/movies a lot, I would maybe recommend also investing in a decent Bluetooth speaker, as the sound quality does leave a bit to be desired. Also another reviewer mentioned something implying their on screen keyboard didn't work until they set it up, mine was working fine right out of the box. Finally, as I mentioned earlier this is a secondary device for me, and for my purposes it works well, and if your needs are similar it would most likely work well for you also. But if you're looking for something to be your primary computing/entertainment device I would maybe recommend spending a little extra on something with a little more computing power, higher resolution, and better sound quality."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Disappointed I can not text from tablet. Other then that happy with this tablet."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Price right for this tablet . but tablet is super GREAT . I did right thing I order tablet case and SD card I can store all my picture in 64 GB SD card . music, move  and my work"}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "I would give it a higher rating except for the picture quality sucks. It's like looking at negatives. Other wise it's not a bad tab for just reading."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "I've had a Samsung phone before and this is just a glorified version.\nAs another reviewer stated , the sound is tin can quality. Watch movies with headphones on.\nI've gone online to forums  to find out why my brand new tablet was acting strangely and how to fix it.  Apparently it's a third party app that the tab can't handle.... That's nearly all the apps my I use and I'm not a gamer....\nThe only solution that would work for some people was to 1. Uninstall one app at a time until the problem is resolved or 2. Factory Reset.\nSeriously?\nAnyway, I returned the first one and am now on the 2nd.\nSave your money and get an iPad.\nI give it three stars because it meets my minimum requirements for a functional tab. Start, save my stuff (evernote), pay bills, play music and movies, and shut down (which it does sporadically well with the help of some rogue 3rd app it can't stand).\n\nUpdate:\nShutting down sparodically is unacceptable.  So is slow response time.  For a working tablet, it must allow up to 3 applications minimum to run in the background at one time.  This tablet couldn't stand that much work.\n\nReturning this as well.  Get an Apple device (hate to say it <sigh>) and stay away from Samsung as far as Androids are concerned.  I'm sure there are better Android tablets out there....just haven't found it.  Meanwhile, I will be moving to a laptop."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Had to get user manual on line. One with tab not in English."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "A great tablet for the price!! Excellent battery life."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Galaxy Tab E is a great ipad. The screen size and brightness make for easy viewing."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "birthday present for my son, he loves it"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Love it"}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "This thing is a piece of junk. Has to do multiple updates before you can even begin to use it. Screen is low Res (think 7 years ago screens). Processor runs hot - back and from of tablet are very hot to the touch. Then once it's running it lags.  Going right back."}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "it was good, i like samsung, however, it came with no keyboard selected and before i discovered this i spent many frustrating hours trying to get started."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "Volume is really low..not sure if I got a defective one..extremely disappointed"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I love this tablet!  Very user friendly and has a great look & feel.  I wish had purchased this tablet with more memory, it is offered with 32 GB's.  I have used over 50 percent of the internal RAM just running the basic apps.  Still I love the look and feel of the the tablet and will probably buy one with more memory when I find it at a good price."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "love it"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Totally love this tablet great choice"}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "A lot of good apps are not compatible. Facebook displays fotos and videos in half."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Just what I was hoping for as a gift for my husband as he is using it daily."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Bought this for my mother to play facebook games and watch netflix. Touch screen very responsive and accurate. Easy to see because of the size. This is an amazing tablet. Plays RPG/Action/Puzzle games perfectly. Netflix and Youtube work great as well. Sound quality is a bit low, as to be expected. When watching movies she just plugs in my razor headset or basic ear buds. Both work with tablet very well."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Outstanding value.  I was a bit reluctant to buy a refurbished unit, but the savings were great and the unit was like brand new."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Had this tab just over a month and it just refused to open. Could not reset it with the help of Samsung support and they could provide me with no answers as how to get this up and running. It was a nice unit for the sort time it worked but no one can explain why it just shut down like it did. Even after a hard reset, it still would not run because it would not accept any password or password changes."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Solid tablet. I have been using it a lot in the week since I received it. You get the things you expect from a Samsung device in this price range, so a handful of good stuff. I am going to focus on the few features I didn't like (but acceptable) for those on the edge of a purchase.\n\n1. Feels heavier than I expected at 1.2 lbs\n2. The buttons on the left side of the screen while holding in landscape I am constantly touching these buttons, interrupting what I am doing while holding the tablet naturally. These buttons are poorly placed for a small device that is this heavy. Very annoying.\n3. As others have said, the sound is terrible on the single speaker in the rear of the tablet. Have a case on it? You can't hear it. Lay it down on anything. You can't hear it. Use it as you would normally and without a protective case? You can barely hear it. If you buy it, invest in some Bluetooth speakers & headphones.\n\nI can live with these items and their existence is the only things preventing a 5-star review."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I LOVE my Galaxy !!! So glad I bought this. My HP is a dinosaur compared to this baby."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Love it!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "works great"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Love. It"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "excellent"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Bought this as a gift for my disabled brother who can't sit at a computer comfortably. He loves it. Set up was easy, he can do everything he did on a PC and more."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "I'm so disappointed. I've been using Nexus tablets for years. I don't need them to do a whole lot. This looked like a bargain and perfect for what\nI use it for. However, after set up it seemed like some apps weren't fully available. I would get parts of a crossword app but could never get to the\nfront page. Backing up became a problem. After only owning it for 3 hours I did a factory reset. They it stopped functioning altogether.\nSame thing with another  tablet I tried recently. You can hook it to your wifi...but a step or two later...it says it cannot connect to server.\nThe arrow at \"Confirming You Connection\" spins forever. Price was too good to be true. I guess I'll stick with Nexus"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Bought as a gift for my mom and she loves it."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Exactly what i wanted.very pleased"}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "Editing my review:  still having constant problems. Either freezes up and has to be rebooted, most times with the \"special\" button sequence. but even more frequently it just randomly reboots and whatever my husband is working on is lost. He totally regrets this purchase and is looking forward to an iPad for Christmas\n\nOld review:\n\nI'm mainly writing this as a record of the problem we're having after 1 week. My husband was watching a YouTube video when he suddenly couldn't stop it. it finally stopped mid-video on it's own then was totally non-responsive - locked up.  Tried to re-boot and it went off then wouldn't come back on - at all. Searchedthe web and found others with same problem and tried several fixes. The one that worked was to plug it in and hold the on/off button and volume button at the same time for 15 seconds. Did this a few minutes ago. If this happens again, we are returning the unit as defective. Otherwise he seems to like it as an inexpensive alternative to the iPad for someone who mainly does email, FaceBook and surfs. I'll update, especially if it goes out again."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "It was time to replace my old tablet and this one is perfect."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Works as advertised, just like all my other Samsung products. Fast loading applications, solid connectivity and build. Love it."}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "Data download speed is very erratic.  Mostly slow.  Typically 10% of what my old Nook does in side by side comparison..  I tried support online and telephone.  May as well talked to my 5 year old grandson.  Same level of competence.  If I restart or change DNS settings it will often be very good for one or two tests then back to slow.  I like the rest of it however."}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "I like the tablet but the charging cable I recieved was faulty and it would not charge correctly with the three other cables luckily I found an old flip phone charger that would work with the tab the tab is nice but it's no good if it's dead I don't know if anybody else had this problem but I wanted to let every body know about my experience"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "The one I got was refurbished, great price, has a few scratches on the back but otherwise fine. It also came running some Arabic looking language but poking around on line I figured how to reset that and all is well since then. This is great and fast for what I do which is check email and browse the net. Very fast at those things and the screen looks great to me. My wife has an iPad 2 and the screen size and weight are about the same, resolution is also similar to my eye."}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "I like it, but it's just not as great as I was hoping for."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Very happy with this purchase.  I  primarily used the tablet to check email, surf the Internet and read an E newspaper etc.  For these uses and the price of the tablet it works well."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Nice easy if you have a Samsung phone"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I really enjoy it! It's fast,  no problem opening several windows at the same time!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great tablet, very dependable, perfect size, excellent photos."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "This is a great tablet! Samsung quality at it's finest. What prevents the 5th star is the fact that it only has a little speaker on the backside but when used with a headset or bluetooth speaker, it sounds great!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Wife really enjoys it."}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "good all around tablet. The screen resolution is very good. It loads quickly and have had no issues with memory. Mainly use it for watching Netflix... the sound quality is junk! The speaker is on the rear facing away from you when looking at the screen. What a horrible design for a speaker. My Samsung cell phone has way better sound! My boys Kindle has better sound. We had to buy a Bluetooth speaker as well as a Bluetooth stereo headset to make it usable. I give it 1 star for turning on, and 2 for the picture. Had to take 2 stars away for almost having no speaker."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "It is ok"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Really enjoying my tab"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "It's not too big but still has a great display. If the WiFi is good it streams at a decent rate as well as browsing. I attached a blue tooth keyboard that makes it slick to work with. I haven't had this device very long ergo only the 4 star rating"}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "This is my first tablet and I have used it to surf the Internet and nothing else, I find the tablet screen is fine and every thing functions well except for the keyboard. It is much too sensitive. I type e and I get eeee or sometimes passing over a key without even touching it  types out the letter, some times I type t and get eth or some other letter combination. Sometines  the keyboard changes from lower case to upper case for no apparent reason. It makes typing a real pain."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "perfect product. Thank you for shipping on time"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "i love it and it met all my expectations"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Overall good machine. Could use better quality speaker. Front camera not good pictures either. I would buy it but not if it for music."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Very satisfied."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Like several reviews indicated, the sound quality isn't the greatest.\nI had no problem connecting to Wi-Fi while traveling outside of the States.\nA great tablet for traveling with a adequate size screen.\nWith 16GB capacity to hold all the photos you could take on a trip. .\nI recommend this product."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Bought this tablet a few weeks ago during prime day at a discount and so far it's been great for a budget tablet.  build quality is okay for the price point as you really can't expect much as this is one of the cheapest name-brand 10\" tablets around with decent specs.  battery life also seems to be fine with no known issues.  as for 2 days ago, the latest Android 6.0.1 marshmallow became available to download the usability of the tablet feels even better now."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "works as expected no issues"}
{"rating": 2.0, "product_id": "B018QAYM7C", "review": "I bought this in February 2016. The charging port lasted about 4 months and then it would charge extremely slowly, like take two days for a full charge. I've used and older acer and there are two ipads 2's in the house and their charging ports still work fine. I think it is a poor design to have it fail so fast even though I wasn't rough with it. The tablet itself worked fine. I sent it to Samsung's service centre, who said it wasn't covered under warranty because it was damaged by the customer but it would cost $315 to fix it, or I could have it sent back for $35...$315 is more than what I paid for the tablet to begin with so I had them send it back  (this particular service centre is in Canada and has very poor reviews..). Still haven't gotten the tablet back either..I will try to find a way to fix it myself I guess, and only buy Apple tablets and phones from now on. Although I did call a local cell fix it place and he said the charging port is actually attached to the motherboard so it's not an easy or cheap fix. If you buy one, expect to have the charging port go unless you are extremely extremely careful with it. Never again Samsung."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Very easy to use. Was a good buy."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Excellent in all aspects except for screen resolution.  It can be a little tough on the eyes, but it's better than we had available, anywhere, a few years ago.  So if you don't notice it, or mind it, it's a solid tablet.  It's got a great feel to it while being held.  The main camera is great.  Good tablet for kids."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "I purchased this tablet for myself. I looked through hundreds of reviews before deciding on this one. It had the most positive reviews. I wanted a tablet that had a similar operating system as to what I am used to this one is almost identical to my cell phone.\nThe size is great. The screen is just large enough for my hand but not huge.\nMy only disappointment is the battery charging time. It takes a long while to charge up which is fine if I am not going to need it for a half of day.\nOther then the that, great product.\nDefinitely would recommend and buy again if necessary."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "This samsung galaxy tab e 9.6\"16..."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Positive: big screen, fast, and long battery life.\nNegative: doesn't fit in back pocket of levis, speaker on the back of tablet, and micro usb on top of tablet."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Love it, Easy to use, Long battery life."}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "Disappointed to discover this tablet does not include a gyroscope nor a magnetometer.  I am unable to use many of my favorite apps... Stellarium, Sky Map, SkEye, eCompass.  Samsung cheaped out on the sensor chip.  Other than that it's a great little tablet."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "It was a gift user is happy wit it"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I Love it. I can navigate on android OS much more easily than I every could ios. The screen is huge and it's not loaded with all the junkware that is preloaded on most devices. Having office is pre-installed is a sweet plus"}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "Just got this tablet today and have spent about four hours with it. I'll update the review later if there's more to add, but here my thoughts about it for now:\n\nI've had a number of tablets before this one, and here the screen is rather poor. There resolution is such that you can see the horizontal lines the images and text are composed of. I got the tablet for a very low price, but because of the screen I'm considering giving it away to my kids. There sound quality from the lone small speaker on the back of the tablet is also sub par.\n\nBut the tablet is responsive and not glitchy, so it has that going for it. I would not buy a T-shirt like this again."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "At least I think I like it...I'm still trying to figure out how to use it.  This is the first time I've purchased anything except my pc and a 'clam' wireless phone. Hey, I'm 80 years old, so what do you expect?! The one feature I don't like is the screen doesn't show a whole page (think Facebook). It's too aggravating for me so I stick to my pc. I am looking forward to getting more use out of it eventually."}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "My total cost for my first tablet experience (this tablet) is around $300 including leather cover with an integrated keyboard, 128GB SD-card, shipping, stylus and a few nice-ities purchased elsewhere.\n\nI'm comparing my experience with this device to my wife's older 10-inch tablet since hers is the only tablet here similar in size. This Tab-E has a few advantages for me over her older 10-inch tablet: newer OS, larger SD-Card support, more cores, superior stability. Her tablet is superior with a stronger speaker I can hear all the way in our family room from the bedroom--whether I want to or not, hardware menu key that actually works as expected, and costs half the price of this tablet.\n\nI absolutely hate the lack of a hardware menu key on this tablet. Makes it impossible to access menus of apps I already own that do not provide an onscreen app menu key (the three dots in upper corner of newer apps). The Tab-E's physical menu button opens a task switcher, not accesses the app menus of older apps. Must use a Windows keyboard and its feature menu to access the menus of Android devices. Lame. A work around is to enable accessibility menu feature. This puts a floating menu button on your desktop. May block portions of your app since is 'floating.' Between the three of us there are more than six tablets. This is the only tablet lacking an in-app menu button. Dumb design. I've read this is Google's decision. Is the future for everyone. No more app menu buttons on devices. So either carry around a PC keyboard or deal with a floating button covering portions of your desktop :(\n\nSomething weird with the mid ranges on this tablet. Must use headphones or external Bluetooth speaker to clearly hear audiobooks, esp if there is competing noise. The fan on my desk totally drowns out the built in speaker. In hindsight music is loud and clear. Pristine clear. So it seems to be an audio range issue.\n\nNo HDMI.\n\nScreencasting only works with other Samsung devices. Must spend another $60-$100 to buy an external Samsung supported HDMI Screencasting box. Then you can display your screen on any HDMI TV. Looks like I gave away my Chromecast to my son living on his own just a little too soon. Grrr!!!\n\n**The major strength of this tablet is *stability*. Still hasn't fully crashed or totally locked up once. For that I give it five-stars. More reliable than all other tablets here even my sons larger (and more expensive) 12-inch 'pro' Android drawing setup. However two apps on my Samsung Galaxy Tab E 9.6 act 'crazy' once in a while. FB Reader and Moon+Reader randomly black out the screen and lock up the screen and keyboard from responding. I have to use the 'close all' menu to get control of the device again. Wow. Finally a use for that dumb 'menu' button :p\n\nAm I happy with this tablet? Not entirely. If I bought locally or from a TV shopping channel that allows at least 30-days to test items I might have returned it and bought something cheaper. Probably would have. My frustration level was off the charts. Then again there's something to be said for reliable performance. If performance wasn't so awesome I'd have total buyers remorse. I'm glad I did not return it. Just dislike the lack of a physical app menu button and having to deal with workarounds.\n\nCheaper tablets might have in-app menu key but you could be giving up reliability to get it. If your apps do not have onscreen menu buttons (the three dots) be aware this tablet might not be for you...unless you don't mind toting around an extra non-Android keyboard or enabling accessibility features just to access app menus."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I bought this for my wife's birthday, but messed around with it first.."}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "Purchased a few months ago from Bestbuy.com.  Its a wonderful affordable tablet for your average income individual.  The nice part is you can expand it with a micro sdhc card maxing out around 64 gb.  Which is good if you purchase the 16 gb tablet which would otherwise be useless.  Its personal preference but I would highly recommend this tablet.\n\nPros:\n\nAffordable tablet and not apple.  Im switching away from apple due to a bad experience with a free phone.  Im finding Samsung is better rated than the cheaper tablets out there.\nDecent sizes to choose from.\nCan expand with micro sdhc cards up to 64 gb depending on model.\nHd resolution which offers good details for movies.\nFor personal use you can rip your own movies into mp4 video formats.  Rather than buying multiple copies of the same movie.  You have to figure out how to do this on your own.  Plenty of software on the net.\nI have a mild disability and require repetitious environments.  This tablet works wonderful and allows for modification.\n\nCons:\n\nCamera isn't all that great.  Being a professional photographer the video displaying the picture is very grainy.  In addition to the fact the end photo isn't much better.  I honestly think their slapping video cameras on every thing to spy on you.  The only safe way to have a secure private conversation these days is to unplug the battery from your phone.  Most devices these days won't even let you remove the battery from the device.\n\nIt takes 6 hours to charge the battery.  Samsung says this is normal.  I found it takes an hour to charge 10%.  Nothing running in the background.  All extra settings turned off.\n\nThe usb wall charger can get extremely hot while charging.  Been burned lightly with first degree burns while unplugging the charger or while using the device as its charging.  I would highly advise you not to leave the tablet unattended while charging.  Apparently this is normal for their devices.\n\nThe multi view and back buttons need will drive you crazy as your hands/fingers will keep taping them.  Samsung needs to give us an option to disable them like they do on their phones.  The only way to disable it is to hack into the programming it to turn them off.  You don't really need them.  Their wasted buttons.  The only buttons you need are the on/off switch and close button.\n\nYou need an email account with google to operate the device.  Wake up people google is just a mass collection website for the government like facebook is.  I highly suggest to create a bogus email on the device to just use on the device alone.  Dont give away your information to google.  I enjoy using startpage.com including their email.\n\nNot everyone realizes the health issues associated with tablets.  The signals coming from the tablets might result in the following symptoms:  insomnia, heart issues, mild seizures, cell phone radiation, and so on.  Dont believe me?  Do your homework.  I have a lot of lessemf.com products for this reason."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "We are having problems with charging this tablet. Who do we contact or how do we get this resolved?"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "WORK REAL GOOD ,GREAT PICTURE AND EASY SET UP AND OPERATION."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "It fit the description"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Very easy to use"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Love it!! This is my first tablet and it works smoothly."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I am enjoying the tablet"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "This is my first tablet, so there is a learning curve on my part. I haven't spent much time using it as it is not my \"go to\" item for going on line. The one thing that has surprised me is how quickly the battery looses it charge when being used, even in energy saving mode. May update this review later."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Everything you would expect from Samsung."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I have a Tab 4, and this tablet is better. Much faster."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "My review for the seller is great!  5 stars...my gripe is with the tablet.  Im used to using the Note Series so not having an S Pen for me is hard.  But I knew that when I bought it. I wanted a designated book reading tablet and this one looked great in the ads. Upon purchase it was a lot heavier than I thought in the screen Clarity just isn't there for a Samsung device. I'm used to the 4K Super AMOLED screens. With that said I'm reselling this tablet and I bought the tab S2 and am very happy with that."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "Item was defective. Screen keep going dark ( like when you are not using it). Only it goes out after 2 seconds.\nI return the item and refunded minus 10%\nRestocking fee.  No replacement was offered."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Still learning to use product. Excellent so far."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Good item as good or better than expected"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "The product very good. Expensive shipment."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great tablet for me on the go.love All Samsung products\nIt's the perfect size .No complaints"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "can't put it down...wife wants one now..."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "We bought this and some accessories (I.e. head rest mount, 128 gb micro sd) for a 13 hour road trip with my 12 month old daughter. This thing was a life saver for keeping her occupied and entertained for the majority our the trip. We just put some movies on it and away we went. The size and clarity are great and if you already have Samsung phones then it will sync with your account and auto add all of your apps. That made for a quick setup. I love having access to both google and Amazon apps. The price was nice too, considering other competitive brands. Even though it feels sturdy all the way around we also but a glass screen protector and leather case. The reason why it didn't get a fifth star is that if you set up the device with a screen lock then it is a permanent option. There isn't a away to deactivate the lock option once it is set up. It was a nuisance having to type in a code or pattern every time the device went to sleep. I hear if you want to wipe it clean and do the setup again you can decide to opt out of the lock. Other than that this was a great purchase and I would recommend to anyone. Other brands week never get my business until they install a micro sd slot to expand storage. Thanks Samsung."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I bought 2 of these. For an 11 year old and 7 year old. I really like the parental controls. I also have the ability to disable anything I want like chrome or other browsers.  The settings are easy to navigate. We use it for games and tons of Netflix shows and movies. We love it!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Bow had some cosmetic damage, but the product was in perfect condition. But that's what you expect with an open box deal. Very happy."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great product!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "My husband loves his, so we bought one for my mother-in-law. Perfect size to be able to easily view, yet small enough to carry with you."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Love it! Can't go wrong with Samsung! Thanks."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Audio is poor!!!!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I never had an android device before as I have always had iDevices. I will have to say this tablet is equivalent to an iPad with expansion microSD up to 128 GB. Imaging how much that would have cost... But this device was only fraction of the cost of a more or less equivalent iPad so I was happy about that. Moreover, as a tablet, you can just move files onto the microSD and the tablet just plays. I don't have to go through another program to sync up. I actually bought this device for my wife originally and she thought I was the coolest husband in the world. When I first got it, I was trying it out as I had some hesitations because I didn't know if the app-store would be very different than the apple store, and thus difficult to use. Luckily it was just as easy to access. So all in all, I am very happy with this purchase. I do suggest you get the microSD card with this though."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I am very happy with this tablet.  The only other table I have used is an ipad...I like this even better.  The larger size makes games easier (I am 68 so the eye sight is not what it used to be)!  The variety of games through Samsung is amazing.  I am adding new ones for me and for my grandson on a regular basis!"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Nice product"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I'm glad I waited for this product....it is fantastic.  Highly recommend it."}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "No usb plugs but great othrwise"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great tablet.  Super fast and just the quality I'd expect from Samsung! Galaxy Tab!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "It does what I wanted, it well made and the price was right."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Really fast."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Amazon mothers day gift she loves it"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I expected to receive a non-functioning refurbished tablet, or at least one that would stop running in a day or two.  I was pleasantly surprised to see the unit appeared to be good as new.  I've had it for two weeks and use it almost every day and it's working fine."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "It works as advertised.  I paired it with a Belkin bluetooth keyboard formerly paired with an iPad Air (First Generation) which couldn't be repaired by Walmart repair facility. (I received a full refund of my money)  I've noticed that sometimes the bluetooth connection doesn't always work.  Possibly this is due to the keyboard battery needing to be charged, although the activity led comes on.  Without the keyboard, the tablet works as advertised, although I find a still prefer a 7\" tablet to hold in one hand.  A 9.6\" tablet is not a laptop & doesn't easily connect to cat-5 or full-size USB devices.  (conversion devices are needed)  I have found cheaper prices for the same model, but of course, that was after I'd paid for this one!!!"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Just getting started with it, so far all is good"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I'm on this right now! It's the very best!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Really liking it."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "The Samsung I have performs admirably, however I would prefer more volume from the speaker."}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "Just arrived! Sleek, stylish, fast, light, and perfect screen size...as expected from Samsung. And as expected from Amazon, they lowered the price by $30 two days after I had ordered it! Not cool, Amazon!\nWill add more about the tablet later...and will reconsider buying anything from Amazon again if this is how they run their business."}
{"rating": 1.0, "product_id": "B018QAYM7C", "review": "It's nice and big. Gets heavy.  Unfortunately it's slow and the sound is awful. You can barely hear the music. Pics are blurry and grainy. Not a good purchase at all. Don't waste your money."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Public wifi occasionally touchy; unsure whether issues are device's or router's."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Love it."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "i luv it"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Has everything I need, and some included features that were very nice."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "9.6\" is actually nice size. Great basic tablet. I could not pair it with my phone over Bluetooth (yet). I am hoping to see 6.x update pushed out, it's going to be mid-year after all and hope it improves functionality.  Added 128GB EVO Plus microSDXC.\nWish it came with:\n3GB RAM\nTouch ID fingerprint sensor - it's 2016! and every device should by now.\nMore apps optimized for different size devices and resolution and side-by-side, work in landscape mode etc."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Could have had more features!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Works better than we thought!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Good all-around performance  and features."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Just got it to control my DJI Phantom 4 drone. Love its many capabilities and the size and sturdiness of it not to mention the price point. Highly recommended!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I love this tablet!"}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "It is OK. Not as good as the ASUS I had previously."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Love, love, love this tablet. Bought this for my boyfriend as a birthday gift and he loves it too. Functions just like a Samsung phone."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "as expected"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Love it. Exactly what I needed. Graphics aren't the greatest but it saves on battery which is worth it."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "much improved over my old Samsung pad"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "These are my impressions on Samsung's entry level but nevertheless great tablet in my view as I move into my daughter's 3d month of experiencing it :)\n\nTHE LOOKS AND FEEL\n\n\"It's a giant phone!!\", our daughter said after playing with it for the first time. And she's probably right because, once stripped down to its Android foundations... what else is there?\n\nI was impressed by this model's low weight and thin build. It's not 'the lightest' or the 'thinnest' for sure but it feels good and easy to handle and it looks and feel like a quality product which is 'something' given that it was never meant to be 'top of the line'. The back is very much fingerprint-proof and by the way, Samsung made it easy to attach covers, especially if they are made by Samsung but I believe that you can get away with third parties as well even though I haven't tried one myself.\n\nPORTS, EXPANSION\n\nStarting with 'expansion', you can add up to 128GB through the MicroSD slot which is very much as high as you can afford these days. There's also a micro-USB port and, of course, it supports Bluetooth, Wi-Fi, the works. Oh, and there's an audio out jack as well.\n\nWHAT YOU SEE AND HEAR\n\nYou are not going to get super-high-resolution with this device but if your main use is, let's say, playing videos 720p, it's good enough. The 1280x800 resolution translates to 157 ppi which is not bad at all when coupled with the quality of the display. The screen is surprisingly readable even under bright light. I love this tablet's colors with it's super-deep-black blacks and bright whites. Reading angles are pretty good. There is no auto-brightness sensor but, again, you're not paying a lot for this gadget.\n\nSpeakers... it depends. They are great for a tablet and there's pretty good separation but I still prefer 'big sound' which, by the way, pipes out easily through either Bluetooth or the audio port.\n\nCameras again, as expected, lets you take great pictures and shoot videos with vibrant colors and good stereo sound.\n\nOPERATIONS AND OS\n\nI like my set my tablets as close to 'standard' Android as possible. It's not always easy and not everything can be deleted but I was able to at least hide out of sight everything I didn't want. As a near-standard Android 4.4.4 device, I couldn't be more pleased. However, I can't say much about Samsung's own enhancements because I don't really use them.\n\nRATED 'GOOD'\n\nI love the good screen display, the overall feel of 'quality', the efficient Quad-core 1.3 GHz processor, the adequate 1.5GB of RAM and its ease of use. I can't think of anything terribly 'negative' to say other than it not being 'tops' so it's an easy '4 stars' (I like it) for me."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great tablet at a pretty good price.  Only one thing I don't like and after researching so many tablets I think I got confused which ones had which features, so it is my fault.  I was disappointed when I received the tablet that it does not have an HDMI port so I can not connect it to my TV or projector.  Other than that it is a very nice tablet and runs very smooth and fast!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Amazing battery life very light has multi view"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "My grandson is enjoying his tablet."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "i bought this tablet 3 weeks ago from barnes and noble (with a trade in offer for my 5 yr. old nook tablet) and i love it.  not only is it a great reader (i immediately downloaded the amazon kindle app, so now i have my libraries from both nook and kindle in one place), but it is a peppy tablet perfect for checking emails, pinterest and facebook while on the go.  i would recommend it to anyone looking for a great tablet at a reasonable price."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "This is the same model Barnes & Noble sells, as their nook. Being a Samsung tablet, it works great! This was purchased as a replacement for my wife's Color Nook, which was getting long in the tooth, well worn, and finicky. Not only is this a great reader, it is a great tablet."}
{"rating": 2.0, "product_id": "B018QAYM7C", "review": "The tab is a great but the speaker. It only has one small speaker on the back. It has poor volume  and sound"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Perfect for my son he love it with Microsoft Office"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Great Tablet, I'll  give it a 5 star rating!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I am very satisfied with the tablet, is faster than other tablets that I had"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Love this tablet. Bright screen, love the Google Play store and just the right size to play games, watch movies, Netflix, etc. Only minor drawback is the speaker which is less than stellar. Very tinny. Other than that I would definitely recommend!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "We got this tablet to use with our treadmill and it works great.  We use it with our Comcast internet and cable service to play videos while we exercise."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Brought for my husband - no complaints"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "Very good tablet for it's price point. You won't be disappointed."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "love it."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Finally a tablet that works. Seems to be as stable as the kindle fires. Well worth the price compared to the cheap knock offs, only complaint is that it does not recognize Disney story time theater books, but that's Disney's fault for making such a horrible product."}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "I am OK with it. I did not receive a manual with it so it has been difficult, to get through. The pages shut off too quickly, and I am constantly having to retrieve the page  I was working on."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I purchased this for a friend who had a Nook & a Kindle Fire and she LOVES this!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "It is a great product."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "This is my second Samsung tablet and I just love it. I wanted a larger tablet with more memory. I bought a 64gb sd card but you can go up to 128gb. The set up was really easy. Most of my apps were imported from my other tablet so it only took about 20 minutes to set it up. Having Microsoft Office and Skype preloaded were an added bonus to me.  Yes the sound is a little tinny but I rarely use the sound on my tablet so this was not a problem for me. I use my tablet for playing games, surfing the internet, social media and now I'll be using it for my recipes. This is just a great tablet. It exceeds my expectations and the price was right."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Excellent"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "This is a really good tablet for the price. Not the best screen resolution but it works really well."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "This is a great tablet to have for just anything. I bought this for my daughter for movies and shows for when we are on the road."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "I went looking for a tablet after going back to school and discovering that real textbooks are nearly extinct. This allows me to have a textbook (or power point, notes, anything) open while I work on my laptop. It's also much easier and comfortable to read from the tablet. I'm not expecting this thing to perform like crazy, but I certainly haven't had any issues or complaints. Love that it comes with the mobile Office apps preinstalled. If you need to use those apps, I highly recommend a bluetooth keyboard. I noticed some reviews complain about a lot of bloatware on it out of the box, but I really don't see that. I have a Samsung phone and that came with 5x more crap on it that can't be taken off. This really just has the basics. I've installed a handful of apps and have a few files saved and I have 7.6 GB of available space currently. A big bonus is being able to use an SD card with this, though, if you want/need to store larger files."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Muy buena"}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "great, but you have to press hard or twice on the screen."}
{"rating": 4.0, "product_id": "B018QAYM7C", "review": "I own this and a tab A 10.1\" - this is not a bad tablet but for twenty dollars more the tab A is a much better tablet - the tab e has slow screen touch response comparitavely - also the speaker in the tab e is complete junk"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "First of all, I didn't find out until it arrived that the Samsung Tab E does NOT have the Quick Connect Screen Mirror option to connect to the TV, but that is fine since there is an app for everything these days. It also only connects via wi-fi for those interested. Otherwise it is a great tablet with crisp resolution, runs fast, came with 1/2 battery charged and my daughter has been playing on it for hours now. It is perfect for her needs and now I can have my phone back. Lol!"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Fantastic tablet"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Much better than the one I broke.  Larger.  I will say that bit is a little too sensitive.  Often times i don't have to actually touch the screen for it to do something, not necessarily what I wanted."}
{"rating": 3.0, "product_id": "B018QAYM7C", "review": "We bought this mostly for our young daughter to use.  As we don't own any tablets, I thought I might use it.  I don't, it's pretty laggy and slow.  Fine for a 1 year old to watch cartoons, etc, but not good enough for my use IMO."}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "My son loved it and uses it every day"}
{"rating": 5.0, "product_id": "B018QAYM7C", "review": "Got this for work. Just what I needed"}
