{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "It work wonderful"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Lol"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "i receive today cant get going , call samsung they are useless"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "this is a nice tablet,  I love Samsung products,  in fact I bought a second one for my nephew,  he loved it."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "These are lame specs, both for this and the tab 7 not light.  8 gbs really?"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Perfect kid tablet, fast enough for YouTube kids & play lego games"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Still in great working condition after a year"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Very good product nothing issue after a one year to used that."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Perfect"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "We got this tablet for my son a few years ago and it honestly has been a great tablet for him through age 5 through 9. This tablet is a thick plastic and doesn't break so easy from our experience. My kid has a tendency to be clumsy and throw the thing from time to time, and it has never gotten cracked or chipped -- until now. He dropped it right on the cement face down. But still, I've been extremely pleased with the sturdiness of it. We've had it for years!  Now that he is older he can't do everything he wants and it is time for an upgrade. This little Samsung definitely beats a Kindle anyday."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "The power input on the tablet fried in 2 months."}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "Buenas tardes,\n\nCompre est tablet hace unos meses atrs y la enve para Sto Dgo, Para mi hijo, se la compre de cumpleaos...Resulta que en menos de 3 meses empez a tener problemas, ya que se le Frisa mucho y la carga no le dure, en pocas palabras, no me siento bien con esta compra..\n\nSaludos,"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Excellent purchase"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Me encantan son bastante rpidas y batera de larga duracin"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "I cant use.\nHorrible."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "love this."}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "A lot of storage problems even though I have a SD card. Everything seems to download to device instead of SD"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great product at a low cost"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "The graphics is really poor but is goodd"}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "mine has battery issues. Also is really slow on processing power."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great quality"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "gave as gift"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "The Samsung Galaxy Tab E is like having a computer in the palm of your hands."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "The product was here on time and looks great. My son loves it."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Good product. I got it at a great price too."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "After just 6 months this thing is slooooooow. 2 adults using it to watch YOUTUBE occasionally some Twitch too but not much downloaded on it. Get what you pay for....one of the worst purchases I've made, this thing is TRASH"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Love it! It was perfect..stays charged."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Super upset. This was a bday present and was given Feb 24th altho it was ordered in October. So it's been in use now only 4 months and it won't turn on. Tried all of the troubleshooting and still doesn't work. No support help or return /exchange available. Ugh. I won't ever buy Samsung again !!!!"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "product started messing up June 2018 less than 4 months after purchasing. Wont turn off."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Very Good"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Grand son loves to play ABC mouse on his tablet."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "love it"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "No se ve muy bien pero para q juegue un nio pienso q esta bien x el $q no salio tan cara"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Very clean works great....the kids love it."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "If you are looking for a Tablet which will give you the error message unfortunately the process com.android.systemui has stopped on a daily basis, then the Samsung Galaxy Tab E Lite is for you. Do not waste your money"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I bought this for my 5 year old because he watches YouTube videos like his life depends on it. This tablet was easy to set up (less than 10 minutes). and the battery lasts quite a long time 5 hrs at least of non-stop videos. The screen looks great. I used a tempered glass screen protector for it. We also purchased a child friendly case (because our 5 year drops things like he's paid to do so LOL). Overall, it's a great little tablet. Highly recommended!"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Muy lenta..."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Shipped fast, works great!  You would never know it was refurbished. Looks brand new."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Was great for my stepdaughter until it totally stopped working after six months. Got it for her as a Christmas gift and stopped working in June."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Stopped working. Only had it since January"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "Good product for the price.\nI think the quality of the screen could be better"}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "Very slow loading. Could not insert memory card. Crashed periodically."}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "I have an iPad, but had to get a second tablet and was not prepared to spend a bundle.  This does the job, but does not compare to the iPad."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Slow and laggy. I bought it just to play an online game and I hate switching between accounts and just regular gameplay sucks. I hate this thing and went and just bought a second phone to carry around."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Nice tablet for kids"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "nice tablet for granddaughter"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "After having this for 14-15 months the WiFi no longer works. And by that I mean all it does now is connect...wait 3 seconds....scanning for networks and disconnect immediately then reconnect...wait 3 seconds...scanning for networks and disconnect. I just spent an hour plus on chat with their tech support and their only solution is for me to spend $60 to have it diagnosed and repaired IF it's fixable. That doesn't include the cost of shipping it to the repair site in California and getting it back. Basically it will cost me double what I paid for it in the end. Nope. Sorry. Don't bother with this item."}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "I bought this for gift did not come with charger."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "It is awesome!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Very good transaction and great brand. I am using it everyday for personal and business related activities,thanks!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I bought this for my daughter and she loves it "}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Horrible horrible"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great price and Tanks I was looking for"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Good."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Bought for son and he loves it. He's had it since the end of November with no problems. Quite a bit of space plus with a memory card he can download much of what he wants. He is 6 and has managed to keep it in good shape with the help of a screen protector and case."}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "Lite perfectly describes this tablet... very very slow and the touch screen is terrible... I do not recommend"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I got this for  my 2 year old so that he would stop taking his sister's tablet, he loves it . He now can play his own games next to her!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "My daughter loves it"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "For my purposes it is okay. For just $100 you can't really complain either. Kit Kat 4.4 is not a great operating system. It is glitchy and slow most of the time. I have to restart it often. I only need it for a few months and then I am confident I will never pick it up again."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "My son loves it uses it all the time Samsung is a great product."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Looked and Worked Perfectly also Shipped Fast! Thank you Very Much!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great Samsung Tablet, just what I was looking for!!"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "Bought this tablet for my 3 year old son, at the time of purchase it said it was new, which was a lie because it had a previous owner..I only know this because pictures were still stored on the tablet & their log in gmail info. Also it did not come with a charger. Its working good so far though."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Just discovered it can not support an added data plan.  I never would have bought it a year ago, if I'd known, because the eventual goal was to use it with data to accept sales at markets.  Useless now."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "I purchased this tablet for my son after his was stolen, it worked ok the first weeks but he recently told me that the tablet glitches a lot especially when hes playing a video game."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Current apps require version 5.0.  This is an obsolete device.  I purchased a brand new brick."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "The tablet was as expected, like a brand new tablet"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "This works for what I need it for.  I'm a little disappointed to discover the software is too old to support the current version of Hulu's app, but otherwise no complaints.  I bought as a last minute purchase before a road trip to download videos for my son to watch in the car.  Worked great for what I needed.  Now we can use it around the house.  My son can use it to call me throughout the day via Hangouts.  Not top of the line, but worked for my needs."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Worst product ever, it didn't work well from the begining. Don't buy it"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I wanted to buy something that resembled Galaxy Tab 4 and this has been everything i asked for.\nMy 4 year loves how easy it is to handle and use, easy downloads from educational apps to fun games. Overall im 100% satisfied :)"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "buy this is very good price and quality I recommend it."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Tablet is slow, freezes up, doesnt have full ansoid features,, a lot of newer apps aren't optimized for it"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "My daughter loves the tablet but it has been glitching for the past 2 weeks where it goes inyo a loop of flashing screens. It will die and when i recharge it it works for a hour then does it again. Hopeing to get it resolved with Samsung."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Great!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "So far so good.  I have only had it for about 2weeks.  Easy enough for my 2year old daughter to use which is who I brought it for.  I just haven't figured out how to put parent control on it."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Very slow.  Not satisfied.  Freezes up."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Excellent product.  Samsung beats Apple."}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "IT IS OVER HEATING AND I HAVE TO TRY TURNING OFF BUT TAKE LONG WHAT CAN I DO"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Love this tablet"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Bought this tablet for my daughter for Christmas 2017. It is now April and we have had no issues with it. Samung tablets are the way to go."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "This review is only for Amazon product descripcion/specification, this table have 1GB RAM, not 2GB of RAM, bad info from Amazon."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "It's a good tablet I just wish you'd look more childlike for my two and a half year old grandson! It's just a normal tablet there's no way to make it look with bigger emojis bigger screen savers just anything like that. Other than that it works fine actually works very well, my only that's my only issue is that it just looks too old for a child. But others did not come with tempered glass. Not to my knowledge I searched and searched and did not find others with a tempered glass protector and needed a tempered glass protector because I had breakage for my grandson on three other tablets. I would recommend more for teens and adults then for toddlers."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "It's only getting a star because I have to do at least one. It keeps freezing, we have to cut it off and cut it back on. Every time we go to the app store it says \"Google Play Store isn't responding. Do you want close it\"? We have to try multiple times to download stuff before they actually download and half the time the apps won't open. I don't understand my other son got the same tablet just a bigger screen from Sprint and his works just fine. This is very frustrating and disappointing because I bought this for my sons 6th birthday present. We literally just got it on Friday and he opened it up on Sunday and he can't even use it. I want my money back. This was a waste of $100."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "perfect"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Poor quality. Volume is terrible & touch screen does not respond well. Below average product.\n Very slow."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "I bought this product since under description said that has a 2 GB RAM memory, but when I received it was of 1 GB RAM."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Item reveived was what described on the website. Works perfectly. It was a gift for my grandmother and she loves it. Easy to use and to maneuver. Excellent quality product and the price was reasonable. Love it. Thank you!!!! God bless!!!!!! I hope you get more sales for this item!!!!!!!!!"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Its not bad for price.."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Gift for husband. Good tablet to use around the house during personal time."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "This is my son's second Galaxy Tab. His first lasted for years and because of this, I bought him another one. So far no issues and my son sees a enormous improvement in performance. I expect that this little tablet will last him just like the last one."}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "Got this to replace the Samsung A tab that I had been using, but didn't want to spend too much money, so I thought the E tab would be good enough for the games I play and things I do online. Lots of lags, videos struggle to play... seems heavier than the A tab... shoulda spent the extra few dollars for the more superior product."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Bought this for Christmas with the children's soft protective case. After about a week, it had to be completely set back to factory settings, and even that took multiple attempts to bring it back. A few weeks later, it would not turn on and had to be reset again, this time the voice commands never worked again after that. A month or so later, would not power on and had to try resetting and holding all the reset buttons several times and after >10 attempts, it did finally come back on. Next the batter changer stopped working and we had to use an alternate and then finally the at the beginning of April, not even 4 months old, completely stopped working. I thought having a Galaxy, this would be a good, less expensive alternative to an overprices iPad, but maybe it isn't. STAY AWAY!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Perfect! Refurbished tablet I bought for my daughter.  It's just as good as buying one new!! She loves it. And I loved the price."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Very nice. Its arriven on time"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "This is the perfect size for reading, for checking emails and playing short games.  Is is quick loading, lightweight and easy to navigate."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "ok"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Have being working 24/7 since arrrived, used by everyone in family for different reasons. Very good product."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "I've had a Samsung Tab 3 for years but it's slowed down tremendously. It was time for a new tablet. I watched this one for months and finally managed to get it, a case, and tempered glass screen protector all for abour $100. Score!!! It works the same as the old one I had and serves the purposed I bought it for *my young daughter.* I am only disappointed that I can not download Hulu *this version is not compatible with your device*. This is extremely frustrating. I've got Hulu on my Samsung phones and Amazon tablets, why won't it work here!? I've been able to download quite a few other streeaming and network apps w/out issue...but no Hulu. Smh."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "everything works, its perfect"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great Quality for Teens"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Tablet is already toast after 3 months. Won't hold charge or even turn on..."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Bought two for both of my boys and they love them! They don't lag like other brands and they are so cheap for how good they run. Def would buy again when my baby girl gets a little older."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great tablet for my 3 year old. I recommend getting a thick case."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "My grandson is happy with it.  I have had Samsung tablets before and they are a great product."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Love it!"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "One helluva deal. Love it"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "This item powers up but does not function."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "It is good product"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "The tablet is SLOW & not only that, it would never open the Google Play Store to download any apps.  Every time I tried to install something, the app would crash.  I replaced it with a Lenovo Tab 4 8in & couldn't be happier with my decision!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "My grand daughter loves it!!!!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Very helpful with my work"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "I got this for a 5 year-old girl and she uses it mainly for watching movies and YouTube.  It can be a little slow, but just for viewing the web and replying to e-mails, this it the perfect budget companion that can run a nifty group of apps.  The rear cameras are what they are.  Don't expect anything of the S series or Note series quality of pictures from this thing.  This is a cheapo.  But treat it right and it could last quite a while.  I use it occasionally just to browse some websites and it does well doing that.  Don't use this for anything professional."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "perfect"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Yeah I got this item thank you"}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "ok"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Excellent"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "great tablet price is fair.."}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "The tablet is very nice. I bought it for my son's Christmas present. But it charges very slow. I don't know why."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "like it"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "It's a functional and easy-to-use tablet, everybody at home is happy to have it."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I purchased this tablet for my 8 y.o. daughter 2 years ago for Christmas, it has been stepped on and dropped (including down our long staircase) repeatedly and it's still working fantastic although there is a small crack in the corner on the right side of the Home button (So I would recommend buying a screen protector if it's for a younger child) The battery holds a charge for several hours even though she tends to have multiple apps and windows open at the same time including youtube and games and doesn't seem to lag or slow it down at all, we make several 9+ hour trips out of state and she is on it for the whole trip without charging it. The 8 GB storage seems small but I can say that it holds ALOT, The only problem we have ever had was the USB chord was bad when we purchased it so it didn't charge, but we called Samsung and they sent us a new one at no cost to us.\n\nPros:  It has an SD Card slot for added storage,  It has Bluetooth so your able to transfer music files, ect. from other devices. It has Wireless Internet so if you have Hotspot you can share your internet data to the tablet and  have internet anytime, anywhere. And the Battery Life is exceptional. Plus an added bonus is that almost all Samsung devices are compatible, which means you can save important files including Contacts and Numbers, Text Messages, Pictures and Phone Call Log Records by sharing them over to other Samsung tablets, phones or laptops by downloading Smart Switch free from Play Store.\n\nCons: None in almost 3 years...Would recommend this tablet to everyone."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "wish I saw it didn't have a front camera."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Works great"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "They are great but now one of them just keeps lighting up randomly"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "I've always wanted a galaxy tablet. I love my galaxy phones. We have several kindled which we all enjoy. Finally purchased the galaxy tablet and I hate it.. the resolution is horrible the tab is a waste of money. I should have purchased the 10 inch kindle instead."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I primarily use this when I travel. It holds my Netflix downloads and works like a dream due to the long batter life. I just love it."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Wouldnt turn on after only a few months of use. When it did work. It was very slow and laggy."}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "tablet works but you all sent me a iphone charger..... it shows was inspected so i hope no issues arise with the product since i just spent 20.00 bucks for a charger."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Love it! I had bought 2 other tablets from\namazon and returned them because they were awful. It wouldnt read my finger and had a hard time turning the volume up and down. I spent more money on this tablet but it was well worth it."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Bought a used like new...The quality of the screen resolution/contrast is not close to any Samsung I've owned.  I truly believe this is a knock off with a Samsung label slapped on it."}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "Decent Tablet that has a tendency to freeze up for no apparent reason.  This rating might even be a little overly optimistic."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "perfect"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "WARNING.  I have 2 of these tablets that are about 17 months old.  Today the first one burst open under the pressure of the battery swelling inside.  I had not realized that the back plastic case had been slowly expanding.  When I looked at the second one I could see that it was also swelling but has not yet burst open.  Catastrophic failure at 17 months?  I won't be buying another Samsung product.  It seems they continue to have problems with their batteries."}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "The screen resolution doesn't look that great. No front camera facing and screen smaller than I realized. I probably should have done more research. However, it's for my 8 year old so it will do for now."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "As advertised. Extremely good product. We are using it in our retail business with Square to accept credit cards. Works so good for movies and other things I am going to buy one just for me"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great low priced tablet for my 5 year old son!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "it was a gift to me from my son..i love it but it doesnt have much storage space"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Do not buy this. It is an old tablet running KitKat and CANNOT be updated. SD card can't be set to default storage."}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "Its ok....Gets the job done but not great"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Good tablet for my toddler."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Excellent  just right for my 5 year old"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Bought one for each of my young kids.  They've had them for 6 months and they work just as well as the day we got them"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Perfectly, it's working very good.\nExcellent Amazon"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Still works lol bought it months ago my 6 year old loves it."}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "Decent tablet. Great slick look. But not fast at all."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Good product"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Awesome!"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Bien"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Very satisfied with my girls tablets! They loved the tablets"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Nice little tablet, bought it as a gift for my mom. She was able to figure it out pretty easily (Were mostly Apple people). Wish battery life was a bit better."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Working very good"}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "Could never get it to work on my network.  Returned it."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "First off, if you found this review helpful in your decision-making, please click on the helpful button so this review may help others in their decision-making process.\n\nPurchased as a christmas gift for my father. I was not looking for anything specific on the internal specs, just something for someone that is new to this technology. My attention was drawn to this tablet because it is from a reputable brand and known model (Samsung Galaxy), its very light (dad has shoulder problems), and could withstand a few drops (kid friendly, but not a kid OS). Very good for basic operation (web surfing, netflix) as well as a decent amount of games (texas holdem, FPS games, solitare, etc.) and the screen gives a very good, clear picture. Full battery lasts about 5-6 hours with non-stop gaming. Did not expect my dad to know about skype, so unfortunately, its hard for him to use with no front facing camera. Storage is expandable, if needed, with a slot for a micro SD card. All in all, this is a very good starter tablet and a good tablet to give to a school-aged child (ages 5-10). I highly recommend this tablet for basic operation, just not for skype."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I love my new tablet I got I recently got it a few months ago and I love it I can truly say  I download movies I talked to friends and family on facebook & Istagram I could recommend anybody to get a tablet like this I recommend they should get a Samsung Galaxy tablet e Lite 7"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I love it"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Really liked the case but the tablet itself only lasted 8 months & then it died.  Big waste of money.  Enjoyed it while it lasted just didn't last long."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Perfect condition."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Very nice."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Works great. Replaces a 4 year old Samsung tablet and this one is quicker & gets a stronger signal on wifi."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Good tablet for young boys"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great tablet for the price. Works perfect for my 5 year Daughter. Her use is basic, Netflix, and games. So glad I didn't buy the iPad mini that was triple the price."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "great product, 5 star"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "excellent product, the packaged is very safe"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "This tablet runs super slow, I wish I got an iPad instead. You can't download all your favorite apps, for ex Hulu... this tablet will now be something my nieces can just watch YouTube on."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "GREAT basic tablet for browsing, games and reading. Beautiful clear and sharp display. Battery life is outstanding."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Really recommended for kids!! Excelent!!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "10 stars gift for husband!!!!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Being frugal, my wife went through several inexpensive tablets. Finally I convinced her to pay a bit more for quality and she's tickled pink."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "It only lasted for a month."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Good one!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Got this for my 4 yr old and is perfect for him."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "This is the worst tablet I have ever purchased in my life. It is slow, the screens lock up, it tells me that I'm not on the internet or have no internet connection , and it is $100 piece of garbage. I have a Samsung Note 5 so I thought this would be of similar quality, but I would warn anyone before buying this do not waste your money. Horrible product."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "only complaint is that it charges a little slower than our other devices. I bought it to replace my grandaughters ipad. she likes it just as well, but at 1/4 the price. Same games, apps work, very rarely crashes."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Really great tablet to browse on the internet and watch movies."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Gift no issues"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Sent it back it was worthless"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Works great, my granddaughter uses it all the time."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Best tablet i have ever had, and so glad i went with this one, battery life great along with everything else."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great tablet, works the same as my phone, both has Kit Kat, only neg is I wished I would of gotten a 16 gig model. Even with a 32 gig SD card installed a lot of apps will not move to to the SD."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "I love this tablet..\nGood price for small one for my purse..\nHigh volume for music and long lasting battery..\nThanks\nHappy that i bought it.."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Everything is ok with it so far"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Bought It for my granddaughter for Christmas,  Gave it to her on Dec. 4 2017, Used very little,  It quit working Feb. 3. 2018."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Looks like new and super functional"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great Buy!"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "Stopped working a few times."}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "Shipping was fast good quality tablet lots of new games in the google play store free movies! Well some movies. But start shipping it with a charger that would be great  besides that I would give it a five stars  it may have stopped working because it may not charge for games I recommend the Atari  and psp, PlayStation emulator."}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "Purchased for the upgrade from 4.2.2. This 4.4 has trouble with certain apps (i.e JW Library). Regarding this specific app, it would only allow 3 videos (3-5 minute videos) to be downloaded from the cloud. Any more and the videos would not play. Plus, the pixels were terrible."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Got this tablet to watch Netflix and YouTube videos\nThe size is perfect for me not to big not to small\nVery lightweight. Comes with charger, came almost fully charged. You set up with your google account and pretty easy setup, I was pleasantly surprised, very easy to navigate came with some few pre installed apps\nWatched my first video on it, the picture was good, volume also very good, overall a good decent tablet for the price."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "It works great"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I searched long and hard for some good tablets for my 8 and 10 yr old and was so hard when I came across these.  Wonderful tablets. Only CON..  theres no front camera but other then that. My kids love it and it keeps them off my cell phone.lol"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "was for the wife she loves it"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "I Bought these because they are samsung and seemed like the perfect size for my little nes. not to mention we love samsung. To my surprise the OS is a little outdated and ABC Mouse isn't really compatible with the OS. I'm very disappointed, this kinda the main reason we bought these. would love to know if there is any way to update OS. other than that they are perfect. my kids love them."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Nice unit for the price, my only complaint is the Android operating is an old version and will not accept the app for Echo Alexa. I tried to upgrade to a newer version of Android, and could not"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Perfect and great product!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "My son loves his tablet. We had to replace the old one due to screen breaking"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Bought for don whose old tablet messed up."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I paid an excellent price. If I could buy another one for $61 I would. Very happy with this Samsung. I've purchased other small tablets in this price range that were far inferior. This thing has an excellent WiFi chip in it that always stays connected. Very very good battery life. Screen is fairly responsive. Sometimes you have to tap twice, but no big deal. No scratches after a month. Buy a ten dollar case, and a 32gb SD card."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Very happy with the purchase."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "We loved it"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "These tablets are awesome since thess were opened at Christmas they haven't left my girls hand for a year now. They completely loved them. The only flaw I see in the tablet is it doesn't have a front facing camera for selfies or video chatting. My girls didn't mine. But most phone and tablets come standard with both. Show just be aware if you are planning to purchase."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "I bought this for a gift, what I like more about it? the price."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "My only complaint is there's no front camera but j can live without it, besides that the tablet works very well and I've had it for 6 months and it shows no sign of slowing down other than when I leave all of my apps open in the background at once, but once they're closed the problem is fixed"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "excellent product for my pre teens. They love it."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "IN WONDERFUL CONDITION!!!...\nHOLDING CHARGE WELL!!!\nIS IN A NICE MEDIUM BLUE SEMI SOFT PLASTIC/RUBBER? HOLDER\nWHICH ALSO FLIPS IN PART TO STAND...REALLY NICE FUNCTIONAL HOLDER!!!..."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Its great! The next best thing to a laptop"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "my son love it"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "We bought 3 of these for our kids. We were completely blown away with how great these tablets are considering how cheap they are.  The kids love them. We bought the suggested case,  and the cases came with stylus pens."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Really good tablet love it"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I bought this tablet for my 3 year old grandson to use for learning apps and to view videos. It was what I was looking for something not terribly expensive."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I bought it as a gift for my 4-years- old grandson, he loves it!"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "It's not the best tablet out there but for simple tasks and videos, it was great for it's price point. The only thing, that I don't like, is that it dosen't have a front facing camera and like I said if you put to much of a workload it will start to give problems."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Never owned a Samsung before, but I seriously like this little tablet! It simply feels good in my hand, light enough that it doesn't tire my hand to hold it for long hours of gaming. The only problem with it is that it's running a VERY old version of Android, but hey, knew that when I bought it, and the games I'm using it for support 4.4, so it's all good! Definitely a good purchase"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Christmas present for my 12 year old. She is on it everyday for reading. You can multitask on it which she loves for her school work."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Works great for my 4 year old"}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "The size is great. It fits and work great for my 6 year old, but it takes for ever to run downloaded apps even with extra memory ."}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "An ok tablet for kids.  Do not buy this for an adult the slow performance will drive you bonkers! The wifi nic card in this is spotty and the battery is ok but easily worn down within 2 hours!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I brought this for my 3 yr old and he loves it to watch Kids YouTube. Long usage time"}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "extremely slow and boggs down quickly there is no way to move apps to an sd card. good for older ones who know not to download anything"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Fast shipping, good price"}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "Camera not clear"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Awesome!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "It was perfect!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Very very great quality .!  Bought it second hand and still going strong  even though my kids have taken over it . Still in perfect condition ."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Bought for my 10 year old to play on. So far has survived his 10 year old attitude for 2 months without breaking. That's a good streak for him."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Great tablet for the price is slow though"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I didn't want to buy an iPad for my 6 yr old son. We have an iPad already and the kids would for fight over it. So, I decided to get this and he has really liked it. Great price for a decent tablet!"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "Good value for gaming, casual web browsing.\nI bought this so I wouldn't always be drainin my phone battery, for uner $100, it does it's job well. Don't buy this expecting a powerful tablet, especially when this onl has 8 GB of storage. The screen sensitivity is pretty weak compared to others. I wish the fast chargers from the Galaxy phones worked for this, but it charges at the same speed no matter what."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Price great for good quality item"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great little tablet. Great battery life, easy interface and small enough to carry around. Highly recommend!"}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "We bought this for our 5yr old but still can't find any parental controls and Samsung Kids app is no longer working so he can't play kids mode. He can have full access to play store which I'm still trying to find how to block innapropriate games for his age. I have to be very careful when he's using it."}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "The tablet came in perfect condition it's a great tablet it installed all my apps with ease the the but my only problem with the tablet is it does not have a frontal camera if I would have known I would have bought a different tablet I'm really big on taking pictures and the camera quality is not all that great not at all really and even if I download Snapchat or anything I can't face the camera towards myself so it's pointless definitely definitely wish I would have known it did not have a frontal camera or a good camera  at that before I bought it."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "works great a bit slow but I use it as a reader and light surfing so thats ok"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Excellent service! the item arrive in perfect condition...It was a Christmas gift, my mom is very happy ! thank u!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "a lovely efficient and inexpensive little tablet, much impressed"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Works great. No complain so far. Its the second one I bought."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "This tablet works well. I love it. My son is enjoying his tablet. Long lasting battery life."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Arrived in good packaging. Stopped working in less than one month. Was bought for a Christmas gift. Wont charge, won't come on anymore. Was slightly used. Dissapointed and money down the drain."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "I had one specific use for this, and for that use, it is great."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Very good item in very good conditions"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great tablet for my 2 year old niece."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "This tablet works well, and has a good battery life."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "This tablet has only 1 camera so you can't do imo. It doesn't have a lot of memory I wish I hadn't bought it"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Got it on time on price !!!"}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "Very poor picture quality! Size is good and confi..."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Very pleased with this purchase"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "This tablet works great in wi-fi.  I purchased it to be able to access drop box for my ukulele music and read kindle books.  If fulfills both needs and really holds a charge."}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "Doesn't support Hulu."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "as described.  was a gift - he loved it."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "old OS, but is ok."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great price and performance plays every game i have download just fine"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "Its ok for a starter tablet. Very basic"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I gave a couple of my grandkids these for Christmas, I liked them so much I bought myself one."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Got this for my Granddaughter for Christmas, she's 9 & she Loves it. My Daughter did set up the paternal controls so she has limited access to what she can see. She likes watching kids on Youtube doing Toy Reviews so she's Happy "}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Could use more memory but otherwise nice."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Very nice tablet - very happy."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "This was a gift for someone. They loved it. Would definitely work with seller again."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "slow, cheap, can't really run any apps"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "The tablet can be somewhat slow it is a little surprising how long it takes for some things to load up like child YouTube. But over all is well made does work."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Awesome for kids. Great price."}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "Tablet is good for kids, but extremely slow at times compared to our other devices. We added less than a handful of apps and these are running slowly. We bought two and both of them are moving slowly, even after checking for internet issues-so I guess it is the tablets. We bought them for two young children, so sometimes the lagging is annoying for them."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Excellent product."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "great gift for my daughter she loves it"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Got this as a cheap music controller for my kitchen. It is ok for the price."}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "Got this for my child for Christmas. It is a really nice tablet and they love it. Only big issue is that I didn't realize it did not have a front facing camera. Who knew they made tablets without that anymore??? Guess I should have checked the details more. Other than that it is nice just disappointed about camera."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "The product is perfect, however, your should send a Spanish battery charger if you send it to Spain, because I supposed that all could be perfect in Spain, however when I open it and I saw that the power charger is only for USA, but as it also has also a usb so I could adapt it to battery charger of my mobile phone"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Love it"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great tablet for kids. My 3 year old loves it! Very easy to use and great battery life!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Works well for my 7 yr old daughter to play games and watch her you tube kids. Great little tablet!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "The tablet is nice it helps me with my job. nice camera too."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Got it for my 5 year old for Christmas...he likes it! Im happy"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I love Samsung anything. Bought this tablet for my daughter and its perfect. She can do anything I can do on my larger Samsung tablet."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Perfect childrens tablet and affordable"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Gift for dad\nHes happy? Im happy!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Its a Samsung, I knew it would be good!  My 3 yr old daughter can operate it like my phone and LOVES it!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "This tablet works great. We bought it as a cheap tablet for our young nephew so he can play games and watch videos. We also bought a screen protector and a kid case to go with it. I don't have any complaints."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Two reasons I give 4 stars instead of 5. First, old software.  Android 4.4 is OK, but it doesn't work with all apps (i.e. HULU). Second, no front-facing (selfie) camera.\n\nOther than that, it works really well."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Excelente"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "If I could give less then 1 star I would had it for about 3 days and stopped working google did not support anything"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "I'm completely shocked at the positive reviews of this tablet. Maybe if you do basically nothing with it and don't care to get updates for apps you do use much longer (if you're able to download them to begin with)...\n\nThis is a disposable tablet, and it will be the last piece Samsung junk that I purchase(and will be returning)\n\nThis tablet runs android 4.4.4, which was nice, when it was released in 2013. This device was released in 2016... It can't and won't be updated. Many apps in the app store simply do not show up because they are no longer compatible with such an old version of Android. This was bought for my kid and even Minecraft isn't compatible.\n\nLet me explain the scam this really is. At the time of the tablet's release in 2016, Android 6.0.1 was available, a month after it's release, 7.0 was available. Hardware wise, this tablet is 100% up to the task of running version 6 and probably version 7 with no issue.\n\nThe absolutely only possible reason to release this tablet with version 4.4.4 in 2016, is so that it is obsolete as soon as it's bought. I don't mean something new always comes out to make your tech obsolete... You can literally buy a 2013 tablet and have a more up to date tablet than this because all tablets from other major manufacturers release at least one or two updates.\n\nSamsung is a garbage company and what they've done here is just flat out disrespectful to it's customers."}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "Can't upgrade past KitKat (circa 2013, no longer supported by Google). We've only been using it a few days and it works for browsing and youtube and stuff like that for now. However, we cannot install various apps due to the OS being so out of date. I contacted Samsung and they confirmed there is no update. It would be nice if the product description clearly stated that the OS is no longer supported and you might not be able to install some favorite apps."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Bought for my daughters 5th birthday. She loves it. Works great and easy for her to use."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Fantastic tablet! The only thing that I noticed is that it doesn't have a front facing camera, but if that is not important to you then it is awesome!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "This tablet is perfect!! I got it for my 8 yr old son for games and you tube. No problems whats so ever!!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Everyone in the house has one of these tablets. They're great for browsing the interwebs or playing games. I'd buy another one."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "very difficult to read, images fuzzy"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Do not buy this tablet I repeat do  not buy this tablet I bought it for my daughter as an early Birthday gift thought it was a good price and great product. Tablet worked for three months no issues then one day all of a sudden just stopped working. I read similar issues from other buyers who purchased the tablet before i did on Amazon but foolishly thought to myself they were just unlucky it won't happen to me. The more research i have done on this tablet I have found its a common issue and the reset tricks do not work. Please read this post and don't buy. Spend your money on another brand."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Easy to setup, easy to navigate. Kid friendly. Only downfall so far is that it seems like I matter what app you download it comes with those pesky pop up commercials. They even pop up when you aren't in that app anymore."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Perfect for my son, but the screen has some grip. At times you have to apply extra pressure to swipe or press."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "SENT BACK, OLDER MODEL IS BETTER"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Purchased this tablet twice now. One was purchased over a year ago and still works great.!! But we just ordered one for my son for Christmas that he just opened on Christmas day and the screen keeps blacking out, whiting out, and keeps freezing up. Not sure what the issue is but I'll be returning the item and purchasing another elsewhere, really sucks cause my son loves it.! But hopefully the next one will work."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Works great.  kids love them. A little bummed there is no camera facing the user,  can't do video chat.. my fault for not looking for that detail when i was looking for a tablet."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I have this tablet for 4 months, and it's still great.  I enjoy this tablet, and looks just as great as day 1."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Its worked out great."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Only giving one star because it works and is a great web surfing tablet. Camera SUCKS. No flash. And no front camera so you can't video chat (which is why we bought it). Volume messes up. If my boyfriend hadn't thrown away the box already I would have returned it."}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "Bought this for my 1 year old.so he could watch shows on rides but it is very laggy and slow.so I ended up getting him an iPad and giving this to my nephew"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "This is an old old version of android that cannot be upgraded. I don't know why this is still for sale. More apps drop support for older versions as time goes on. There does not seem to be any indication that Samsung will continue to support older devices to upgrade past v 4.4.4.\n\nI regret purchasiing, but will keep it since I got at a very low price. (~$70)"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "Was happy when I bought it for my daughters birthday. 4 months after purchase it suddenly stopped working."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Little Slow, but Only Using for Misc. Items during RV Travels."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "This little tablet works great.  Love it.  If you put it together with the case \"\nBMOUO Samsung Galaxy Tab E Lite 7.0 inch Kids\" it really makes a nice unit."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Works very well. Battery life, not so much...but.overall....great product"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Awesome"}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "Was a great item for a few months and the the battery crashed and it no longer even turns on."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great product Samsung never seems to dissapoint"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "This Is in my opinion one of the best tablets out there.  Its size is perfect for viewing size is perfect to carry in your purse, great speed, holds a good charge and it's SAMSUNG "}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "Started glitching and freezing after only a few months."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Got this for my son for Christmas. It is now March 1 and the tablet just completely stopped working. I'M so upset. Don't waste your money."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "very nice and my granddaughter loves it!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Pretty good for its price. Use it for basic internet surfing"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "This is a really nice tablet I got it for my 7 year old daughter for Christmas I messed with it today and downloaded her some apps.. it's a really nice tablet and it was even delivered on a SUNDAY. I wasn't expecting that at all.."}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "No front camera"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "A little apprehensive because it came like this.... Well see if it has any problems -_-\nThe tablet inside looked okay\nIm going to have to figure out how to make it look cute, packaging wise. I bought this for my mom as a Christmas gift.."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Weve had both of these for less than one year and both work VERY POORLY. battery life is absolutely awful. Do not recommend purchasing."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Bought this as a random gift for my mom and she loves it. Several of my family members have bought this product and all love it, so I can guarantee we will be buying more in the future."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Got it at bestbuy on sale for $70 for my daughter. Perfect for kids. No lags in games, its responsive, etc and she won't have to worry about storage like her ipad as I ordered a samsung 32gb micro sd. Good deal for the price/feature ratio. Does not support pokemon go, it is not in the playstore, but found a 3rd party app store that allowed me to download pokemon go and it works fine. If you have this and want pokemon or other unsupported games download Aptoide from the web or playstore and everything should be good to go."}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "Doesn't have full capabilities that I'm used to with other Android tablets.  One big drawback is it isn't able to do Chromecast."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "escellent"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Nice tablet, a little slower than I expected. Unhappy Amazon dropped the price $30 the day after I teceived it. Ho Ho Ho Merry Christmas to me."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Good product!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Got this for my boyfriend as a gift ! It works great\nIt looks really nice. It doesn't have a front facing camera only a rear. Just to let you know! \nThis is the great priced Tablet, & I have no problems with it ...\n\nWhat's Included\nSamsung Galaxy Tab E Lite 7\" 8GB\nTravel Adapter\nmicroUSB Cable\nQuick Start Guide"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I like it ..works great .."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "My daughter is enjoying the tablet."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "I was kind of disappointed by the fact the tablet had a software error. After consulting Google, I learned it's a common error with Samsung devices, which causes the Google Play Store to glitch and stop. There are ways to work around it, at least, but it doesn't stop it from happening. The only good thing is, if you use the tablet for basic things (reading, using certain apps), as long as you don't need to continuously use the Play Store (other than to check for updates), it's not a terrible thing, just an inconvenience. The battery life is wonderful, so far, and it's pretty easy to use, as with most Samsung tablets."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "My daughter broke it within 6 days of having it. I know it's my fault for not throwing a screen cover and a case on it. But it's very cheaply made compared to the Kindle fire. The Kindle is also a LOT cheaper. I'm grateful Amazon accepted my return and issued a refund. Went back and bought Kindles for the family."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Bought this for my 8 year old. She likes it, but I wish I had researched a little more. There's no way to upgrade this device to lollipop or marshmallow, so some apps simply won't be available for her to download and play. Oh well. Still a good deal."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I love it."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Bought this for my Mom and she's always on it. Great cause it's not too small or not to big. Just like Goldilocks and the three bears.. Just perfect. She gets to play on her apps (which has a rather large selection to chose from ) and she's happy with it."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "This tablet was horrible. Slow and low quality. Yes you can buy a memory card to add more memory but it's still super slow and hard to download anything. It's a waste of money. I bought this trying to be cheap and regret it."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "thank you, it was a nice give. good tables for the prise, and good battery life. great for kids too."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Super fast shipping. Product works great."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I ordered two of these tablets as Christmas gifts for 3&4-year-old daughters. We're a Samsung family; so when deciding on this product, there was no question to stick with the brand we trust. Product packaging was damage-free, neither tablet had a any scratches or blemishes. When I turned them on, one was sitting on a 52% charge and the other at 57%. Set up took less than 5 minutes and connected right up to my wi-fi with no issues. Graphics are smooth. For the price ($82 each), for a couple young'uns, and a Samsung on top of that...GREAT deal. I've only gone through set up so far, but I'll be playing around with them between now and Christmas preparing them for out-of-box play, so I'll report back any negatives I may come across. I'll be sure to update after Christmas how they hold up, as well.\n\nUPDATE 4/27/2018:\nTablets are still going strong.  We only use these for children apps, games and videos.  Every so often an app will freeze, but I really wouldn't place that on the quality of the tablet.\nUsually when it does it, there's so many apps open that it's as simple as \"close all\" and reopen, then it's back to business.  These tablets are pretty well protected with the bumber cases and screen protectors, but still have been thrown around quite a bit and they still work as great as they did Christmas morning.  Samsung has yet to disappoint me."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Love it!!!  Great purchase!  Works great!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "great for the price. blue light and graphics are old school status, but you get what you pay for."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Been wanting a samsung tablet for a while so I decided to purchase this one since it was $70. This will be my 4 year old's Christmas present and it works great so far! I added a 32 GB micro sd card and no problems at all. Make sure to buy a cover for it. Good quality, has decent weight, speaker could be louder and have better sound quality but I think my daughter will love it! I'm debating whether I should buy one for myself!"}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "Too slow"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Gift for grandson. He loved it."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Fast shipping and perfect for my daughter"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "Generally, it does it's job as a tablet.  However, that 1 GB of RAM can cause a bit of choke/lag while using the tablet to access intensive content.  It also grows a bit warm with long-term usage.\n\nTo get to the meat of what my review is on about, I field-tested this tablet as a tether-dependent device for Pokmon GO, in the context of passively gaining items/dust/EXP for my alternate account whilst I actively catch on my main phone.  My provider at the time of these tests was T-Mobile, and my Phone was the first Google Pixel.\n\nI will also note that, if you do get this device, you will not be able to download Pokmon GO from the Google Play store, but instead from a APK mirror site.  The reason why is that the Tab E Lite only has 1 GB of RAM vs. the minimum requirement to download being 2 GB.  What comes below is not the fault of Niantic or Samsung, but rather a summary of what to expect if you are using this device as a cheaper option to other, beefier tablets.\n\nFor my urban field test, I used Philadelphia- specifically, Center City and around Spruce Street Harbor Park.  Immediately after hopping off the Regional Rail @ Jefferson Station, it was having issues loading up the game.  Granted, the station was underground, where you are bound to have poor reception.  However, my phone loaded up just fine then.  I take my devices above ground and find that the device can now load the game, but my movement is not registering on the tablet.  Again, the phone is fine.  The tablet begins to finally register movement once I leave the general area of City Hall.  I presume the tall skyscrapers in the city severely impacted the GPS locator on the Tablet, as they had also done the same to my Pixel on previous visits. Operation is generally very choppy, once more a testament to how I am running a game that takes 2 GB RAM on a device with just 1 GB RAM.  Catching Raid Pokmon is very difficult, with a half second delay on the screen to your own interactions.  Battery Life was roughly 4 hours of usage under those conditions (weather was dry and cool, about ~45 degrees Fahrenheit)\n\nFor my suburban field test, I used the campus of Arcadia University, where the reception is generally excellent.  Both the tablet and the phone function properly and with relatively smooth operation.  The tablet grows slightly choppy after the 3rd hour, but nothing like the test in Philly.  Raiding is passable.  Choppiness can be remedied with a quick reboot/cooldown period of 15 minutes.  Weather conditions applied to this test was about the same as the Philadelphia one, but I did have a light drizzle.  Battery lasted 5 and a half hours.  Rain is not kind to touchscreen accuracy.\n\nAll said and done, this device is so-so for Pokmon GO, but only if you're willing to deal with sub-par operation, and if you play in suburban and rural areas (assuming the rural areas have decent coverage from your provider)."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "My 4 year old has a broken leg and has been pretty bored in a body cast. That said, I went to the \"big name electronics store\" tonight looking for an inexpensive tablet for him. Without saying how much I paid for it, I got a bargain on it due to it being on clearance. He absolutely loves it and it is pretty much \"idiot proof\" for the average consumer. He was immediately able to use YouTube and the other apps that he used already. The graphics are crystal clear and it was easy to set up. Charging was simple as well. Definitely recommend it."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great value.  Plenty of power for basic internet and task work.  Very solid feel."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Works great"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "After 6 months of daily use, this morning it won't turn on.  Nothing but a blank screen.  Don't waste your money.\n\nAlso, there is a problem with storage.  Even with an external memory card many of the basic functions won't work because there \"isn't enough device memory.\"  I moved everything I had access to the card (which was ridiculously tedious) and I had to delete cached data nearly daily just to check my email.  Again, don't waste your money."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Me Encarta."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Amazing!! Definitely adore this purchase."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Nice. A bit slow when downloading but its a perfect starter tablet for an older kid"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Arrived in plenty of time, but that's the only good ive got to say about it. Took about 5 days to charge so obviously faulty and only got 1 charge out of it before it died and never came back on.  Currently traveling around the world and have enough to do without sending bits back and forth so it's just used as a coaster for hot drinks.\n\nThe screen quality wasn't great either, had a really weird shine to it and had to angel it funny to watch anything. Complete waste of time and money and would have sent it back if I had a fixed abode and the time.\n\nJust heed my warning. I rushed into this after some of the postive reviews and regretted it instantly, most expensive coaster ive ever bought bit works well for holding hot beverages."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "There great I love them so much"}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "I gave it to my son for Christmas and already starting to turn off by it self :( he only uses for YouTube and games."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "MUCH better than the Fire!"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "Ok so let's be clear for anyone looking for a tablet,  this is an old tablet.  If you buy it, understand  like I did that it is not top of the line, it may have been like 4 yrs ago.  It runs Android  4 kit kat.  My phone is 8.0 oreo.  Color is bad.  Memory is 1/3 taken up by the operating system.  Regardless, it's ok 2 give 2 kids at best."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "So far so good! I ordered this for my daughter as a Christmas present and I opened it just to see if everything was how it was suppose to be and it was haven't turned it on yet but so far Im happy with how fast it came and it looked great!"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "This tablet kept not recognizing our network. I had to do a factory reset to get it to reconnect. We bought this for our 7 year old son. Very slow also. We have returned it and purchased an IPad. Should have done that to begin with."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "it's nice looks good, but I don't know if it's the tablet or my Wi-Fi, but it's slow when trying to operate the tablet"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "doesn't have screen mirroring option, so it useless for my purpose\nCannot use DLNA  in my car.\nI took me 3 days to figure it out"}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "Substandard wifi , an amazon tablet has superior wifi reception compared to samsung tab . I sit next to my wifi router and this samsung tablet still fccking lags . the amzon tablet never did that . very poor wifi , substandard wifi , or used wifi parts in my phone are causing wifi problems . the wifi is poor and not acceptable ."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Bought for my wife she loves it"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I purchased it refurbished for my mother who likes to browse the internet and she loves it. It has held up and has had no issues for a year now. I could not be happier with the purchase."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Bought this to replace my old Galaxy 3. Love it. Using it to type this."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "This tablet is awesome. I got one for my daughter several years ago and its still going! So I got this one for my mom to replace her crappy RCA cheap tablet that hardly worked and she is in love! One of the best tablets out there next to iPad and kindle."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Amazing product my kids love it"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Low resolution"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Only opened it to check for damages. This was purchased as a Christmas gift for my 6 year old. I think it is a great choice and a great price for a child. I did buy a bigger sd card with it for more storage as this will be used primarily for gaming apps."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Crashes when I try to play games on it."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Perfect for our daughter. (Wouldn't personally use it myself though) We use it for streaming. Can download Netflix but Hulu not available. Great battery life and picture."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "this is a good  tablet and it has lasted no complaints about it"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Need to return picture quality not good totally disappointed and this was a gift to my sister"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great tablet."}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "COLOR IS NOT GOOD, KIND OF FAINT IN COLOR PASTELS.  DON'T THINK IT'S REAL GOOD FREEZES FROM TIME TO TIME."}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "Pretty standard 7\" tablet. Stopped charging just  after 7 months. USB charger connection seems fine, tried multiple chargers, just not charging. Let's see how the one year warranty pans out."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "should have done research and realized this is a OLD POS version. but thats my fault as I am an apple person. this barely works enough for my older mom to use."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "I didn't realize that there is no forward facing camera, my bad. A great Samsung product!!! Super fast shipping, professionally packed."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "This tablet is perfect for work and perfect for reading. The two main things I got it for! Does great with productivity apps and the Kindle reading app is very clear! Camera isn't that great but i will probably never use it. This is a base model Galaxy Tablet so it is not going to have a super HD screen like some of the more expensive models but for me it does the trick and it does it beautifully!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I loved it. It's a great tablet. I got it for my daughter for her birthday."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Better than most Android tablets that's around the same price. Only thing that's a con is the camera pixel....but good for kids. Brought 3 for my kids"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "like it"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "It works very well and does what it needs to do with ease."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I ordered this tablet for Christmas and for my son, hopefully he enjoys it"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I like this tablet it is durable and great for 3 year old kid. He loves it. It is good quality and not slow like some kids tablets. The storage is not a lot, its ok coz you can insert an sd Overall I recommend this tablet."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "this tablet was very easy to set up and I am in love with it. The screen viewing is crisp and bright. I already knew that Samsung makes a great tablet as I bought one (kids version) 2 years ago for my granddaughter and it is still going strong. Since then my other two granddaughters have gotten Samsung tablets and love them. The battery lasts as long as advertised."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Very nice tablet.  Could not install newer apps such as Pandora or Spotify.  Tablet would be great for kids."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "just wonderful!!!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "GREAT LLITTLE TABLET."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Love it"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Should have bought an ipad"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Google Play doesn't work on this tablet despite coming pre-installed. Searching for a fix, none of which worked, via Google results in many many links and reports of this issue (white screen on Google Play/not showing any apps). Reports suggest that this is primarily an issue with Samsung devices. With no working Google Play, I have no way to download the apps that I wanted to download, including Netflix, without using external sources. It has made this a real hassle to use, and I wish I had bought a different product."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "This has been excellent for our 12yo. Only downfall is there's no reverse camera."}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "This isn't a very good tablet at all, Its very cheap looking. I brought this tablet and requested a refund the first day I received the package. The quality is so bad and the set up looks outdated. If your looking for something cheap this would be great, but if you want something with nice quality then chances are your not going to like this tablet at All"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Very durable and works well."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Bought this for my 7 year old birthday present.. He's a happy kid"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "This tablet was purchased for my 10 year old. We connected it to our house wi-fi with no issues. My child uses it to watch you tube, play games, and type stuff for school on Microsoft word. We've had this tablet for a few months now and still works awesome."}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "I give it a 3 because the ram is way to low. Had to return it for something with more ram."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Awesome device"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Nice unit,  just need a memory card for extra storage."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Cheap thought it was gonna be like my tab 3 but no this is like my 18 dollar walmart tablet the screen can't be tilted to one side or the colors will be crap unhappy"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "Perfect kids tablet. This thing isn't top of the line but for a kids you that won't break the bank this is the one. With a case it has been running strong in a household with 2 young boys."}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "Kind of slow, no front facing camera. Good for kids, not for school which is the reason I bought it."}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "Purchased it to mirror screen. This model doesn't come with the feature"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Got it on sale and perfect for my kids, without breaking the bank.  Screen display is very good.  Interface is consistent Android version.  The only issue is RAM management since the kids don't think about performance.  Wifi has been solid, no loss connections in the house.  White version is a nice change from all the black ones out there.  Wide array of cases, screen protectors, etc."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great product"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "its great"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Awsome, great for toddler!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "-bought it for kids use mostly, great product especially for airplanes travel as the size is allowed on the airlines for carry on.\n --lightweight, compact.\n-Love the fact that unlike ipad, i did not have to set up credit card to use the tablet so if gets lost in planes/travel- no worries.\n-love the samsung keyboard much better than ipad. don't have to keep hitting number tab to switch between alphabest and numbers.\n-good wifi capability.\n-my kids do math apps, reading apps, games, netflix, google surfing.\n-one can create multiple accounts for home page. I have one that's set for kids so doesn't allow any adult content in any of the above they do."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Its very useful"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Perfect tablet"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Battery runs out in 3 hours. Slow. Even with strong WIFI. Simply does not work! I only use it for trips so I have used it just 4 times since purchase or I would have returned it. Just had a trip where I needed it very much... Terrible."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "The OS borked within a month after receiving it. It looked like the screen was cracked, even though the physical screen was unharmed.\n\nAmazon Customer Service gets five stars. They were awesome. We were able to send the tablet back no problems."}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "Does not have a camera on the screen only the back."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Beats the heck out of those crappy, cheap Amazon Fire tablets. Very happy!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Nice"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "I purchased this tablet for one purpose, to stream Pandora music.  Sadly, the OS is so old (v4) that the Pandora app will not work and the unit is so old that the OS cannot be updated to a compatible version."}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "Anyone who use an iPad, even older ones, you will hated it..."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "I actually love this product. 1st delivery amazon lost my package and noted that put I refused delivery when I never say it. 2 nd delivery actually arrived. I ordered Samsung tablet and gear fit 2 neither would charge. I am not ordering anymore electronics from amazon"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I ordered this Samsung 7\" tablet after my Samsung 10\" stopped working after 5 years.  I opted to get the smaller size this time and I'm glad I did for ease of portability and use.  I've been happy with Samsung products (I also have a Samsung Galaxy S5 phone).\n\nThis tablet (WiFi only) is great for my needs as an alternate device to use when the battery is low on my smart phone and needs to be recharged.  I like the Samsung layout and so far it's been a reliable device for me."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Bought this for my brother for him to store photos on and use for social media. Loves how easy it is to use!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great Product!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "it is a good tablet works well"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I bought it 2 months ago for my kids. They throw away , kick and it is  still running. I recommend it with cover protection."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "gift"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Given the inexpensive price, you really can't expect too much.  Only 1.5 GB of RAM.  The picture is Ok, a little pixelated.  It's on the heavy side with a 1inch plastic bezel.  Speakers Ok.  Good deal all around."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Love this tablet!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "After my previous tablet, this one is phenomenal. Fast response, decent graphics, good size and weight, perfect amount of storage for my personal use with the option to add a micro SD. The only thing I haven't tried yet was the sound, which again I'm not personally going to use often."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I have a Samsung galaxy Tab and decided to get my husband one for Christmas. I turned it on long enough to make sure it turns on and connects to WiFi (due to the reviews). It's beautiful. Packaging had bubblewrap in it to keep it secure, box was a smidgen big but that's okay. Connects to WiFi and touch is flawless."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "good cheap tablet for controlling my home speakers with spotify connect."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "its cheap works as a netflix tab or gaming bolth work well"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Bought for my 7 year old daughter after I broke her nabi tablet trying to disable the parent login feature. She loves this samsung tablet and plays games on it everyday. She also watches kid youtube videos on it. She downloads all her favorite kid games on it. Very happy with this purchase. She really loves her tablet."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "good deal"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "A fantastic product and I love it!!"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Not worth a review..........."}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "One would think when purchasing a new tablet, it would come with the latest OS. The version on this tablet will not run a lot of the new apps and it IS NOT UPGRADEABLE!!! What a crock of $#%#$!%"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "Nice tablet but much slower than most other Samsung Tablets. The lack of front facing camera makes it bare bones. But if you are not into facetime or live streaming yourself then it may serve your needs. I got it for my kids who are both under age of 12."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Arrived fast, my child is happy"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "It runs all of the apps that I need it to run, but it is slow.  My Samsung Galaxy S7 runs circles around it in terms of loading speeds and response (both running on the same WiFi)."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I would by again"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Love it.... I use it to stream the music in my house 24-7"}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "First let me say, I am a huge Samsung fan. Love my new 8+!! I expected this tablet to be just as good! I have the a tab 10 too, wanted something smaller. I am so terribly disappointed! It is the SLOWEST device I have ever owned! It is unbelievable! I was so confident is Samsung, I threw away the packaging, now I can't return it! Guess I'll give it to my 2 year old granddaughter. So bummed. In the market for a new TV and microwave, guess not Samsung any more. Boo"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "This was a gift for my mom. She absolutely loves it."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Wish it had more memory but it's what I expected."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Excelent"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Loving it at the moment"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Very good"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great tablet"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I like it"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Purchased it for my boy, nice"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "No problems to date. Working as expected."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Good product, cheaper that local stores"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Perfect budget tablet.  Runs all my apps fine.  You will likely need to expand the storage if you want to save any videos or pictures."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Love this works great good price what more can i ask for."}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "This is a terrible tablet....the screen does not show clearly and it's horribly slow..."}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "Didnt realize until I already set up for my granddaughter....\nNO FRONT FACING CAMERA!\n Needless to say she doesnt like it.\n Other than that great tablet."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great purchase! Sits on my front desk, bought it for credit card trasactions. Looks sleek. I love it"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "excelent product"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Got for my son and it does exacrly what i need it to do. Thank you!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Good"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "We purchased a Samsung Galaxy Tab lite  for my husband last Christmas and have not had any issues, it works very well.  I decided to purchase a Samsung Galaxy tab lite just like my husband to replace my 8 year old dead IPad.  Well, I am very disappointed, it will not hold a charge out of the box. As soon as you unplug it from a charge it dies in less than an hour. This item was sold and described as a new tablet, but I believe that it is refurbished.  I am returning it  today."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "It's super easy to use and great for colleges. I love being able to write and highlight my notes without using paper, or worrying about the highlighter bleeding through. It's a great way to save money too. My only complaint is only having 8 GB, but that's where memory cards come in handy."}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "This tablet is fine for casual use. Quality is definitely sacrificed for the price. The outer part of the touch screen doesn't work and the screen is definitely fuzzy and a lot less clear than a nicer tablet. Spend the extra money and go with a nicer tablet for yourself!"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "So far so good. Just getting up tp speed/setup. Like having a larger view of some of our phone apps. without going to a larger screen.\n\nSide note: Packaging sucked. It came in a box with one other item. The other item kept it from moving one direction but it could slide in the other direction. Movement was about 4\" or so. Enough to be concerned. Granted the box would be jostled about during shipment handling. But no sense to add potential. Another bubble pack or two would heve been a benefit."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Originally my google play store was not working. After I restored factory settings it seems to be working just fine! Nice and light weight! I love it"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Yes I am very happy. ....Thank you"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "This tablet is awful. I like my Amazon fire tablet better. It runs so slow and takes forever to navigate through. I have high speed Dsl but it runs as if it's a dial up connection. Trust me, I would not recommend this product to anyone. Samsung know better than this!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Although this my 3rd ordering for my daughter there inexpensive and they working just as good as the expensive Tablets. Also the product works great I just have clumsy kids!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "We bought this so that we could play games on it and not tie up the computers. It is getting used all the time. We take it everywhere. A very good purchase for us."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Love it"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Purchased Fire HD Kids Edition for 3 yr old grandson and both he and his momma had problems with it. Charging port quickly became tempermental. Returned it for the Samsung Galaxy Tab E Lite which is much preferred by all."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "This tablet is very good for using it in conjunction with the internet. Nice price for the tablet, shipping was fast"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "This tablet is awesome! I was deciding between a kindle tablet, this or an ereader and chose this tablet. I am happy with my choice! The tablet allows me to stream movies, play games and read for several hours without needing to recharge. I can watch about 6-8 hours of media before needing to recharge it.\nThe tablet is compatible with any micro SD card, so download all your content and bring it along with you on the go. I got a 64 gb flash drive and I should have gotten 1 bigger. That only held 11 seasons of TV."}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "This tablet runs slow as molasses - it takes a long time to load pages when connected to WiFi as compared to my phone when connected to the same WiFi.  Not pleased with this purchase."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Perfect,"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "I like it"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Ok"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Works great"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "Just wasn't what we  were looking for."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "I only bought this to pair/mirror cast/screen mirroring with my Samsung tv, but it can't. I can pair a decade old htc phone with it, but oh no not a brand new Samsung tablet. Samsung is absolutely ridiculous that they couldn't be bothered to ensure ALL their products pair together, cheap a$$ mofos. I won't be buying their products again."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "runs great and is perfect for my 5 years old"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Good!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "my wife did own one previously and my grand-daughter took care of it. I bought a fire and she didn't like it so now with this new samsung she is happy again . so is my grand-daughter she inherited the fire."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "I have an Etch-a-Sketch that faster than thing. If the iPad is a rocket then the Galaxy is a unicycle. This thing is slooooow and I have blazing speed Wi-Fi.  I bought it primarily to control my Roku and a couple of other devices.  It works well enough for that purpose, BUT it's worthless as a web tablet."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great for reading! Definitely slower than my Samsung Galaxy 7 phone for wifi/internet, but much cheaper too.  I use it mostly for the Kindle app."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Perfect for it use"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "Overall look was new , performance was below expectations. Tablet was very slow and often didn't respond to my touch ."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "good quality"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Very good, a great deal and a great product."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great Case for the money..Fits well and protects my tablet."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "I use this mainly as a wall mounted tablet to control my smart lights and view my front entrance via my Skybell HD app. Battery life is great under these conditions and under more strenuous app usage the tablet stands up well. I haven't tried any games on it but everything else is super smooth."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "I am so over Samsung cutting corners. This is the 3rd Samsung tablet we have owned, and the 3rd one rendered useless within a year due to the charging port breaking. I never allowed it to be played while charging, it was just plugged in and unplugged it a few times a day. Then, it just stopped charging after 6 months. SIX MONTHS! Ridiculous. The first Samsung tablet we bought was 5 years ago, I assumed they had started making them better since them. We had S3 phones that were just as terrible, and upgraded to S6 phones, and the S6 have had no charger port problems, so I thought they figured out how to make them strong enough for daily use. Besides the disappointment of the broken charger port, charging in general took a very long time. Now I'm forced to decide; another Samsung? Another fire (which are just terrible with port problems and a limited app store), or just suck it up and buy another iPad, the only product that lasts more than half a year. After having bought this product in February and having nothing to show for it by August, I don't see me wasting my money on another Samsung."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Love this tablet. Easy to use and is perfect for my needs. Only thing is no front camera so can't use Skype but I didn't read complete specifications for product. Otherwise perfect size to read my Kindle app and to use Facebook and read my emails. Superior quality product Highly recommend."}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "good value"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Bought for my grand. Only problem was we weren't able to put parental controls on the device."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "8gb means nothing...at one point you won't be able to download anything on it, waste of money"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "It's great i ordered this same tablet gor my daughter"}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "I thought the screen cracked, but it is the pixelization has two cracks in it. One of the top and one in the middle."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I love it!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Good deal"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great little tablet. Does everything I hoped for."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Excellent"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Like crap"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Perfect little tablet for my 2yr old. Easy to use. Very functional without being overly complicated. It plays her videos very clear and the battery life is good."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Son un poko antiguas"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "If you want this to work on wifi do not buy it. My unit worked two weeks and I have had to constantly restore back to the factory settings to use it. I hate Samsung and I wish I had my money back. The crappy part is the accessories purchased for it that I am stuck with now"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Works amazingly, awesome for anything"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "Lower end samsung. Hardly worthy of the samsung name. Its durable and feels decent quality.  Good for your parents if they are new to tablets. For an experienced user spend more money. The built in memory as with so many Androids runs out quick. Buy an SD card!!!! Its pretty slow and doesn't run a lot of apps well. Snapchat dogs on it.  No front facing camera makes video chat pretty much pointless. The camera is pretty bad quality anyway. I use it to read indoors and listen to music does those just fine.. Aside from that its not really good at anything just okay if anything. No built in compass so those stargazing apps you might want your kids to use to learn is impossible.  Facebook Messenger works well though, Spend more money if you want something nicer is the moral of the story,"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Returned the amazon Fire Tab 7 and got this.  Much better.  I get all the apps I want on PlayStore."}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "What you mean 8gb RAM.. thats a typo right :p\n!!!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Fast, sleek"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "In this price range there is only one other tablet that is equal.. the fire hd 8. Samsung quality, nice zippy performance, and trouble free.."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "worked as expected"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Works great!! New to Samsung products but needed a tablet for work and it does a great job"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Was a gift for my mom. She loves it."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "excellent beast.  worth the extra money over the kindle to be able to run google play stuff."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Perfect gift for my parents who are both 81! Bonus it comes with excel and word. I want to keep it for myself!"}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "The charger only worked for one day and the tablet keeps freezing"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "It's a good product .\nonly thing missing is front camera.\notherwise it's a great product for kids."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great easy to use"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "I love the portable size and so far, it works fine, however it takes forever to charge."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Disappointed. Screen is the worst! Blurry, hard for my eyes to focus. Scrolling makes me feel queas. My ASUS Notepad is 3 years old now and it's on the blink, but I prefer it even in it's current state over this brand new Samsung (here's hoping it can hold on indefinitely, but the 'Google Services has stopped working' msg is more frequent than ever, and so far I can find no cure, and the battery is scaring me, reaching end days). I should have went to a brick and mortar to evaluate first. Didn't expect such a failure. Would send it back if it wasn't such a hassle. But hey if anyone from Samsung is out there and wants to bribe me with a better model, or simply return my hard-earned, I'm open!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Bought for a child relative.  Excellent for learning and entertainment, yet relatively inexpensive to replace if damaged."}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "Does not process quickly"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Bought this for my son, he loves it. However I don't like that fact that ot takes so long to charge. It was delivered fast, which made things better, my son had cracked the screen on the kindle."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Love it!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Going great"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "good buy I'm happy with it"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "good"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Everything I was looking for in a small  lightweight tablet. So far no complaints."}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "Poor viewing angle, grainy screen, and slow processor. You can't beat the price on this, but the quality matches the price. This is a bare bones tablet. If you tilt the screen up or down, it gets very dark or light. Operating it feels sluggish. Probably ok for kids."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Awesome tablet for my 5 and 7 year old! They love it!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Got this for our four year old for her fifth birthday and she hasn't used it yet, her birthday isn't for a couple more weeks, but we tried it out and downloaded her apps already and it's perfect, very small screen but great quality"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I bought this because it replaced my old Galaxy Tab. It works fine and does all that I expect it to. Mine runs flawless."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Love  it"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "good"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Charger won't charge tablet....tab works just charger"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "so far so good"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "It works fine. When you charge it, it is slow. It froze a couple of times. I thought it had a front camera and it does not."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Works great!!!!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great tablet"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "A solid little tablet for routine use. It even fits in my back pocket for listening to audio books while I'm working!!"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "We bought this tab to replace my daughter's 2015 Christmas gift of a Samsung Galaxy Tab 4. In many ways, it's very similar! It's size and capabilities are very comparable to what she had. On the plus side, it seems to hold a charge much longer and it was more affordable than her Galaxy Tab 4. On the negative side, the graphics resolution isn't as crisp, and there is no front camera. She's 9, though, so she either doesn't notice or doesn't care about the differences. I do, and I was disappointed in those small downgrades, even though they were both clearly spelled out from the item description.\n\nShe mainly uses her tab for watching YouTube videos,  reading ebooks, and playing games. So far, this tab has been able to handle all of these tasks. We added a microSD card for added storage, as the device storage is laughably small. All in all, it has been a very good value for the price paid, but I wouldn't recommend this tablet to anyone other than a kid, only because the quality of the experience suffers with the lower price point."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Great tab. My son loves it. There's no front camera. Overall it's a great tab ."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great buy!!!!!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "My Grandchildren love this tablet."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Very happy with this"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great product for a great price!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Perfect fit, easy to carry in my purse."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "its ok"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "Overall I would say the tablet is ok but just know your getting what you payed for.  Tablet itself feels light, speed is 6/10, audio 5/10 , battery 6/10"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Love it works great"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great gift for my nephews. They loved it"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "I would like to give this zero stars. It is a piece of garbage that stopped working after 3 months. My 7 year old cried all afternoon. Ridiculous short period of time for returns."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Bought for my wife as a replacement for her generic 10 inch tablet that met it's untimely demise when dropped, cracking the screen. We both argeed something smaller might be a bit easier to handle and more portable as well.\n\nThis would be our second Samsung tablet, as our son has had an older Galaxy Tab 3 for years. Still works, albeit quite slow, but acceptable and actually pretty dependable after we changed the battery.\n\nThis \"Lite\" version is a good, no frills basic tablet. Performance is acceptable for casual use (mostly Netflix and some Web browsing). It might be a deal breaker to some but it's worth noting that 1) there's no front camera 2) the OS appears to be Kit Kat with no ability to update it.\n\nStill, it's good tablet with acceptable performance and screen resolution. I've been reasonably happy with our other Samsung products and this is no different. My wife is definitely happy with this one.\n\nIt's not an ultra high end tablet by any means but it does what it needs to."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Perfect"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Best deal ever. Got the features I wanted at the best price around!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Was a gift to my grand daughter. She loves it."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great tablet for money got as a gift she loved it"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "Very slow... I was expecting better"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Very easy to use - especially typing area easy to use"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great tablet for the price. I am not sure what you get with a more expensive model. This one works fine. Also the Android system is much better than the Kindle Fire OS. The Kindle Fire I have for my kid is very akward to use and it is too easy to accidentally \"buy\" some app or book."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Faster then any iPad I owned, don't crash when I play games, doesn't take 10 minutes to load a 5 minute video and better internet"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Works great! Next time I'll get a larger screen but this one is perfect for our needs"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "battery is terrible"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Like the size, clarity on screen. Nice look!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great tablet and apps are up to date"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Nice inexpensive tablet, works great for the minor uses I have, video streaming, games, some internet surfing.  Fast, and does what it needs to do!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Love it"}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "This is literally the biggest disappointment I have purchased, the power it has is insanely low and I just tried to take a picture with the default camera program and it literally turned a fully lit living room into the darkest thing. Avoid at all costs, it's just a under-powered garbage tablet."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Bought for an 8 year old boy. He's used it regularly every day for over 6 months and absolutely loves it. I couldn't be happier with this tablet."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "1 day in. I love this, haven't had Samsung till now. Delighted. For this price, it's theft!"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "A little laggy at times, but overall it's good."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Got this for my non tech savvy husband for Christmas because he wanted a tablet to play games on.  It was easy for him to use and navigate for the few games that he plays. He does have a Samsung phone so the operation was basically the same."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great and I Love It!!!"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "The screen not very clear but is perfect for my son."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "I couldn't get the tablet to access the Google Play Store, no make how much troubleshooting I did.  I ended up having to return it for a refund."}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "Ding in upper right corner and a pixel is out."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Met my expectations"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Stopped working after 4 weeks. Definitely a waste of money."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Love tablet!"}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "Tablet works but has slow refresh when switching from page to page. I also noticed that web pages load a lot slower on this tablet than on my Nexus 7 which is 3 years older than the Tab E Lite. I bought this tablet to replace my Nexus 7, and I still find myself going back to it even though it freezes and doesn't hold charge as long. If you're looking for something basic and cheap and doesn't do anything pretty, go ahead and grab it."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Awesome"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Nice, fair price, came with Google Stuff. I will update later after a few weeks."}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "I like Samsung tablets, but this one was not working and I have to return it due to a software issue"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "exactly what was needed, thank you. ps super fast shipping"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I have a Samsung phone and two Samsung tablets (This E Lite and a Galaxy 10) and one of the things I like most about them is the charging cables are interchangeable. Little annoys me more than changing models, or upgrading an item and finding out that the connections have changed and you now need to buy a whole raft of charger cables. I love the size of this tablet and am happy to be able to use an SD card to increase the storage.\n\nThe only issue I had was the current Hulu app does not work with the 4.4.4 Android KitKat operating system. I purchased this to be able to cast to the bedroom TV and was pretty annoyed at first.....then the light dawned.  I downloaded a  previous Hulu build, and VOILA! it now works perfectly."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Excellent"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great. No issue with purchase or receipt. I received exactly what I expected. Thank you."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "My Kids Tablets Came Today And They Was Very Happy. They Can't Keep There Hands Off Them  Thank You!!"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "I have a tab E, also, and this is a slower, smaller version. It's almost too slow to use without frustration."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Excellent product"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Second one we bought for my mother in law . Easy to use and great quality.."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "still works no complaints"}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "Not Good for gameing it lagggyyy but besides that it ok..."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Like new!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "This is a great tablet! Could be used for an adult or adolescent!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Love this tablet! Can't believe  this store is so inexpensive and the result is this good. Buy from here!"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Good for kids... durable!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "This is my second Samsung tablet.  It's small which I knew but fits my needs.  I'm a fan of and user of Samsung products."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "very nice tablet for what it is, no problems with it, should have waited Costco has tabA-8\" for $129.00 with case,  but I like the 7 \" much easier to conceal,"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Good tablet."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Got it for my 7 year old daughter, she loves it. She watches Netflix and YouTube on it the most but plays games as well."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Doesnt have a webcam! That's the only thing I complain about."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "Some apps (like Kindle Free Time) don't work on this so beware."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Brought this from my daughter she loves it"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Love this tablet. Excellent condition and i can transfer my work very easily, very accessible."}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "I use for games only. I do not recommend unless it is for a child that won't care."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Very disappointed.  Not able to restrict my autistic grandchild to the one app I bought this for.  Looked for settings:security:screen-pinning, but it isn't there.  Seems they really want to just sell their \"kid's mode\" subscription service.  You can't seem to get good parental controls without it."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great tablet for a great price! It is very responsive and has a long lasting battery. My kids love it."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "This is a great TABLET. Easy to understand and operate. I love it. It was delivered in proper time as promised."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "love it"}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "I can't figure out how to keep the device from turning off after a couple of minutes.  Took pictures and can't find them."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Very durable so far."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Perfect size  for my 4 year old he loves it!  Great quality great price. I have all Samsung products so having the Tab E allows me to monitor what he is doing on the tablet when I am not around him."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I purchased this as a replacement for my wife's Fire, which was having problems. It works great as not only an e-reader, but also as a way for her to watch movies and Netflix. It is very light weight as well."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Received 1day earlier than posted and undamaged and works fantastically"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Got it as a gift, they love it. I wasn't aware that this does not have a front cam though. luckily they preferred it that way."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I love this"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Just her size to fit in her purse ."}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "The tablet works just fine, except for the actual purpose that I purchased it for. Which was to control a device through an app. The unit didn't even see the tablet. I was told the software is too old, but the minimum requirements were Android 4.4. This had 4.4.4. Did not work. .."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Was birthday present for my child. He loves ot"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I should have bought this in the 1st place."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I just the tablet, even though it's a 4.4 everything is a go! Love the tablet. Thanks Amazon."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great product at good price. Fast shipping!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Perfect"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "This works great! Compared to one I bought from else where#)!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I love it already!  Hard to tell it's not brand new coz it seems like it. Very much worth the $45 spent."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "This tablet has stood the test of time and faced hell head-on with my 7 year old son! This was hands down the best thing I ever bought on Amazon period"}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "This is NOT a good tablet for kids. The internal screen is fragile and breaks very easily even with the protector on. Do not recommend."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "good"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I Loved Samsung tablets and products.....but stop putting components or software or dedign your products that allow spying . If you don't I and others will find a compatible product(s) that don't. Please do not respond that you don't...I/we know better!"}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "This tablet is fine if you are watching something (hulu, netflix, youtube, google play movie), reading (news articles, reviews, google play books), or playing music (pandora, mp3, google play music), but it isn't good for gaming beyond solitaire.\n\nAlso the samsung keyboard sucks. The buttom on the bottom left (I think it's cntrl or alt) is useless. If they took that button out and made the keyboard jusr a bit bigger, it would be better off. Also the search key is right next to the back space key. That's just a pain. I wish it came with a normal android keyboard like everything else. Just downloaded one off the play store.\n\nIt is also less than ideal for gaming. It is below the specs to run anything but solitaire. So no hearthstone. Though to be fair my note 4 (above spec for hearthstone) still sees major frame drops at loading screens for hearthstone.\n\nJust realized it isn't 1080p even though this is the first thing to pop up in the 1080p category."}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "I like it,but sometimes I have trouble turning it on."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I bought 2 of these, one for each of my kids ( they are 7 & 5). They have been using them for almost a year. It is the perfect size for kids. And I love that I can throw it in my purse. It is fast, and streams Netflix and VUDU very well."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Bought 2, for both of my son's, ages 4 and 9 they both love them"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Mom loves  it!"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "It's functional is about the best I can say about tablet.  Looking at this tablet at any angle other than straight on results in a quality dip.  The tablet also doesn't pick up WiFi signals on the 5ghz frequency, which is my fault for assuming any modern tablet would be able to do something even cheap Chinese off brand stuff can do.  The sound quality leaves a lot to be desired as well.\n\nOther than that its fine, no defects that I've come across."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Awesome device very quick also had muli screen. This allows you to use 2 apps at once.\n\nThe battery life is extremely good especially on standby, it could be on for a more than a week or more.\n\nMy children just love it, they can watch all of their favorite movies & shows. It can even play all of their leaning games!!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "love it....just buy it for the quality."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Got my samsung galaxy and would have to say I am in love with it"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "Touchscreen is unresponsive at times"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "This model seems to be on the slow side even for what I expected put of the price. The Bluetooth has to be reconnected multiple times on occasion to continue using it."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "This was for my 12 year old son. He loves the app store and that it has expandable storage! It's replacing his Amazon Fire."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Works as well as described, very clear, very easy to manage files and apps in the tablet. Good size to carry everywhere."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Good value for money. the camera is only one way and the quality could be sharper. I find it does easy to hold."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I had one stolen and had to replace it. It's fast enough, battery life is fine and just the right size for watching video on the go."}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "Really bad purchase. I should've saved my money and bought a better quality product. I suppose if you are using it ONLY for reading or the like than it may work for you but I got it to help in school and it was a waste of money. The battery doesn't last long at all, we have to have it hooked up to the outlet far too often. I know it's not a lot of storage but it's ridiculous to have to constantly delete an app. Again I should've saved more money and bought something of higher quality and more storage."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "What else can I help you with?\nLive help is not credit card security encrypted.\n\nAre you using an online account for check out, or shopping as a guest?\nYou too, thanks.\nGreat, thank you."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Awesome!"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "Low resolution, other than that. It serves the purpose,  good product overall. "}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "nice"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Very good tablet"}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "It arrived with a broken camera"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "I don't love the camera.."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great buy"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I  like it very much"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "nce"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "This only had Android 4.4 and can not be updated. Not everything can be run."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Bought a couple as gifts for 2 and 3 years old kids, really good. It's fast, light, durable, etc."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "My son loves his tablet, & that is what makes all the difference!!!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "So far, I love this Tablet!!!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great little tablet little expensive in my opinion but it works for what I wanted it for. It has started to slow down after about a year-and-a-half"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I love this product, im a Samsung person.  I've tried other brands of phones and tablets, none work as good as a Samsung product. I had misplaced my tablet for 7 days, my 2 year old niece had it on her DVD shelf.  My tablet was on 50% battery when I found it. That's how good the battery is, and yes the tablet was on."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "it is great."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "GOOD ITEM, AS EXPECTED."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "it arrived cracked but i returned it for free and got a brand new one the next day! perfect for my son"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "No front camera is the only down side to this tablet."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "No complaints; nice tablet."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Don't have morring to connect to my tv"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great product!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Buen"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great Tablet, works perfectly."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Love this tablet. It stays charged for a pretty long time!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Easy in and out. I can t find a better bag for the money . Well made. Used for a couple months now. I have peace of mind with my pricey paddle in it when it s not in hand on the water."}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "This tablet had poor resolution and would play apps like Netflix and games like star wars galaxy of heroes."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "I bought this to run only one app exclusively and it's a huge fail. Its not the app - I run the same app on my old iPad my old Samsung and my two phones - this is so slow! Connects to the internet as if it was 1991 AOL dial up. Don't waste your money my first gen kinddle fire is faster. Very disappointed - it will be my last amazon electronic purchase. Go to a Best buy and test out b4 you buy. The reviews were very misreading."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Best tablet for kids! Easy to set up. works great."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Purchased this six months ago for my 5 yr old and he loves it. Still fully functional and worth way more than the cost."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "I just purchased my tablet and immediately started smiling as I was taking it out the  box. Just the look and feel of it reminded me off my old Samsung cell phone. I originally purchased the NextBook Ares which was awful.  It was extremely slow so therfor I exchanged it for the Samsung.  So far the setup was easy if you have gmail. Its moderately fast but I can't totally evaluate the speed just yet.  I wish it came with a memory card because I only have a few gigs left and I've only add a few basics apps, like Instagram. I like to play lots of games and download different types of apps so I am gonna need more memory.  The wallpaper graphics are pretty but I wish some of the webpages had HD graphics.  All in all this is a decent tablet and its going to get lots of use by me especially when I download more memory."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Easy setup, fast and smooth.  Got it for the Bluetooth functionality to use with a barcode gun.  Everything works like a charm."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Slow, poor display. Really surprised at how bad this is, especially for Samsung."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "my wife like it"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Not happy how you have to power it the plug internal moves and lose just like the Apple one I owned for three months and was t not covered so what TR I did was tape a small pigtail to the pwer in so I just use thatto power up looks stupid with the tape and wire hanging off ?????? Dave phillips"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Thank you so much for everything. I hope to buy you again in the future"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "Decent... my own fault... did not realize it had no front facing camera... yes my fault but I saw a similar model at Target for the same price..."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I love my tablet and for the money I paid. Its even better"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "This product has a well known issue with the charging system/battery (all over the internet). Apparently with the firmware. Samsung refuses to acknowledge this. In addition, I have spent over 4 hours with multiple customer service personnel (most of whom have a hard time understanding and speaking standard English without an accent) trying to get a 4 month old tablet repaired under warranty. I purchased the unit directly though Samsung's website, but yet they currently  seem to be unable to \"validate\" a receipt)."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I use it everyday and have had it for about a year. It still works great. Awesome for the price!"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "This is the 2nd tablet that I've received that has just gone out like seriously"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I use it for reading mostly but it is great!!! I love it. It arrived earlier than expected and I am very impressed with this tablet."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Ordered 2 for both my sons birthday gifts 1 works ok the other 1 is constantly turning off and on very disappointed for the price I paid"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Bought it for my granddaughters birthday. She loves it."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "My daughter is 4 years old and she loves her new tablet.  Was brand new,  no issues, great  purchase."}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "It was a refurbished tablet has a lot of scratches on the screen is slow to come on and has a lot of odd screens. would not purchase agin."}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "We were gifted 2 of these, and the one updated fine immediately but the second one fails to update firmware. Also cannot watch my live online classes on this. I have tried everything to update it's firmware but it just keeps saying failed to update."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Very satisfied w/ product."}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "Watch out because I bought this one to replace another Samsung Galaxy tablet and now SAmsung make you pay for kids mode. Not cool...greedy company. The older model Samsung Galaxy SM-T110 has kids mode included. no extra cost.  This newer soft ware forces you to submit credit card info to even use the kids mode."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Even though the Tab E Lite 7\" is slightly larger than the A6, it's updates are better and I have not had a problem with it."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Good tablet while it worked. I bought this for my son as a Christmas present. All he used it for was YouTube and games. It stopped working in 3 months. Luckily Samsung has a year warranty."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great Product, my 5 year old uses it all the time has a very good battery life, she is able to stream videos for up to 2-3 hours at most."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Avoid like the plague.  Replaced once already and a month and a half later its to late to replace again.  speakers horrible tablet locking up. sometimes no sound.  internet glitchy."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Works great. Not slow and perfect size for my son to watch Netflix."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Meets expectations"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Bought for my mom. Works well enough for her needs (online shopping, browsing, FB, etc.) - did not except a powerful tablet and was satisfied given the price..."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Love this it was cheap compar all kids tablet yet it had Samsung kids apps.  Cheaper verson for my 2 year old to us in our road trips."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Reliable..great tablet"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "For an inexpensive tablet it has worked well for my 7 year old for the last 6 months. She had previously had Nabis so this was her first adult styled tablet and I didn't want to spend much expecting her to break it eventually. So far it hasn't had any real issues. It has survived any drops it's had inside it's case, and it hasn't had issues freezing very much so it handles the games she plays on it well enough."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Thanks for speedy service! It still works but not with some apps a 6 year need for school. Not the products fault that the teachers prefer everything on an ipad. Teachers should teach the way I learned and not depend on a device to teach for them.  Students can't afford these products for school."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Love the tablet.."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I m very please with the tablet bcuz all in order and good working condition, it was well organise with the delivery pakage, thank you"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "excellent product"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Did not come with charger... For the price I paid it should have. But the description doesn't say that it wouldn't."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "perfect"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I like it"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I bought it so when my grands visited on the weekend they would have something to play games on, they love it."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great little tablet for general use, reading, browsing, etc. Works well, even plays games fairly well. Battery life is good, video is pretty good, although some games do push it to it's limits, but even then not bad."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Screen to dual bought it for my son his apps take too long to download."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "This was a Christmas gift for a 9 year who likes playing with apps.  Just make sure you get an extra SD card and this is perfect for that.  The screen isn't super big so it can make browsing the web hard depending on the site but it is perfect for games.  And since it is Samsung, it if is on the Google Play Store you can download it... much better than the kindles where you are restricted to Amazon apps...."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "great!"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Love it"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "This works well with all the Apps my grandson needed for school."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Great tablet, pretty affordable, extremely durable, I've dropped it many times, Its speakers sound isn't good, and the camera has pretty bad fps and its pretty pixelated. The loading speed and physical quality is great though, the battery doesn't last too long but i can last the battery about 2 days without a charge. Overall, not too bad."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Tablet stopped working after 3 months. It would not take a charge. The tablet would take 2 days to charge. A waste of money."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "My bf hasn't stopped using his tablet. He Loves it and this was a refurbished tablet. I feel like I got  a great deal. I might want to get one for myself. Hasn't had any problems!"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "My son loves it"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I like this cover and feel my table is well protected."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Perfect for a 1st grader ! Excellent for apps, netflix, Hulu very fast !"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Kids love it."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great buy!!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "This table is perfect for my 3yr old! Bough it as a Christmas present It has been several months and it still working perfectly! The camera is not the best but again perfect for toddlers! If yyu are looking at this as an option for kids or teens I'd say it's spot on and you cant beat the price!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Nice cheap tablet."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "A bit smaller than I expected but still great!"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "The absolute worst!!! Tab never kept full charge from first use. Keeps cutting off n coming on. Screen gets blank after half hour of using! This was given as a gift so unfortunately the return window is closed only after 2 weeks which is ridiculous! I contacted them for product support. No response up to now! Do not BUY! Go to Walmart!"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "Little too slow for such a late model.  The rest is adequate."}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "Sometimes you need to tap twice on icons, My complaints is OK google is on but does not work. After doing OS update it's still 4.4 and will not upgrade to Marshmallow 6.0.1. My suggestion to others is just buy new, the one I ordered was advertised as Refurbished and it arrived with a dead battery and after being on the  charger for 3 hours it's just 45 %, Way to long to charge"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Bought it used and the only imperfection is a few tiny scratches...I bought a case....problem fixed! :) I love it"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great Product !!!  AAA+++"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Good"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "GOOD PRODUCT"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I bought 2 of these tablets. 1 had a hard time connecting to wifi untill i got a signal booster. Will be buying 4 more. No flash for rear camera but i guess thats normal for little tablets? I use them for business in my shops for warranty related iems. Overall awesome little tablets for the price!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "My favorite tablet. Very fast boot, easy to use, very good bang for the buck"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "My Brice loves them"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "I bought two of these from the same vendor and this one had problems right from the start! First it wouldn't connect to the Internet and now the screen is going crazy. I am awaiting diagnostics. Not happy at all!!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "good"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "7\" is a lot smaller than I expected. More of a giant phone than it is a tablet."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Used it for all of 3 minutes and returned it. It is slow, cannot use a stylus with it, and feels cheap"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Love it."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Very affordable and works really well"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "No Front View option on camera. I didn't notice that before buying.  If your into selfies you should know this. Very disappointing & my own fault. Other than that it's a good tablet."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Love it."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I like it"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Bought to replace my daughter's outdated tablet. Pretty easy to use she is 5 and she was able to get it up and running herself. Very user friendly, the battery can last all day while playing youtube nonstop. A fully charged battery with the tablet not being used lasted two days so I thought that was pretty neat. Perfect for using her apps and games she was very happy with it."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great product."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great!!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Very nice"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "good"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Love them!!!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "My grandson is getting great use of this product"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Easy to use, fun to play on!!! Great for kids."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Christmas gift for my mom.  She loves it."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "LOVE IT"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Its great"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Love it"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "My son received this for Christmas. It has been a problem ever since. It's as if the tablet is possessed. It doesn't respond the way it should to touch and at times it appears as if someone else is playing it while we are not touching any buttons. It's been less then 90 days and Amazon doesn't do anything about it. Next step is to contact Samsung but it's just a real hassle at this point. It should have come in working, brand new condition."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great for kids with a good price"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Con: missing a front camera"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I got these for my 2,5, &6 year old and they love them. I have had no issues with the tablet.  Great product."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "I purchased this for the video display on my Phantom drone. I didn't do my homework very well because although this was a great price, it does not work on a reliable basis to carry the video from the drone. Sometimes it works, sometimes it doesn't."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "This Samsung product fell way short of my expectations having been a Samsung fan for many years. The screen sensitivity was terrible, I had tap most everything many times and sometimes very hard for an action of some sort and usually, with my lack of patience of such things, by the time something happened I was someplace completely different than I was trying to get to. I could not get it to download Netflix to save my life. It said the app was downloaded, but if I tried to watch a movie, it told me I had to download the app.  The photo quality was far from great, very grainy. I had purchased this pad to use with the quad copter I just ordered and it was not at all suitable for this application. Not sure I would have had the patience needed to use it for anything really. Oh, I just remembered, the battery life positively sucks. It did not take long to charge, but doing anything on it, especially the internet ran the battery down in nothing flat. Might have gotten 2 hours out of it if I had tried. There are some pros to this device, but for me the cons were too many so I am sending it back."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Good"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "My son loves it. He can play all of the games he wants without using my phone. He takes it every where with him. But because it doesn't have dataken he can't always use it. Buthe it's great for the house and when visiting out of town."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "great size for my 12 year old and her little hands"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Very good and original product delivered as scheduled."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Bought these tablets to replace my boys cheap throw away tablets. These work great and have more capabilities. Kids use these for hours."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Excellent Product."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Perfect table for tweens!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great inexpensive  tablet for kids i bought this tablet on sale on amazon for 69.99 if you can get it for under 100 its worth it. over 100$ its not.but it functions  very good with wifi ."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Came on time& great item!! My daughter loves it!!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great deal on this product. I love this tablet!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "my nephews, me, my mom, my sister, and my dad loves this cuddle tablet. i also love it alot despite not paying alot for the tablet. overall i am impressed, and since i liked this tablet i will buy the samsung galaxy tab a for myself. also the ability to connect from a usb thumb drive to a keybaord makes me so happy. highly recommend if your looking for a bugdet tablet. thanks samsung. i will buy another samsung tablet."}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "too complicated for me.  Returned it"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "It never wants to connect to wifi"}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "Only bought it for games but it's very slow when opening apps or selecting things and very poor quality camera"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "sunilda"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "For the price it's an OK product. As for most of Samsung tablets, this one has a nice and clear screen. Nice size for playing games or navigation. The only thing that I missed when I bought this one was it doesn't have front camera. This would be a big problem if you want to use it for video calls."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "This item was exactly what I was looking for.  Very pleased."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "wonderful little tablet, but 8 GB doesn't cover alot!!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "AS EXPECTED"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Very satisfied with the tablet. Easy to use."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "My granddaughter loves it!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Purchased this tablet for my niece. She has not put it down since. Their grandmother had to threaten to take it away from her because she and her  sister were so in love with it, and all the apps and features. I have an ipad and I loved the tablet that I purchased for my husband so much that it took me 3 months to start using my Ipad. I still rarely if ever pick up the Ipad before the galaxy tablet."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "it's a little slow but overall I am pleased"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Our household has nothing but Samsung phones and tablets. My soon to be three year uses this one with no problems. He was frustrated with the kindle because of how different it is with the Samsung products he was used to. We returned that and got this instead. Everyone is happier!"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Great tablet, could use additional memory..."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "get tablet or a great price i think i am a samsung fan for life"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "For the price and everything it's a very good buy. I like this to help me with YouTube stuff"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "This was one of the Best Buy's I did for my little girl. She loves it and downloaded so many game. Great buy!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Item as received."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "This is a very nice tablet.  Im glad I purchased this brand.  It works very well."}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "Not a bad little tablet for some easy games or learning sites for little ones, Camera isn't the best but for a child it would be great."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Perfect!!!"}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "My first tablet Samsung, for the price of a $100 it's great tablet for kids but for me it's not something that I would like to use everyday. I bought this to use it for google maps in a semi truck, and overall web search. Android system is not as good as iOS system at least on this tablet but I could live with that. Most important is the screen, when you move the screen too the left it's dark and when you move it to the right it's so bright you can't see anything, stupid design. It looks like apple iPad but the screen is worst then first touch screen."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Just as I expected!"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Seems like a decent tablet for the price, the only bad thing is the screen clearity isn't As good as the other Samsung tablets."}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "To small for me"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "what can i say it is awesome very pleased. with my tablet!!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Xmas present for a neighbor teen with lousy parents.  Made her very happy and she's taken excellent care of it so far.  Glad Amazon had one for a price I could afford!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Love it!  Fast and color and picture good.  Great product for the money."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Mother-in-law loves it"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Wish I had not bought it."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Ordered for my 7 year old and it works great! He's taken video and pics as well as playing games and it works super well for his age"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "I bought this tablet to do some basic things and let my 2 yr old use it.  It is not bad as far as capability to handle most things any other android tablet can.  It does not have as much memory as I like but for the price we paid I figured a memory card would help.  It did a little bit but not enough that you can put more than 10 to 15 apps on it.  It just will depend on the size of the app.  This is why I like it for my 2 yr. Anything he will like on it will work without issues as the apps are smaller sized.  This tablet is pretty basic and good for kids or inexperienced tablet users.  One complaint I have is that sometimes the touchscreen is iffy.  Over all for $70 it is not a bad deal. If you are concerned you can always get the extra service plan Amazon offers for it."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "At first the touch wasn't working however after changing the talk back features it worked fine"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Good product"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "My son loves it"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "I love my tablet but i really wish it had a front camera."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Excellent tablet for my 8 year old.  Speaker could be louder but no biggie."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Really good for that price is not the most great tablet but workda perfectly"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Excelen!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Bought 3... 2 from Best Buy and 1 from Amazon... they are a great Tablet.. !!"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "I've had this since before Christmas and bought it to replace an 'aging' Asus A100. I don't have any real complaints other than I will restart it every now and then when apps start having issues (like repeatedly closing).  Overall, it's a good bargain (Black Friday) tablet that should serve me well for another couple of years."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Kids love it. Very nice for refurbished"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Worst product i ever purchased, after one update, google does not upgrade after one year, and why would I need samsung apps when I already have android apps ? Your tablet will be hackable without operating system updates and upgrades, I certify this testimony."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great price, a little heavy but works great for what I need."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Came on time. Love my tablet."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "My kids love their tablets and never put them down. Need better chargers but GREAT!!!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Perfect gift."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Amazing!!!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Awesome"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Broken item"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Got these during black Friday for a great price for my 2 kids. We had in the past bought the cheap 29.99 ones for them as they didn't need anything better and the 1st year we did that, they lasted about a year which I had expected so was not upset. The 2nd year they both died after 6 months so this year we \"splurged\" and got these for them. So far they work great, they are zippy and solidly built, the built in memory is kind of meh but it does take memory cards so easily fixable. only other complaint is that they are a bit thick compared to others but for the price we paid I cant complain at all. Over all very solid for the price."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "This is a great tablet."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "I ordered 2 and just save your money. 1 never came and the other so many problems. Spend more and get the 10.1"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Having fun making use of this device."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Our grandson loves the tablet.  Works GREAT"}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "Stalls quiet a bit, the screen quality is very poor."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Loved it"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "My Glambaby baby loves her tablet"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "My son loves his tablet"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Perfect for kid to play on...doesn't have a camera for selfie or high quality/resolution for QR codes."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I love my new tablet....easy to use and convenient to take with!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "My son loves it."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "We bought these for our children and they love them!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Perfect for kids and easy for them to navigate on."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Very good for the kids"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "For the price ,this tablet is a great device. Touch is all over the place but i make it work."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Got it at an amazing prize and was exactly what I was looking for and expecting. Got this for my 5yr old and he loves it"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "it's a good tablet, but comparing it with the Nexus 7 I have to admit the Nexus is waaaay better. I paid so much less for his though, I can't complain. I purchased two white ones and they are both good products. My 6 and 8 year old are using them."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Bought this as a Christmas gift for my 9 YO son who wanted an IPad. Well, no I was not going to spend hundreds of dollars on another electronic device, so I came across this tablet under 100 bucks! Cha-ching!!! I bought it with no hesitation as I am a Samsung user and love Samsung products. This is the perfect tablet for him, he download all his games and apps and it still works like a charm. Camera quality is poor, and it doesn't have a front facing camera, which is to be expected due to the price. Other than that, this tablet is awesome!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Bought this for my senior mom for Christmas. It came in brand new condition in original packaging. The size is perfect for her and very easy for her to use. I think I might buy one for myself."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "great product"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Excelent!!!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I use it more than my computer because it is so portable. Perfect size for me."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great tablet! This is the second one I ordered, refurbished but operates like new."}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "Tablet works well. Haven't had any problems with it, the only thing is I failed to realize it doesn't have a front facing camera. If I would have known I would have spent a little extra on one that does, but works well aside from that"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "They work great and the price was amazing"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I loved it and it was cheap. Did not have front camera though. Other than that it's great"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "very good"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "very nice and a lot of value for the dollar!"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "If you are looking for a tablet for your child to use to play games, then this is good. However, the biggest con is the camera. There is no front facing camera (which I knew), there is also no flash and the quality is very poor. It also does not seem to pick up lighting very well and you need to be in a well lit area. My daughter was very happy to have snapchat (she loves the filters) but yet they don't work! This was really disappointing for me because I knew she would love to use those and I don't understand why they don't work. I got the table when it went on sale for Black Friday so for $70 I would say it's good but I would have been a lot more upset had I paid full price."}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "too xpansive"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Ok"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Glad i bought this for my son. I downloaded a good amount of children's educational games. He's happy and I'm happy. Especially when I'm working from home."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Bought this for our 7 year old and he loves it.  Super easy to set up and allows him to access all the learning and fun games he wants.  This replaced a Fire tablet that would not do that."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Good tablet for the price, we are very happy with our purchase."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I bought these for my grandchildren.  They arrived when expected and the kids love them."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Good product operation that works seamlessly with my Samsung Galaxy."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Perfect product, great price"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I love this tablet. It is perfect. I will definitely order another one."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Work gorgeous"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Not as clear as a picture as I would have hoped but for my 7 year old it works fine"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Nice"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Quit charging & couldn't return it after 30 days"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Wonderful tablet, loads quickly and works very efficiently."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Very Good Tablet. Great Price."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "We bought this for our 2 year old nephew and it was perfect for him!!"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "I purchased one of these units to use for on location quoting. I just needed a simple camera and note taking. Camera poor, the OS is outdated and Samsung will not be releasing an OS update. Please save your money and buy a different brand. I have a galaxy note 10.1 I paid close to 400.00  from Samsung 6 months after I bought it new they stopped supporting it as well."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Works great"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Not really for a child to use. Have to pay $65 for the kids app per year. Would not suggest for a child."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Very nice tablet, got a good deal as a Christmas special on Amazon.  Works great and pretty efficient in use!  Good size for a portable tablet for web browsing."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "My 8 year old got this for Christmas and LOVES it. \"Plug and play\" right out of the box.  It's such a great value for the price.  If I would have thought about it, it would have been nicely paired with a Google Play gift card so he could have purchased some well developed games.  I recommend also purchasing the Galaxy Tab E Lite case with kick stand.&nbsp;<a data-hook=\"product-link-linked\" class=\"a-link-normal\" href=\"/Samsung-Galaxy-Tab-E-Lite-7-0-Case-EpicGadget-TM-Heavy-Duty-Rugged-Impact-Hybrid-Case-with-Build-In-Kickstand-Protection-Cover-For-Galaxy-Tab-E-7-T113-Screen-Protector-Pen-US-Seller-Black-Blue/dp/B01DOREBQY/ref=cm_cr_arp_d_rvw_txt?ie=UTF8\">Samsung Galaxy Tab E Lite 7.0 Case, EpicGadget(TM) Heavy Duty Rugged Impact Hybrid Case with Build In Kickstand Protection Cover For Galaxy Tab E 7 T113 + Screen Protector + Pen(US Seller)(Black/Blue)</a>"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I think the tablet is great and I bought two for gifts for grandkids. They love them.  Be sure to get an sd card so you can download a lot of games, And I was lucky to find it on sale! Wish I had bought a couple more !"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Bought two of these for my kids. We had previously purchased cheap, off-brand Android tablets for the kids to knock around on, but they were poor quality and always seemed to break down. Now Samsung is out with a budget model, and it's perfect. Quality is good, and it does everything we need for the kids (low-end gaming, Netflix, YouTube, etc.)"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Excellent Tablet. Good Quality!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "great back up tablet , very fast and reliable ."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "love my samsung tablets, for this one the only thing i don't like is it doesn't have the front camera, and i didn't realize it when i bought it. thats my fault but other than that another great tablet for kids who like gaming and Netflix. i tried the amazon fire for kids last year and we hated it. I already have 3 samsung tablets and my boys always tried to use mine instead of their fire so we just got them these."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "The cons on this tablet is that it does not have the facing camera, so you won't be able to take selfies"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "great for my grandson"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Very good I like it."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Nice"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Best gift ever for my girls. There is no front facing camera but that is not a big deal. They mainly use it for gaming. Great buy at a great price."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "nice"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Excellent product my son can't get enough of this thing and it's very durable although I do recommend you by a case and screen protector."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great tablet. Purchased as gift and they absolutely loved it."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "My son loves it."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "you can never go wrong with this."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Great value for the price. I bought this tablet right before we were about to go on vacation, and I needed it to load a bunch of cartoons for my kids to pass time on the plane. It did great! I put a 32GB SD card in it. Five hours on the plane - battery did great. By the time place landed I had 60% left. The only reason I don't give it a five star is that, for some reason, if you don't press the power button - it will not turn the screen off. It will run the battery dry, if you leave it unattended for a long time. But, again, for the price of $67, you can't go wrong."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great. My son loves it."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "My mom is ecstatic."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Great Christmas gift.\nMade my mom cry when she opened it.\n(She's not used to getting christmas gifts that aren't socks or blankets.)"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Love it"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Got two for my children a three year old and an 8 yeAr old they love them only gave a 4 star because I didn't realize it has  it front camera."}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "This product was something my 9-year-old really wanted.  We got it for her for her birthday in August.  My husband and I have had the hardest time helping her figure it out.  We don't ever use Samsung products, so we're finding it really hard to help her.  I don't like how we can't put parental controls on it.  For Christmas, we replaced this with an iPod touch and we've been much happier with it.  Maybe for someone who is used to using Samsung products, this would be a better buy.  Nothing was wrong with the product itself, we just had a hard time figuring it out!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great tablet! Everything functions well and I use this quite a lot!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I bought this tablet for my granddaughter.  She loved it."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "It is the perfect size for my 10 year old. The features are just the same as any larger Samsung tablet! He loves it."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Excellent product"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "SO FAR...EASY FOR A 4-YEAR-OLD TO USE."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Excelente"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Amazing"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Ordered this for a Christmas gift. With a 32gb storage card this tablet hold maybe 3 games. Manually going in a moving the games solves nothing. Deleted the games and tablet still registers as full. Factory reset multiple times & formatted SD card and still nothing. Called Samsung with no help aside from being advised to drive 30 mins away to nearest Best Buy and have them look at it. Do not recommend."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Very satisfied with this product. I didn't think about the lack of camera when I got it, so its not helpful for skyping and such. And the keyboard takes some getting used to if you're only familiar with phones and PCs. But the sound is decent as well as the audio. Apps work pretty well, though Hulu seems to have some issues with this particular tablet. I emailed Hulu and they took me through a few steps to make it more compatible, but it still freezes sometimes -- seems more a hulu thing than the tablet at this point. All in all, very worth."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Great tablet for the money. Got three for the kids and they love them."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Perfect for my son to watch videos "}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "THE KICK STANDS BREAK TOO EASILY"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "It's a tad slower than i expected & does NOT have a front facing camera which is disappointing!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Each of my children have one. Easy to use and works great"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Very clear picture. Easy to use."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "exc!!!"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "No complaints from my son yet since he got it at Christmas."}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "Good tablet, but does't have a front camera."}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "Did not realize it did not have a front camera. My daughter is unable to do her musically. ."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "good"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great tablet"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great for my 9 year old daughter.  She has everything  she needs"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "The screen is dark and was not what is had expected .spend a Lil more and buy a better one"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "I have order 5 of these tablets Samsung Galaxy tablet E lite 7\" I have only received 4 of them .could you please contact me on my email letting me know what to do thank you."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "It actually showed up early. And when I got it open everything was there turned it on and started syncing my info. I was very happy with my purchase. I shopped around and I just couldn't find a better price than amazon. I will continue to shop here , given I have never shopped online before. Great first experience and will continue to go here first for all online shopping."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I bought this more my mother in law as a Christmas present and she loved it. She wanted a tablet with expandable memory because her fire tablet did not allow that. She is happy with it, including the accessory kit that Amazon also offered as an add on. Great product!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "My granddaughter received this for Christmas.  She loves it.. great size so convenient a + for a gift!!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Everything is 'A' okay with it."}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "Good for the price."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great device am glad I bought"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "excellent item"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "good"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Good"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Wish the charger cord was a foot longer"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Every excellent, thank you so much."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Awesome product, awesome transaction"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "At first I was disappointed to learn that I could not download the Samsung Kids Mode app which does not require a subscription and is different from Samsung kids. But I found a different parental mode app that worked just fine. The kids love them."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "The best, thanks"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Great device"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "My son loves it,"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "I bought two tablets - for twins - one worked great - the second worked great but took forever to charge, drained more quickly and became very hot. God bless Amazon, they are replacing the bad one. But I was disappointed and so was one of the twins. Not thrilled with the Samsung product."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great device and for the right price!!!"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "I had never owed an Android device before but got this for a child. The setup was quick and easy and the interface for child friendly."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Good"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "The tab don't come with charger so i expect the charger."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Delivered on time and exactly as described."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "nice tablet, wish it has camera at the front."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Product does not work for me at all, it stop working at the third day of use. The battery only last 3 hours and the screen never gets turned off. I 've have other products from samsung but this tablet is disaster i just want my money back."}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "No tiene c&aacute;mara frontal.."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Samsung Galaxy Tab - so far so good."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Husband loved it."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great for my almost 3 year old son to play his games. Does not have a front facing camera, but this is ok. Battery power is excellent.  Must purchase a case to protect tablet."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "its just like descripbed"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Good tablets"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Excellent works great."}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "Didn't come on time\nPrice was great\nReturned to company"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "So far so good. We will see how it holds up for an 8 yr old ;)"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Ordered 2 of these for awesome price fast shipping more importantly kids loved it"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "No front camera.  Therefore unable to video chat."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Imagine quality sucks!!! Might as well spend the extra $30 and get the tab a"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Nice"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great tablet  for a great price! 100 % satisfied."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Very happy with this tablet. My son loved it. Its the perfect size and feels well and performs well. Definitely not a junk tablet"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Is really amazing"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Everything we expected and more!!!!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Awesome"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Bought this as a gift for my daughter and she is in love with it\nAlso the price was reasonable"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Perfect for all grandkids!!"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "It didn't work. The screen didn't register when you touched it and there was not enough memory for one game even."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great fit"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "Resolution is not good"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I am very satisfied"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Perfect size tablets for regular browsing and videos"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "THIS  A REALLY GOOD DEVICE."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Nice product  bought for 92 yrs old mother  easy to use"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Not bad for someone new to android and still has expandable storage should suit the nephew nicely"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "It sucks"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "So obviously there's some criminals working at Amazon who would steal a Christmas gift from a 2 year old and pull a switcheroo move. I'm not dumb in the slightest way. That's okay because karma comes back around. Thanks for ruining Christmas for my son."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great tablet.."}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "Product arrived as promised yesterday thanks. In all previously placed orders of of $50 or more why was I charged for shipping handling and tax and sales tax this has not occurred previously note the tablet is for an Intercity Detroit student 12 years old to improve her Scholastic and self-esteem thank you"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I bought these for my kids for Christmas. They wanted a smaller tablet closer in size to a phone. They love it. It works great it's light and easy to carry around."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "that product was low cost(67$) and somewhat has good perpormance.\nreasonable choise. as you know, this is wifi only model and has low display resolution"}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "It is good."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Very nice iPad. It works great for a 2 year old toddler."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Awesome!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Purchased for my mother in law and she loves it. It's exactly what we'd hoped for."}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "The table froze."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I bought this tablet for my 3 year old daughter, so she can stop asking me for my phone!! she loves it this tablet is better than the Samsung galaxy tab3 it has a kid mode with games and movies already available to watch. I would will say this has been one of my favorite purchases from amazon great job"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "On time and exactly as described"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "The whole reason I bought this tablet was for my daughter to use. I can't open the google play store app therefor I can't download any of the apps she likes to use. I am so frustrated as it just came in the mail this morning. I tried all sorts of things to get it to work and spent 30 minutes on the phone with a very nice lady and still couldn't get the play app to work. It is brand new out of the box!\n\nUpdate! Before I was using my husbands email to set up the tablet as his account had all the apps downloaded that our daughter likes. I ended up trying my email and surprise, the google play app works now. Very happy as everything else was working perfectly and didn't want to have to return it"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "My adult daughter really likes this tablet.  It's all she needs for internet usage and an occasional game."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "my daughter loves her new tablet"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I got the package in the time it stated it would arrive to family overseas! My daughter loves it!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Very good quality"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Better than I expected .  Great for my 3 year old . I suggest you buy micro sd card for additional storage."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Bought it for my niece. And she likes it."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Just basic tablet, no more no less, exactly for playing videos on youtube an netflix, don't expect more."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I can't remember when i got this but i am still using it without any issues, i am 71 and a great grandmam not very tech savy, but i had no problems with set up and operations.  If it has a a limit to how much you can have on it, i have never reached it. I have lots of apps, books, Netflix,  email and much, much more on mine. I throw it into my purse when i go away. It will go to Europe with me. Uou will want a nice cover for it. It's slippery for my old hands. I picked up a cheap cover at a  discount store. It was a very fair price and i don't know what else a person would want in a tablet."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "This is a nice tablet if you can catch it on-sale.  Otherwise there may be better options for the price.  That being said, it has Android 4.4.4 on it which is pretty old now.  It does have a February 2016 security update level so that's kind of cool for how old 4.4.4 (Kit Kat) is but still fairly out of date.  It seems to run pretty smooth and plays basic games fine. The nice thing is it does allow moving apps to the SD card.  I got this for my son so I didn't bother to try rooting it."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I use this tablet everyday and every night. I'm so glad I bought it and for the price you can't beat it."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "THANK YOU FOR MY SAMSUNG GALAXY TAB E / NOW THAT THE GALAXY IS ON SALE AT A LOWER PRICE, WOULD YOU ( PLEASE ) CREDIT MY ACCOUNT FOR THE DIFFERENCE ? THANK YOU FOR YOUR TIME & WE WISH YOU & YOUR TEAM A SAFE &  A HAPPY HOLIHAY. YOUR'S TRUELY ( MICHAEL MAYEUR  )."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "I bought this tablets because my co-worker bought one for Her son from the store and I was very pleased with its performance. I've been looking for good  strong tablete for my son so I decided to order the very same one as hers. It looks new came in its box with manual and charger but performs poorly. I WOULD ThINK TWICEE BEGORE ORDERING THIS P.O.S. it doesn't hold charge. Half way into the day it needs to go back on a charger and after Being charged the battery drains so quickly thaT my son doesn't get maximum  use of this P.O.S. when using certain apps I get the notification that they have stopped responding and other apps just open in their places if I select ok to the notification. Generally I find it Is lagging. It takes like forever to respond to a demand. Overall this P.O.S. was a major let down. I ordered another one for a friend I doubt I'll end up giving it to her. I also need to comment that scree  rotation works when it wants. Sometimes it works dometimes it doesn't. For example I wanted to rotate the screen on YouTube it refused. I tried doing it on my email it refused. I left the apps an went back to them it worked. It does that continously. Again this P.O.S. deserves no stars. i officialy rate this  product at a 0 stars. i Synced email to this app and the tablet malfunctioned by shutting down my email whilst I was trying to access it and that caused all my emails to be deleted. I've lost all my important email thanks to this P.O.S."}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "Fast shipping, and got it as a gift for my mom.  Love it."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Each one of my grandchildren have one.\nFor a total of 5"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Exactly as described. This tablet we got as a gift for our parents and its perfect for games, Facebook, and photo sharing which is mainly all that they do."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "arrived fast and brand new in a sealed box with all paperwork. my son will be so happy to unwrap this. great price. would definitely buy again"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Works very well. Happy with the purchase. I did disable and remove a lot of the factory apps."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Overall wasn't worth what I paid for"}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "Needs more memory. This is my fourth Samsung tablet.  The screen is not as clear as previous models.  Also, it seems to be very jerky and doesn't stay on a website for very long.  I'm very disappointed in this model because my previous ones were so good."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "daughter loves it....nice size screen, light weight, well constructed and fall resistant....would buy another one if needed."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Fantastic"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "The tablet not good problem de fabrica"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Seems to be a good buy so far."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Love Samsung's products!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Set this up for my dad. He should like it but I do wish the volume was louder for listening to music."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "excelente"}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "Quality not so good when watching videos."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I have purchased 4 tablets from Amazon in the last couple of years. You might wonder ,why so many  ? It's because Samsung makes the best tablets in the world. I have given one tablet to  each of my kids, one to  my wife and one for myself. My family loves Samsung products and so do i."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "This is the fifth one I have bought for grandchildren  Perfect gift for the price!!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Pretty good little tablet for $68. Seems to do everything asked from it although it is a little slower then a comperable iPad.\nWould recommend"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Everything was great!! Fast shipping thank you!"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "It will play videos OK.  However Live streaming will lock it up and it has to be rebooted.  I have tried from several different place and it is always the same."}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "Cheap tablet. Screen resolution is terrible. You get what you pay for."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great size to work on projects while away from computer.  Love the quick response time and the easy of use. Just the right size,"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "A little  dated but does the job"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "good item"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "It has performed exactly as I expected and what I wanted to use it for."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "I thought It was bigger and I have decided to go a different route. How could I go about that"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "bought this for my two year old and she absolutely love it she sleeps with it"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "because no front camera"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "This is my 2nd samsung tablet, and I honestly expected more. It's only slightly better than the generic tablets that I've bought for my destructive kids in the past. I'm glad I didn't pay full price for it, otherwise I'd have returned it."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Good value fast shipping"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great little tablet. Does just what I need."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Happy with it. I did put a 128gb micro sd card for my movies and it works great."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "So far, so good. It does exactly what we needed for my 4 year olds. With that said, the quality of the screen is sub par compared to my other Samsung products. For the price though, they are great! I purchased two."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "This product didn't work....screen keeps blinking on and off...."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "All my kids have this tab! It's great for all ages."}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "I didn't know the difference between the tab E and A.  This is the E lite and it won't stream. I don't know what the purpose of this tablet is. I guess it a cheap option to give it to the kids, so you don't have to worry about them ruining it? Seeing how I only wanted a tablet to leave next to my tv to stream moves, it was a waste of 70 bucks. I guess this was my own fault, I read over the information, but didn't understand until I tried it."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "It's a Samsung tablet. What else can I say? Works great, looks good, and battery lasts decently."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "No front camera!!!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Thank you so very much. So happy with my Samsung galaxy tablet."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Buying a tablet for the first time on a budget this is the way to go.\n1. Handles video streaming very well with Netflix and crunchyroll.\n2. Internet browsing is smooth no problems there.\n3. 8gb not an issue when you can buy 32gb microsd for 12$\n4. Space limited but light gaming like Madden and some emulator games are good."}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "This is a great tablet except it does not have the ability to do screen mirroring\\casting. That is disappointing to me. However, if you are looking for a great tablet to Facebook, email,  and Netflix on, this well work great."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "So far we love it. We have only played around with it enough to set it up with all my sons favorite apps to surprise him for Christmas with it. But I am pleased."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "If this were the only tablet I owned, I might write a different review.  But at this price point, I bought two of these tablets to add to the other devices in our household.  Its function is for youtube and apps, and not for web surfing or taking pictures.  It's sufficiently fast for that.\n\nMy real criteria for rating tablets, aside from speed, is durability.  I have confidence that Samsung devices will be durable, and avoid problems like failing to charge six months afterwards --- problems I associate with no-name devices.  Time will tell, and I will update the review if I have any problems.\n\nOne tip.  I find that hockey stick tape is an effective and cheap way to create a bumper guard for tablets.  Just tape it around the sides until you get a reasonably thick bumper, being careful not to cover the ports that you need.  It's cheap, and if you take care doing it, it doesn't look bad.  You don't want to spend 70 bucks for a tabet, and then shell out another 20-30 bucks for a sleeve.  But if you don't cover the device, it's almost certain to break on you."}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "I have a difficult time opening my emails on this product. Burns through battery in 4 hours."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Excellent for the price"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "The camera is not good...takes blurry pictures...very slow to connect to internet...I mean for $99 it was ok...I wouldn't recommend it though maybe for a child..."}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "Too small for other than emai. i wish I would hae ordered a bigger one."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "+ good tablet for the price\n+ not slow for a $68 tablet. I wish I'd seen this instead of&nbsp;<a data-hook=\"product-link-linked\" class=\"a-link-normal\" href=\"/NeuTab-10-1-Inch-Octa-Core-Android-5-1-Lollipop-Tablet-PC-1GB-RAM-16GB-ROM-Bluetooth-4-0-Dual-Camera-Mini-HDMI-output-1-Year-US-Warranty-FCC-Certified/dp/B01DTINEDE/ref=cm_cr_arp_d_rvw_txt?ie=UTF8\">NeuTab 10.1 Inch Octa Core Android 5.1 Lollipop Tablet PC, 1GB RAM 16GB ROM, Bluetooth 4.0 Dual Camera Mini HDMI output, 1 Year US Warranty, FCC Certified</a>&nbsp;when I was shopping for cheap tablets.\n+ good pool of accessories to choose from\n+ decent battery life. I use it to play games intermittently throughout the day and one charge lasts me the entire day with about 20-30% left at night.\n+ great for playing Hay Day. Finally! I cannot count how many tablets I've gone through just to find one that plays Hay Day decently.\n\n- screen looks washed out in certain angles.\n- no front camera (which could be a deal breaker for some)\n\nI would recommend this tablet for an entry level tablet, or for playing games, but if you have an additional $30, get the&nbsp;<a data-hook=\"product-link-linked\" class=\"a-link-normal\" href=\"/Samsung-Galaxy-Tab-A-7-34-8-GB-Wifi-Tablet-White-SM-T280NZWAXAR/dp/B01AZ7LQ00/ref=cm_cr_arp_d_rvw_txt?ie=UTF8\">Samsung Galaxy Tab A 7\"; 8 GB Wifi Tablet (White) SM-T280NZWAXAR</a>&nbsp;instead."}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "Purchased for my brother in the hospital....disappointed no front camera to video chat on facebook"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "All ok"}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "Good tablet, but was unable to change the language of the device to Italian.  Could only change the keyboard language.  Returned the device."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Excelente..."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Disturbing poor device.  Touch screen does not function properly & processor is extremely slow.  Burns thru battery very quickly.  Worth about 1/2 of its going price"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "The on screen buttons are extremely small.  Even my 5yr old granddaughter has problems with the button.  Items load very slowly."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "My son's tablet had broke this one serves its purpose and he's happy The seller of the item also shipped very quickly"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Bought as an early Christmas gift.. will get more information as soon as it gets more use."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "It works very nicely. I can read my kindle books much easier. Thank you"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Perfect for my son to play games on and surf the web."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great product. amazing speed of delivery!"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "I should have researched it a little more  there's no front camera. That's what I needed"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Good tablet for a great price."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Family tablet.  We own two now because I liked mine so much, my husband bought one.  The Samsung Galaxy Tablet is user friendly and supports many different applications. We love ours."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Not the greatest tablet in the market, but get the job done."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "This is as described and arrived on time. The camera doesn't work properly and it has a few glitches, but my 8 year old is happy with it."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Love it\nWorks great"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Easy to use. Best for someone who doesn't have much experience with technology. I got it for my grandma and she loves it"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Thakn you"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Item was exactly as described and my mom loves it. It's a great tool for someone who is not all that familiar with the way in which technology works."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Good tablet. Just needed one as a backup this suited my needs"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "The Samsung Galaxy Tab E Lite 7-inch tablet is good for use as an e-book reader, calendar operations and checking e-mail.  Which is what I use it for.  I was looking for a relatively inexpensive backup for my Google Nexus 7 and this works wonderfully.  I wanted to be able to lock the screen but had to go the encrypting the device with a very secure password.  For what I wanted it for the Samsung works great."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I love the speed of it & the touch! I just wanted it to download learning games for my daughter & she loves it!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "These tablets are so great this is my 6th Sumsung Galaxy tablet tp order for me and my grandkids."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Was perfect"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Luvvvv this tablet.  I was nervous that it wouldn't be fast enough-it works great.  I've only picked up my laptop once in the last 4 weeks after receiving this tab."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Oh, I am so happy! I have an OLD Tab 2 and it sucks now. Lately, it has gotten so slow I want to throw it across the room. I have tried everything to figure out why to make it faster - deleted apps, etc... After so much frustration, I finally broke down and bought a new one! Hallelujah! I had it set up almost exactly like the old one in less than an hour, that includes charging time. It's so fast! And it is so much closer in layout and functions to my Galaxy S6 phone than the old one was. I did look into buying another brand but I was concerned in not having an Android OS because there are some apps that I can't get with the other OS. I am loyal to the Samsung brand, what can I say?"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Bought two of these over the summer for my daughter's birthdays.  They are very pleased with them."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Love it"}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "Wont hold a charge, CRAP"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Love it"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "This turned out to be just right. I wanted another tablet in addition to my Kindle so I could access the Google Play Store for some games I could not get on the Kindle. I first tried a very inexpensive no brand tablet and it never even started up. Back it went and I tried this one. Great choice...works well and is very intuitive to use.  Kindle will remain the favorite among the tablets, but now Zombies vs. Plants 2 and other games are available too."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Son loves it!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Love Samsung products and well worth the money, excellent value, very happy with purchase."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Grandchild LOVES it!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "i love it, but i cant get on Wifi with it"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "This is one big POS! I just went to eBay website, clicked the drop down menu for My eBay, and not only did it not acknowledge my choices (I was trying to access recent purchases) it wouldn't allow me to sign out OR close the drop down menu. At one point I was pressing it so freaking hard I thought I was going to crack the freaking screen!! Save you money and buy something that works and won't burn the house down."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "So far I have no complaints, works well and remains charged for a fairly long period of time (took about a week before it first died.) I use it mainly for reading school material and assignments."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Better than expected"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "nice tablet"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Came broken and was a big deal to made the refund."}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "My son used his birthday money to buy this to upgrade from his kindle. It all seems to work well exept when I went to install Boom Beach for him it said it wouldn't work on this device. He wanted the tablet because he could not get that game on his kindle and wanted his own Boom Beach game now I have to break the news to him in the morning. Already ordered it to be returned."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great tablet, got it to replace my nieces older model Samsung. She's only eight years old but it was super easy for her to boot up and play around with all on her own. Very lightweight, yet sturdy, well worth it for the price."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "It's a little too heavy to comfortably use with one hand for extended periods while surfing / reading. Otherwise very satisfied especially for the price."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great for my 4 and 5 yo"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "good"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "AWESOME and a great price!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "It's great"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Very pleased."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Works as expected"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I am extremely pleased with Samsung Galaxy E LiteTablet.  I amazed at its capability for a tablet that costs less than $100."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Very nice indeed"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Beautiful screen,  perfect size for running the square app for my new business.  Expandable memory and since it's just a bigger version of my cell phone I didn't really need to \"learn\" it.  It suits my needs perfectly."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I bought this cup because I work in a factory and wanted something that would keep my drink cold. Well it keeps my drink cold for more than 24 hours. Ice keeps for same amount of time. Will definitely be buying a few more!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Very good  board of  unfortunately my son put a little crack on the screen ?  Am I cover on the Samsung warranty ."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "I bought this for my 10-year old son, mostly for games. It freezes on every single game. Terrible. Do not recommend."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "My 3yr old loves this tablet"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I love it!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "easy to use.  I love it"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I really like this product. I'm enjoying reading on it."}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "I tried using this, but after about three weeks I got tired of the bad touch response. I'd often have to hit something multiple times before the tablet would register. It would take my forever just to do simple tasks. I finally returned it."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I absolutely love it.  I have a Samsung Galaxy phone so this being my first Samsung Tablet made figuring it out easy.  I was already familiar with setup and how it operated thanks to my phone."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Purchased it as a gift. Fast delivery, great product."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "It is excellent.....just rge right size; and works very well."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I use this to read e-books but a great way for me to check out other things online as well."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "It is major upgrade from my old Nook. I am loving this tablet.setup was easy and it has all the features I need."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Outstanding"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Got it for the Olympics, to watch other events, very happy, had trouble setting up for the WIFI Cable TV, found out it was the Cable TV's software app, not the Tablet, recommend to everyone as extra , outdoor type tablet!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Good valu, although sound is knd of low"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Definitely recommend"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "Color is not as vivid as I would have liked it to be. Holds well though. Nice case. Works fine."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "This is a really good tablet. Its inexpensive and does everything you would want a tablet to do."}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "my fault  ng  foir me"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "Overall good value for the money.  I purchased this Galaxy to replace my iPad Mini and it's just not the same.  Much slower than the iPad Mini.  Battery life is not very good when used actively."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Like Samsung products.  Always meet expectations"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I love it! The only bad thing is that it doesn't come with a USB port to charge other devices"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "My boyfriend really liked this for his birthday present. It runs very smoothly and for 99 bucks it feels very nice and not plasticity. Also it came early."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "love it"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Only have tablet for a short time but so far has worked great. Bought for my 10 year old son to play games and watch videos he loves it"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "Not bad, but not something to write home about either."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Excellent for my little brother!!!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Liked it being light weight. And slim"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Came Broken :( waiting for an exchange"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Bought this as a gift for my daughter and she loves it.  Open box but no problems with it at all and it was as pristine as a new one!  Great buy on a great tablet!!!  She wanted a white one and I was lucky enough to find this one!!"}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "The operating system does not live up to what I have come to appreciate from Samsung and Google. I was disappointed with the limited homescreen."}
{"rating": 2.0, "product_id": "B01AZ7LT20", "review": "Don't remember ordering this item. It has been sitting on my desk since I received the item and not being used. Not very interesting."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Very happy with this purchase."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Good table, no much ram memory"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "I needed a replacement for my large old galaxy tablet. This is an ok replacement for what I need. I was surprised by the low screen resolution. Add in the reflection off the screen, it is difficult to read by lamp light. You have to hold at just the right angle, or the quality goes way down. Forget using the camera, poor quality.\n\nThe one plus when compared to my old tablet, the battery lige is good."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "It's not worth to buy. There is no front cam in this tablet and can't be used for messenger calls."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Muy buena"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Bought two, very nice although I have been unable to complete set up."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "my son liked this  Samsung tab till it broke"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Very happy with this tablet. Easy to set up. Value for your money."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "It works great the only thing I don't like is that it doesnt has a front camera but other then that I like"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "I bought this tablet here in Chile where it is called tab E t113 7 inch. One annoying thing is the letters on the screen are dim unless you rotate the screen perpendicular to your eyes or even further. I found myself looking for a color contrast screen setting. It must be an inherent aspect of this screen design. It's rather annoying as the letters fade so the whole screen seems pale."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Superb even without the front camera. Easy to use and compatible with my laptops."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "I like it!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Cool tablet."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Bought for my 8 year old daughter and it was great!!"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "Screen isn't clear."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "YESSS"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "The Samsung Galaxy Tab E 7-inch Tablet is a decent entry level/budget tablet. It is not for someone who has been spoiled by higher screen resolutions (at 1024x600 this is only decent). It makes a handy extra tablet to have around the house to use for various tasks, such as checking email, occasional web browsing, as a remote or  for other odds and ends. It would also serve well as a POS device. It is a bit on the heavy side for a tablet of it's size (compared to other new tablets on the market), but keep in mind this is a budget model and a good value for the price."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "This was a replacement for another tablet that my wife dropped and ended it's life. She now loves this one more than the old one. Excellent."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Muy buena"}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "After using an iPhone and iPad for a few years, I decided to try this Samsung tablet.  The Samsung Galaxy Tab E-Lite has several things going for it and a few things against it, especially when compared to the iPad.\n\nFirst a few pros. The price - at $120, this is a great tablet.  If you don't have the money to shell out for the ever-popular iPad, the Samsung will most likely give you everything you are looking for in a tablet.  Did I mention its relatively inexpensive?  Memory card slot: here is where Apple can take a lesson from Samsung  I want to be able to expand my tablets memory capacity.  With this tablet, I can do that with a Micro-SD card.  Setup was pretty simple.  I connected my Google account to the tablet and in a few minutes I was exploring my apps options in the Google Play Store.\n\nNow a few cons.  I find that its not near as responsive as my iPhone or iPad.  If you're not picky about responsiveness, you won't mind as much.  But going from an Apple product to this Samsung was like taking a step back.  It was rather frustrating.  Also frustrating was that some of the controls are simply not intuitive.\n\nOf most concern to me are the poor parental controls.  My kids will probably be the ones to use this tablet the most for videos and games.  Ive set up some parental controls to limit what they can download, but so far Ive been able to go into the Play store and download free apps without ever having to put a password in.  Short of disconnecting the wifi from the tablet, I still don't know if Im doing something wrong.  When it comes to parental controls, Apple has Samsung beat hands down.\n\nOverall this is a good tablet especially for the price.  If this is for kids and you are wanting good parental controls, you might look elsewhere or again, disconnect the tablet from any network."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Love this tablet! I first bought the new Kindle Fire for my son's birthday & it was terrible. A lot of apps didn't work including YouTube, and the charge input messed up within a week. I returned it & bought this tablet & we are all very pleased with it."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Gift for my husband.  Replacing his broken one. Last Sunday he put it and his cell phone on top of the car. Left them there. Got to church and realized what he did.  He went back to find them. He watched a car run over the tablet throwing it up in the air. The tablet in its case survived with hardly any marks. He also saw his cell get run over. Also a Samsung Galaxy grand prime. The cell didn't survive. Insurance replaced it. So I really have to recommend the tablet and case. We don't know how many cars actually ran over them. A Sunday morning on a busy street."}
{"rating": 3.0, "product_id": "B01AZ7LT20", "review": "The \"Samsung Galaxy Tab E Lite 7-Inch Tablet (8 GB, White)\" is a respectable entry level no frills small tablet (7 inch screen).  It is lightweight (less than one lb.), easy to hold and handle, and certainly the price point is favorable to those new to tablets.  It can do most functions casual tablet users desire such as web browse, read ebooks, handle email, play games, and take photos with the rear facing camera.  It is easy to navigate and to access and download apps.\n\nIt has 1G of ram and 8G of ROM (really not much), operates at 1.3 GHz., and comes with a 7\" display screen with 1024x600 resolution.  It functions on an Android 4.4 KitKat operating system.  It is Wi-Fi and Bluetooth enabled and comes with a microSD slot to increase memory up to 32G.  It requires a Lithium ion battery (enclosed) claiming a nine hour life per charge but mine has not lived up to that level.\n\nIf you are a longtime tablet user or, like me, have used iPads for years, adjust your expectations for this tablet.  It is slower and less responsive than tablets I am used to and I find the browser to be a bit clumsy for this product.  It has no front facing camera which may disappoint some younger users.  And as mentioned, storage space is very limited at 8G.  All in all, an effective entry level tablet for the budget minded that would be attractive to the casual, part time user or for a youngster getting acclimated to electronic products.  3.5 stars."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "I don't like that it doesn't have a front camera and that it breaks easily if it drops.very poor quality on internet as well"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Everything about it was excellent. My grandson who is three years old is especially thrill about it. It's his new best friend. He does not leave home without it."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "For a small, budget tablet, this is pretty good.  The only other tablet I have owned is an iPad that I have used heavily for about three years.  The Tab E Lite not only has a smaller screen (obviously, at 7 inches), it is slower and less responsive than my now aging iPad.  Still, it works, has a decent feel to it, and let's be honest, using Chrome on a tablet is better than Safari.\n\nTwo other points worth considering.  The battery drains without use at a faster rate than an iPad.  That's a minor annoyance.  The thing that gets me is the inclusion of a microSD port.  If you are going to put another port on a tablet, why not a USB port, or maybe HDMI?  With HDMI, I could hook this thing up to my projector and not have a chord running across the room.  With a USB port, well, even more options. MicroSD?  Really?\n\nThose are minor complaints given the price tag, though.  For a small, budget tablet, this thing gets the job done.  It lives on the coffee table, and if you want a budget device to keep around the coffee table just to have it there, this is a solid choice."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Great tablet for a great price.  Only thing missing is a flash and selfie camera.  But still a great buy! !"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "This is a nice small tablet.  I use it primarily to read e-books, and the batteries last a long time.\n\nThe only issue I have is I seem to frequently make entries on the touch screen by holding the tablet on the edge.  I suppose the sensitive area on the screen is just too close to the edge to make it easy to hold without setting it off."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "A must add for this tablet is the 32gig sd memory card. Great unit for the price."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Excelente producto"}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Customer very happy with product"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Powerful enough to do most any job.  Good price."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "A little bit slow but great value for the money."}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Muy buena compra y sin problemas en la entrega."}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "This was a great budget pick in my head but that went out the window once I switched the tablet on. There is something off about the screen which gives me the sense of parallax or blurriness every time I look at it. There is also no 5GHz Wifi capability which seems really archaic in today's day and age. One of the tablets seem to need to be constantly manually reset as well. Buy something else!"}
{"rating": 1.0, "product_id": "B01AZ7LT20", "review": "Item quit charging 8 months after purchase! Dont waste your money!"}
{"rating": 5.0, "product_id": "B01AZ7LT20", "review": "Bought this for my husband for Christmas & he loves it. Movies, games, video calls...he does it all."}
{"rating": 4.0, "product_id": "B01AZ7LT20", "review": "Good physical condition. Freezes"}
